[
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1g9kp1cnu209s002", "rating": 5.0, "text": "A great place to work for, supportive environment. Managers are supportive and provide you with the opportunity to grow. I will recommend to junior and intermediate staff.", "pros": null, "cons": null, "date_created": "August 4, 2022"},
{"id": "1g78qco6nk5qp802", "rating": 5.0, "text": "Well paying, good hours and understanding management. Great experience as my first job with the City. There are opportunities to advance and network your way into other positions with the City.", "pros": null, "cons": null, "date_created": "July 5, 2022"},
{"id": "1g1env5ipo1hp800", "rating": 1.0, "text": "Not worth the pay, not worth the effort, they more than likely wont pay you for using your vehicle at work either. Working on councillor's row makes you lose your will to live because it's corrupt ", "pros": null, "cons": null, "date_created": "April 24, 2022"},
{"id": "1g1e2e1b9ocra801", "rating": 4.0, "text": "Great place to work, very good to their employees, pays well and has a very strong union. The only downside is that it can take a long time to build enough seniority to work your way from part time to a full time position.", "pros": null, "cons": null, "date_created": "April 24, 2022"},
{"id": "1g14defuls7mm801", "rating": 3.0, "text": "Very well trained but on your own once complete so you better have a lot of self confidence on your driving skills as well as knowledge of city. A sort of out of the pan into the fire but after about. A year it all makes sense and you learn to adapt job to your specifications within limits.had a lot of fun with people,oh,another skill you ll need ,people skills.", "pros": "Pick work detail", "cons": "Split shifts", "date_created": "April 20, 2022"},
{"id": "1g05qfl9a308k001", "rating": 4.0, "text": " IT experts and other professionals who work at the intersection of health data, technology and innovation. The work is exciting, the people are passionate, and the environment is collaborative and fun!", "pros": null, "cons": null, "date_created": "April 8, 2022"},
{"id": "1fucjvna0t5js800", "rating": 3.0, "text": "Great stepping stone job but no room for growth beyond thatFull time hours available all summer but no hours year roundyou can easily be driving from west to east end in one day for 3 different shifts for only 8 hours.You cannot work over 30 hours.", "pros": "good coworkers", "cons": "short and random shifts", "date_created": "March 17, 2022"},
{"id": "1fu3ahaaso151801", "rating": 5.0, "text": "Working with and for the City of Ottawa was great! I really enjoyed it, people are amazing. But unfortunately training proctors are picky on who they feel should stay or go. It is what it is. I do hope to get involved with another department at some point. ", "pros": "Pension, pay, benefits, people, union, uniforms, paid lunches and breaks.", "cons": "Driving proctor(s) need to be reviewed", "date_created": "March 13, 2022"},
{"id": "1fsmi0coms9vr802", "rating": 5.0, "text": "Pros: Service industry. All serves the best interest of customers. Work life balance. Friendly working environment. Respectful workplace culture. Cons: not much", "pros": null, "cons": null, "date_created": "February 24, 2022"},
{"id": "1frsfu42gsa2l801", "rating": 5.0, "text": "It was a good place to work. Nice place to work . There’s a position for almost everyone.  The job Management is great for support, and answering questions. ", "pros": "Calm environment", "cons": "Inconsistent policy practice at times", "date_created": "February 14, 2022"},
{"id": "1fqu1vakl3h7l000", "rating": 3.0, "text": "The job will hook you with a decent salary, job security and great benefits but I doesn't take long to realize you're selling your soul for management that considers you very replaceable. ", "pros": "Salary and benefits/pension.", "cons": "Your well-being, need for a lunch, burnout are all non-conserns for your management. You are just a number.", "date_created": "February 2, 2022"},
{"id": "1fqhr4ol83h95000", "rating": 5.0, "text": "None…8 it’s a great place to work. I have nothing negative to say. It’s sometimes repetitive and not fast paced. But it could also be very busy and fun. ", "pros": "None", "cons": "None", "date_created": "January 28, 2022"},
{"id": "1fpul7fpm3h98000", "rating": 5.0, "text": "Because of the great pay, it is very difficult to get hours.  Especially since covid, there isnt as many swimming lessons to teach, which is where all the new staff usually start.", "pros": "Increasing pay with seniority.", "cons": null, "date_created": "January 21, 2022"},
{"id": "1fptp1b48t4qs801", "rating": 3.0, "text": "working long hours with very repetitive cleaning protocols which are pleasant with music, very boring but also I had worked in the slopes of the covid pandemic", "pros": null, "cons": null, "date_created": "January 21, 2022"},
{"id": "1fo1rrslvt63j800", "rating": 1.0, "text": "Bureaucratic nightmare No critical thoughtKnow everything,accomplish nothing and feel great about your delusional careerSycophants and sociopaths climb ladder only ", "pros": "Pay", "cons": "Everything else", "date_created": "December 28, 2021"},
{"id": "1fng74ddrt63j802", "rating": 3.0, "text": "Working for the city has it's security but there are too many employee reviews and checkups. You can truly settle in and do your job without watchful eyes on you", "pros": null, "cons": null, "date_created": "December 21, 2021"},
{"id": "1fn1r809qt4qd800", "rating": 5.0, "text": "Good job, great people easy going atmosphere. Hours are good as well with overtime if desired.  Hard place to get in, but once your foot is in the door that’s half the battle to full time ", "pros": null, "cons": null, "date_created": "December 16, 2021"},
{"id": "1fivlou6st4nd800", "rating": 5.0, "text": "I got this job through a Temp AgencyI knew I wasn’t going to stayThe hours were good until unforeseen circumstances happenedBe careful who you work with!", "pros": "Good pay", "cons": "Lazy drivers", "date_created": "October 26, 2021"},
{"id": "1f5ip4b02sa39800", "rating": 3.0, "text": "ZERO support from managers or supervisors. You're left to fend for yourself. All management will push you to do unsafe practices and work beyond LEGAL Hours of Service. IF they are talking to you at all, the supervisors like to talk down to everyone all the time. DO NOT WORK HERE!!!", "pros": "Pay check", "cons": "Management", "date_created": "May 13, 2021"},
{"id": "1f553si3jsaai800", "rating": 5.0, "text": "The work environment is very neat and the staff are very close with common goal. There’s always appraisals for staff which brings out the best in an employee. It’s a good work environment.", "pros": "Good pay, good everything.", "cons": "Probation period too long.", "date_created": "May 7, 2021"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1f3q7plq6s7ju800", "rating": 5.0, "text": "Great place to work. Flexible with hours on some job roles. Easy recruiting process. You get to move around different work sites depending on the role", "pros": null, "cons": null, "date_created": "April 21, 2021"},
{"id": "1f3lr0bsh3guf000", "rating": 5.0, "text": "Last year I began working for Ottawa Public Health and I never want to go elsewhere. I feel valued, appreciated and supported by the leadership team not only as an employee, but also as an individual. If I have any concerns, they are quick to address them and will always make it a priority. The management team will come to their employees when making a processes change as they understand we are on the frontlines. For the first time, I really enjoy going to work.", "pros": "Salary, support, advancement", "cons": null, "date_created": "April 19, 2021"},
{"id": "1en1k9fogu3d8800", "rating": 5.0, "text": "Directly working with clients. I learned a lot within short periods of time. Excellent team environment. The supervisors are always for you and listen to you. And help you to grow.", "pros": null, "cons": null, "date_created": "November 13, 2020"},
{"id": "1emnm09q1sa3l800", "rating": 3.0, "text": "OC Transpo job. The pay and benefits are lower than some private sector jobs. You will be working weekends or nights for atleast 15 years. Atmosphere is toxic.Management only care about meeting numbers regardless of anything else. Some Foreman have pet employees and others who don't fall in line get the short end of the stick ", "pros": "Security, pension", "cons": "Shift work, atmosphere", "date_created": "November 9, 2020"},
{"id": "1ejpd05rbnpdo800", "rating": 3.0, "text": "The only thing I didn’t like it was not paying well .As full time student  and working as a csr,it fit my schedule and and secondly not giving enough hours.", "pros": null, "cons": null, "date_created": "October 4, 2020"},
{"id": "1ej8l7hliree1800", "rating": 4.0, "text": "I was very grateful for the Dance Instructor (Advanced Arts) position that the City of Ottawa gave to me! I found the the management very fair and even when I couldn't teach due to another FT job they still kept me on the list for future opportunities! I also found it very easy to get other teaching contracts around the city once I was in the system. A great stepping stone for any dance/arts teacher who is starting out!", "pros": "Flexible work schedules", "cons": "Limited teaching hours", "date_created": "September 27, 2020"},
{"id": "1ehtapu9ar6jn800", "rating": 5.0, "text": "Very satisfy with this place of work. Great rewards, great satisfactions. Always happy to go to work and feel that I'm making difference caring for residence", "pros": "Great pay", "cons": "Hard work all shift", "date_created": "September 10, 2020"},
{"id": "1ehgal6s7q41q800", "rating": 4.0, "text": "Nice place to work at. Enjoyed working with colleagues that I’ve know from our community. Great insight since we live directly in the area we are working in.", "pros": null, "cons": null, "date_created": "September 5, 2020"},
{"id": "1egodqm59bfjv800", "rating": 1.0, "text": "I have work 11 years at the City. Since the pandinmic I now am not granteeed to get my hours back when I am back to work. I have had several supervoirs since my supervisor retired, that has been very challenging. Last if you are a partimer at the City no matter how hard you work you are not noticed.", "pros": null, "cons": null, "date_created": "August 27, 2020"},
{"id": "1eejdajdkrg7o801", "rating": 1.0, "text": "Very good salary, but not worth the time efforts or work environment. No wonder they pay us so well, otherwise nobody would do all this work. A few of my bosses were very unprofessional and inappropriate towards me on multiple occasions. I will not be applying in that department ever again.", "pros": "Good pay", "cons": "Unpleasant job, work environment and hours", "date_created": "July 31, 2020"},
{"id": "1edi9rbdu1e3h000", "rating": 1.0, "text": "The City of Ottawa likes to think it is progressive and fair. It is neither. Anyone who considers themselves to be reasonably competent in their field should look elsewhere. Otherwise, make sure you have a plan B at the ready should you choose to work here. Mediocre benefits. You are just a number. Bad mangers never held accountable. Feels like working in a sweatshop. Very toxic. Stay away ....", "pros": "Its a job, you get paid.", "cons": "Almost everything. Terrible experience. Do not recommend.", "date_created": "July 18, 2020"},
{"id": "1edcf7etprgf5800", "rating": 5.0, "text": "Great experience and great lifeguards  had an amazing time doing volunteer work  they were funny and great teachers to me they would explain to me their experiences so that I could learn", "pros": null, "cons": null, "date_created": "July 16, 2020"},
{"id": "1ec40pkm0oiut800", "rating": 5.0, "text": "I really enjoyed working with the City, they made me feel welcomed and made sure that I fit in  it was a positive experience that made me appreciate the outdoor parks in the community", "pros": null, "cons": null, "date_created": "June 30, 2020"},
{"id": "1eb563l5hqvju800", "rating": 4.0, "text": "I had a great experience working for the city of ottawa. There is room to grow as well, if you work hard and are responsible you can be a headguard. The pay is better than most other pool as well.", "pros": null, "cons": null, "date_created": "June 18, 2020"},
{"id": "1eb2kidvengdq800", "rating": 5.0, "text": "I had been here for awhile and working with the city is one of the best thing I did as a young teenager. this is a job I suggest It to people to chase and try to get.", "pros": null, "cons": null, "date_created": "June 17, 2020"},
{"id": "1eaqq31quqboh800", "rating": 4.0, "text": "working for the city of Ottawa has been a very positive experience and the opportunity to advance is up to how hard you want to apply yourself but the ceiling is very high for advancement.", "pros": "flexible shifts", "cons": "expected to work various shifts at any time", "date_created": "June 14, 2020"},
{"id": "1e9tjbd6qqvdk800", "rating": 3.0, "text": "My time with the city was okay. Could have been better, but due to some inherent issues with internal politics, the inter-office battles were stressful and disturbing. I left under some terrible circumstances which I would never have wished on anyone. Sadly, it tainted the experience given whom I worked for and with were absolutely excellent people.", "pros": "good people", "cons": "some bad apples", "date_created": "June 3, 2020"},
{"id": "1e9qvfmtdqup3800", "rating": 5.0, "text": "as a camp counsellor I was able to create a day to day activity list to help keep my kids happy and active. Enjoyed the freedom to create a plan and execute the plan without any confrontation.", "pros": null, "cons": null, "date_created": "June 2, 2020"},
{"id": "1e9757goj4t6r802", "rating": 4.0, "text": "Working for the City of Ottawa gives you the chance to meet amazing people that share the same goals and ideas as yourself. It is a giant team and we all work well together", "pros": null, "cons": null, "date_created": "May 25, 2020"},
{"id": "1e8b4im98oae4800", "rating": 1.0, "text": "Job descriptions are written so really only those already in the positions acting could achieve the positions.\r Management is clueless as to yhe behaviours of its staff and they allow toxic cultures to breed and encourage it.\r Dont be fooled i have worked here 15 plus years,trust me discrimination,  backstabbing,  bullying,  lack of respect is rampant", "pros": null, "cons": null, "date_created": "May 14, 2020"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1e7o37tmb25ju000", "rating": 5.0, "text": "management is always extremely accommodating to staff. Great colleagues to work with in a team environment that is physically demanding at times. typical day at work is relaxed as duties are spread out effectively", "pros": null, "cons": null, "date_created": "May 7, 2020"},
{"id": "1e7hhlqd5oaq2800", "rating": 5.0, "text": "Interview was mostly on technicality and how we performed in real time.  Given scenario that would I be able to solve.  Interview was with team of three people.", "pros": null, "cons": null, "date_created": "May 4, 2020"},
{"id": "1e7664784nomr800", "rating": 5.0, "text": "Working at City of Ottawa was a fun work of space where I had the opportunity to learn with the help of other great coworkers who were willing to sacrifice their time for me. Every day i would arrive and work on the computer in the cubicle they had for me. I learned how to format documents and present in front of others. The workplace was a really fun environment with people who were passionate about their jobs. The hardest part was probably presenting because its something I wasn't naturally able to do, and now I can present with no stress. And the most enjoyable part was the group I was working with. They were helpful and all very nice.", "pros": null, "cons": null, "date_created": "April 30, 2020"},
{"id": "1e6rp3dh8p0je800", "rating": 4.0, "text": "Great workplace culture, very easy to make life-long friends while promoting water safety and physical health. Very organized staff and training procedures. \rMany opportunities to stay active and learn.\rGreat atmosphere and wonderful experience if you like working with children and working in aquatics.", "pros": null, "cons": null, "date_created": "April 26, 2020"},
{"id": "1e5gktmc3hbri803", "rating": 5.0, "text": "Je n'ai rien à dire que d'encourager tout le monde à appliquer. Je suis très satisfait à date.", "pros": null, "cons": null, "date_created": "April 9, 2020"},
{"id": "1e5e1tah60gt9003", "rating": 4.0, "text": "This was volunteer work for me so I can't speak to the pay and benefits portion but from what I can tell from the people that were employed, it seemed pretty good. Management was great, loved the atmosphere. I enjoyed teaching the kids and being a camp counselor.", "pros": null, "cons": null, "date_created": "April 8, 2020"},
{"id": "1e51m3iaboaoj802", "rating": 1.0, "text": "If you ever worked for the City of Ottawa you will appreciate your new job!! Constant turnover of staff. You might want to consider another employer!!!", "pros": null, "cons": null, "date_created": "April 3, 2020"},
{"id": "1e4gpbust4s2f802", "rating": 5.0, "text": "I have worked with the city for a few summers. It was a non stressful environment and a good work/familly balance. The pay was good. I had to use my vehicle a lot so they paied for millage too.", "pros": null, "cons": null, "date_created": "March 28, 2020"},
{"id": "1e3l0pmutq3ia800", "rating": 5.0, "text": "I enjoyed my job, my head guard was very nice, and they made sure we also felt secure and like we had backup while teaching. The job was very enjoyable and fun.", "pros": null, "cons": null, "date_created": "March 17, 2020"},
{"id": "1e358j8r4oaba803", "rating": 5.0, "text": "The work environment is very relaxed and fun. The people are always great and kind. This is a job for people who like children and can tolerate them for a long period of time.", "pros": null, "cons": null, "date_created": "March 11, 2020"},
{"id": "1e2mr9f8jo9r3802", "rating": 5.0, "text": "Working with the City of Ottawa has been great and I've learned a lot. The staff and clients were friendly and it has been a great work experience in my career.", "pros": null, "cons": null, "date_created": "March 5, 2020"},
{"id": "1e26qj2s4hae2802", "rating": 4.0, "text": "I loved working for the city. The managers were kind and compassionate. I loved teaching the kids, answering the phone and being on deck. I love swimming myself, so I enjoyed being by the pool side.", "pros": null, "cons": null, "date_created": "February 28, 2020"},
{"id": "1e21o5a23q2ud803", "rating": 5.0, "text": "Enjoyable place to work if you don't mind cold weather. manage this people on the ice with little supervision the most enjoyable part was being able to play hockey while working.", "pros": null, "cons": null, "date_created": "February 26, 2020"},
{"id": "1e1udbln94t8m801", "rating": 4.0, "text": "The City of Ottawa provides a safe work environment with much training and opportunity to offer feedback to management. This job encourages individuals to increase the amount of certifications they hold and encourages leadership training.", "pros": null, "cons": null, "date_created": "February 25, 2020"},
{"id": "1e1ilp43mo90u802", "rating": 4.0, "text": "Job offer is base on seniority.  You  need another job to supplement your income.  Co-workers are respectful.  Always gave a big smile.  They are warm and helpful.", "pros": "High Pay", "cons": "Seniority", "date_created": "February 20, 2020"},
{"id": "1e1ft8n4jo9p6802", "rating": 4.0, "text": "Overall a great place to work.  The pay is great, the people can be great, the hours are available depending on where you work and once you're hired as a City of Ottawa worker, the opportunities to laterally transfer to different departments is plentiful.", "pros": "Great pay", "cons": "Slow paced", "date_created": "February 19, 2020"},
{"id": "1e0og6oal2v48003", "rating": 4.0, "text": "Great opportunities to do different types of work.  Large organization with good training.  General desire to make life better for the people of the city.  Great work/life balance.", "pros": null, "cons": null, "date_created": "February 10, 2020"},
{"id": "1e0g342feh6ls802", "rating": 5.0, "text": "The city of Ottawa team is a very collaborative workplace that caters to a supportive workplace that help to build skills for the staff and help them to succeed.", "pros": null, "cons": null, "date_created": "February 7, 2020"},
{"id": "1e0bpdvcpq5ia804", "rating": 4.0, "text": "I worked with an excellent group of human beings who were action oriented, positive and took the time to help the younger staff grow. My position started as a summer student job and I was able to stay on in the fall as a full time employee.", "pros": null, "cons": null, "date_created": "February 5, 2020"},
{"id": "1dvoupp4tbmlf801", "rating": 4.0, "text": "I worked in the lab . Was in general very busy. I was the laboratory sample technician . Sometimes more than one client came so I had to help everybody and in the same time being pleasant. \rI found the job interesting because was challenging. I will recommend\rthe job to somebody how likes to work.", "pros": null, "cons": null, "date_created": "January 29, 2020"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1dujffdl23429001", "rating": 3.0, "text": "I was a very unorganized place, where full-time employees would take advantage of summer students and make then do all the dirty work. The job wasn't very rewarding.", "pros": null, "cons": null, "date_created": "January 14, 2020"},
{"id": "1du82olpjnouj803", "rating": 4.0, "text": "Good place to work. balance work- life experience\rGood potential to achieve your goals. Nice people to work with...\rGood working environment \rI am happy to be EE there", "pros": null, "cons": null, "date_created": "January 10, 2020"},
{"id": "1du3784tq4rln803", "rating": 5.0, "text": "City of Ottawa is always well managed and salary is always amazing. I highly recommend this job. You will make lifetime friends and enjoy going to work everyday.", "pros": null, "cons": null, "date_created": "January 8, 2020"},
{"id": "1dttnsvnco9u6803", "rating": 4.0, "text": "Although the City Of Ottawa is an amazing company to work with to get guaranteed hours and access to on-site benefits, the management leaves something to be desired as they do not act with their employee's best interest at heart.", "pros": null, "cons": null, "date_created": "January 6, 2020"},
{"id": "1dsgmuhvdq4ms808", "rating": 5.0, "text": "It was a good experience, meeting new people everyday. I made a lot of friends the good thing was it’s an outdoor pool which is great and I could ask for a better summer than that.", "pros": null, "cons": null, "date_created": "December 19, 2019"},
{"id": "1drp5fo9h0kbq003", "rating": 4.0, "text": "Hardest part is the working outdoors in winter.  Staff are wonderful and supportive.  Pay for the position is fair and reasonable but not full time or permanent", "pros": null, "cons": null, "date_created": "December 10, 2019"},
{"id": "1dpt5np5q5n9i802", "rating": 4.0, "text": "This was a very demanding position that brought on it's own issues.  As a Councillor's Assistant job security is not great and it is difficult to move to a position within the city because you are not a unionized employee.", "pros": null, "cons": null, "date_created": "November 17, 2019"},
{"id": "1dpb3rt5e5n93802", "rating": 4.0, "text": "Working frontline has many challenges. You are regularly interacting with families in crisis and must deal the with issues they have in a professional manner.  There are physical components to the job, moving and lifting as well as time on your feet.  Administratively there are Log Books, Narratives and Incident reports to complete as needed. It is also shift work.", "pros": null, "cons": null, "date_created": "November 10, 2019"},
{"id": "1dol62v0u52t0802", "rating": 5.0, "text": "Management was very experienced and very supportive. They stood behind their employees 100%. Opportunities to gain new certifications/qualifications were ample, team building on a regular basis. Loved the job.", "pros": null, "cons": null, "date_created": "November 1, 2019"},
{"id": "1dnm104rj52vu802", "rating": 5.0, "text": "Volunteering for the city of Ottawa was very beneficial in allowing me to contribute to the community. I learned skills in being responsible and taking initiative during my time there.", "pros": null, "cons": null, "date_created": "October 20, 2019"},
{"id": "1dmmje3i65neb805", "rating": 4.0, "text": "A typical day required mandatory cleanliness of the park and the inside of the pool. I learned relationships and boundaries; understanding and accommodating to the needs of the patrons and of my job requirements as well as myself. The job teaches you a lot about people and yourself and is a good experience for teens who need a first time job. The security of the job is also a good thing because it takes the stress away from having to find a new job every year. The people you work with as well, help you build relationships and partnerships through and with people in the City of Ottawa.", "pros": null, "cons": null, "date_created": "October 8, 2019"},
{"id": "1dlhq5spp5ncm800", "rating": 5.0, "text": "I worked many different jobs with the City, but I can honestly say, it was always fun coming into work. Even if you knew no one on your shift, everyone was friendly and my management team was always so accommodating, friendly and understanding.", "pros": null, "cons": null, "date_created": "September 24, 2019"},
{"id": "1dlg076d024et003", "rating": 5.0, "text": "Worked alongside a great team \r Duties included:\rSupervising children from grades 1-6 in after school program \rLead sports and art activities\rResponsible for the organization of materials and clean up \rLiaise with parents at pick up\r Friendly environment for kids and staff members", "pros": null, "cons": null, "date_created": "September 23, 2019"},
{"id": "1dkvlef7h0mth002", "rating": 4.0, "text": "The city of ottawas transit sector is a great place to work, flexible hours and great pay as well as benifits! However with the new changes introducing the LRT, they are laying off hundreds of operators that could be of more benifit to the company then the ones who are soon to be retiring.", "pros": null, "cons": null, "date_created": "September 17, 2019"},
{"id": "1dktu9v5h0kbh000", "rating": 5.0, "text": "can be a fun company to work for if you're a makeup lover. Pay is a little bit higher than its competitors in the Makeup Retail Industry and there's always an opportunity to network and meet different people. As permanent artist both part time and full time, you get gifts and perks --lots of free makeup (gratis) from the company, as well as a %60 discount on product purchase. Keep in mind that perks ar", "pros": "baaare waste mon", "cons": "too manny kittys", "date_created": "September 16, 2019"},
{"id": "1dkeio89p5nfn800", "rating": 4.0, "text": "Great team. Very welcoming and productive. Learned how to be more open with the public, be more organized by filing documents and placing them in the right folder. I also got to work with the childcare department and was able to key-in many applications.", "pros": "Great atmosphere", "cons": "None", "date_created": "September 10, 2019"},
{"id": "1djrsn3pa52so803", "rating": 3.0, "text": "Worked at the City of Ottawa for approximately 30 years and as such there were good times and bad. Over the years I held various positions including ward clerk and equipment trainer, the latter of which I enjoyed greatly.", "pros": null, "cons": null, "date_created": "September 3, 2019"},
{"id": "1djmgrjfn24f0002", "rating": 3.0, "text": "One senior colleague put it as the \"golden handcuffs\".  If you are in operations, it is a reasonable steady pace employment with good work life balance.  If you are in any management support role, it's a place of dead space, frustratingly ineffective.  There is still a lot of 50's style management dinosaurs around in some departments and career advancement rely highly on who you know and not so much on ability.  Job competitions are a sham, the successful candidate are often predetermined, the interviews are just going through the motions to legitimize the award.", "pros": "Steady hours.", "cons": "Accomplish very little.", "date_created": "September 1, 2019"},
{"id": "1dj79a05q0mte000", "rating": 4.0, "text": "good\r                                             work hours \r                                 salary", "pros": null, "cons": null, "date_created": "August 26, 2019"},
{"id": "1dj77bn3q52tn804", "rating": 5.0, "text": "A very good work life balance and truly professional colleagues. Friendly environment and ready to help when people are at need. Will work again if given a chance.", "pros": null, "cons": null, "date_created": "August 26, 2019"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1di17jhpq5nba802", "rating": 5.0, "text": "The city of Ottawa is a great job to work at. The people are amazing and easy to talk and confide in. They are always there to help whenever its needed. They offer a wide variety of training which is all paid for.", "pros": null, "cons": null, "date_created": "August 11, 2019"},
{"id": "1dendfaev5nek800", "rating": 2.0, "text": "The City of Ottawa has many perks and overall is a great employer.  However, the officer culture was quite toxic and I was ostracized by management.  As a temp employee you have zero job security despite paying union dues, and it can take 2 years to get permanency.  Before that time you can be terminated for any and no reason with no grievance process, again paying union dues. \r Training was awful and incredibly short, however, my manager gave no leeway in terms of mistakes.  My manager targeted me and my employment was doomed.  Terrible experience that has left me considering moving from Ottawa so i dont have to contribute to the City. \r Phone aspect of the job was awful and involved being a human punching bag for the City's inflexible and expensive policies.", "pros": "overtime, good salary, nice perks (compressed work day, 1.5 hours break)", "cons": "awful managers, awful training, little job security until you are permanent", "date_created": "July 1, 2019"},
{"id": "1dbgkkf5g0mcn000", "rating": 4.0, "text": "I thoroughly enjoy working for the City of Ottawa. However, there are some considerations:\r- It's a safe job, therefore many employees are incredibly lazy\r- Management must trudge through a mountain of red tape to change anything.\r- Don't have hopes of changing much or being appropriately recognized for going the extra mile.\r With the union, the City does take care of its employees:\r- Great counselling resources\r- Adequate (sometimes slow-to-respond) compensation.\r- Benefits\r- Seniority system that rewards tenure and experience\r- Protected and limited liability.\r It takes a special personality type to enjoy a long-term career with the City. If you are ambitious and want a competitive career, look to the private sector. However, if you want a clear-cut, safe, protected, and transparent job, the City is perfect for you.", "pros": "Compensation, Resources, Benefits, Time off", "cons": "Lazy staff, Red Tape, Cheap, Slow, Socially agonizaing", "date_created": "May 22, 2019"},
{"id": "1dafkqh2j5ndi800", "rating": 4.0, "text": "Solid organization to work for. Can be long wait to earn permanent positions but all in all the benefits, vacation and people are all pretty easy going. Would recommend working for this organization.", "pros": null, "cons": null, "date_created": "May 9, 2019"},
{"id": "1daetrtvg52t3800", "rating": 3.0, "text": "The  job is a good job. I prefer a position where I use my head more as opposed to just a daily routine. Although there are days where a great deal of problem solving is required. Te salary is good as well as the benifits.", "pros": null, "cons": null, "date_created": "May 9, 2019"},
{"id": "1dac87uqb5n95800", "rating": 5.0, "text": "Good training with the city to learn the ins and outs of working with the public. Very easy going and works hard to help you in difficult situations. Wonderful experience overall.", "pros": null, "cons": null, "date_created": "May 8, 2019"},
{"id": "1d9lb989pb85g800", "rating": 5.0, "text": "-Great part-time job\r-Possibility of training and moving up\r-Flexible hours\r-Fun environment\r-Ability to use the facility to workout, swim for free", "pros": "Great salary, free access to the pool and gym", "cons": null, "date_created": "April 29, 2019"},
{"id": "1d9b3kosp52sl800", "rating": 2.0, "text": "-Very punctual \r-Learned to effectively handle any customer service concerns \r-Experienced in teaching all levels and ages \r-Acquired an understanding for class discipline\r-Assisted in a successfully handled major  \r-Organizing pool ran camps as well as camp counselling\r Did not enjoy the pool environment", "pros": null, "cons": "Very poor hours", "date_created": "April 25, 2019"},
{"id": "1d9386e7s0kbn000", "rating": 5.0, "text": "The people, the management, the flexible/set hours. everything about working for the city is so much fun. Everyone was so nice and enthusiastic about their jobs.", "pros": null, "cons": null, "date_created": "April 22, 2019"},
{"id": "1d7fll8pi5j51800", "rating": 5.0, "text": "I got to work with great people, although some locations may be different atmospheres. Pay was good until the minimum wage went up. I got to learn how road infrastructure works and how hard city workers work. They provide all the training, and most of it can carry over to other job opportunities.", "pros": null, "cons": null, "date_created": "April 2, 2019"},
{"id": "1d6tkoi3p52su800", "rating": 5.0, "text": "Workplace culture was always friendly and acceptable. I was given lots of responsibility and always felt as though I was trusted. The most enjoyable part of the job was working with children", "pros": null, "cons": null, "date_created": "March 26, 2019"},
{"id": "1d6s12l5e5j4r800", "rating": 5.0, "text": "Enjoyable work experience, with many opportunities to learn through on the job training, various committee meetings and networking. \r Great place to learn about municipal government.\r  .", "pros": "On-site gym", "cons": null, "date_created": "March 25, 2019"},
{"id": "1d69bkurl5n8u800", "rating": 4.0, "text": "Great for a high school job or to get through university but hours are limited and there is no minimum shift length so you can be asked to come in for one hour which sucks. Pay is also not very good since minimum wage went up and the city did not increase wages at all.", "pros": null, "cons": null, "date_created": "March 18, 2019"},
{"id": "1d58k9uc30mtr000", "rating": 4.0, "text": "I enjoyed working this job as it was flexible enough to work around my full time job. I got to enjoy times with young children and be active! I would be careful though if you get told verbally that you could have a job the following year as I had that happen then just recently they said that the full-time position was most likely not going to be open.", "pros": null, "cons": null, "date_created": "March 5, 2019"},
{"id": "1d55nm4450kbq000", "rating": 4.0, "text": "Since there is so many business lines, there is lots of opportunities at the City of Ottawa.  From administration, finance, HR, IT, health, engineering, skills trades, etc. etc.", "pros": null, "cons": null, "date_created": "March 4, 2019"},
{"id": "1d528oatq0kbi000", "rating": 5.0, "text": "I was working with the City of Ottawa in Infrastructure group as a Summer Student. I worked on many various projects, including Innes Road Widening. Staff, and Experience was excellent!", "pros": "great group", "cons": "long days", "date_created": "March 3, 2019"},
{"id": "1d4rtk4sa0mt2000", "rating": 5.0, "text": "Good part time job for students because of the flexible hours that can accommodate for a busy student schedule. Minimum wage job but it usually isn't that busy (depending on your complex)", "pros": "30 min break, great coworkers, great management, lots of shifts available", "cons": "long hours (5-7 hour shifts)", "date_created": "March 1, 2019"},
{"id": "1d4ihjg0f5n90801", "rating": 3.0, "text": "No work day is typical - while there are regularities, there is always a new experience to be had. It's never boring, there are always tasks to be performed and patrons/clients to get to know. \r Apart from it being the perfect student job due to the flexible hours, there is the fact that part-time staff aren't allowed to work enough hours (up to 24). In the current economy, this isn't sustainable.", "pros": "Flexible work hours, paid recertifications, fun and exciting work environment", "cons": "Not enough work hours, current wages don't match qualification requirements", "date_created": "February 25, 2019"},
{"id": "1d34em3eg1d0t000", "rating": 4.0, "text": "It was a great place to work and i really enjoyed myself, however I was looking for something with more hours. During my time with the city I worked as a program leader and coordinator for multiple programs.", "pros": "people were nice", "cons": "not enough hours", "date_created": "February 7, 2019"},
{"id": "1d322lqbd0mt7000", "rating": 4.0, "text": "Strong stepping stone for students in an area with lots of different opportunities to present. The diversity in jobs makes it a truly flexible working environment.", "pros": null, "cons": null, "date_created": "February 6, 2019"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1d1otta9m5ncj800", "rating": 5.0, "text": "I enjoyed working here and had the opportunity to get a hands on experience. I am happy that I had a chance to work here and it opened my view toward a lot of new things.", "pros": null, "cons": null, "date_created": "January 21, 2019"},
{"id": "1d1m9ph9s52t5800", "rating": 5.0, "text": "City of Ottawa job is amazing place to work for.  They have excellence life balance, salary with benefits.  It is very respectful environment that whenever you have problem, they looking to help you out.", "pros": null, "cons": null, "date_created": "January 20, 2019"},
{"id": "1d17f54fg0mto000", "rating": 4.0, "text": "Awesome crew to work with, never a dull moment and always busy. Going around fixing up the city you live in is always nice to get paid to do and people are friendly.", "pros": null, "cons": null, "date_created": "January 14, 2019"},
{"id": "1d0q966ji52sv800", "rating": 4.0, "text": "Your daily routine with any job city of Ottawa job is to turn up at your shift and do the work that has been assigned to you by your supervisor. The staff are generally understanding when you have questions about the work or training and will guide you down the path of most success. From my experience there have been a few miscommunications between the office and employees in my position, other than that it is an amazing place to work!", "pros": null, "cons": null, "date_created": "January 9, 2019"},
{"id": "1d0nk7fa60kbv000", "rating": 3.0, "text": "I was really looking forward to working for the city of ottawa until I started working there. I was a special needs support worker and I barley got any support from the others staff. There was time where I went the whole day without eating because I had to helped my kids eat because they were unable to do so which is fine that is my job but it would have been nice if i was offered asome help so I could eat my food as well", "pros": null, "cons": null, "date_created": "January 8, 2019"},
{"id": "1d089o0871d1f000", "rating": 4.0, "text": "As a Building Inspector you would start your day at 7am\rTake all of of daily calls and proceed to book your day in order to \rstar the process of going to each location for the purpose of make sure that the work that was being inspected by you meet the Ontario Building Code. \r You learn how to work along , prepare reports etc..\r The management will not have your back on several occasion\r The work place culture is changing very fast due to the new technologies coming out each year \r Make sure that your on site decision with not be disputed by management\r The most enjoyable part of the job, is to see someone happy that you have made a on site decision", "pros": "Hours of works", "cons": "Management refusing to change with the times", "date_created": "January 2, 2019"},
{"id": "1d04tjmct0mcv000", "rating": 4.0, "text": "Not enough training provided when asked for.\rDepending on management, career growth is either blocked or supported.\rThe City offers such broad services that it allows you to jump around departments and learn new things about the City.", "pros": null, "cons": null, "date_created": "January 1, 2019"},
{"id": "1cv7heudi1ahe000", "rating": 3.0, "text": "It's a wonderful place to work if you're looking to stay in a position for a long time. I have been able to work at several locations doing various jobs which is great experience.", "pros": null, "cons": "no lunch breaks", "date_created": "December 20, 2018"},
{"id": "1ctdmp9gm5j7e800", "rating": 5.0, "text": "Management was amazing and everyone was very welcoming and helpful when it came to my job perfomance. I really enojyed working with the kids and running activities with the other staff.", "pros": null, "cons": null, "date_created": "November 28, 2018"},
{"id": "1csp5erjnb83u800", "rating": 5.0, "text": "Lifeguard/ Swim instructor\rGood pay\rGood training\rBenefits\rSafe and fun environment\rLots of work and credentials required\rOverall good job to have as a student", "pros": null, "cons": null, "date_created": "November 20, 2018"},
{"id": "1cs9gu74r5nbf800", "rating": 5.0, "text": "This place is really a great place to work. The benefits are pretty good. Management is ok. However I find it not progressive at all. They rely mostly on consultants so less opportunities for full time employees to get quality work. Politics is all over the place like any other public sector organization which sometimes kills the merit.", "pros": "Excellent benefits", "cons": "Future growth is not guaranteed", "date_created": "November 14, 2018"},
{"id": "1cq694r4l5nee800", "rating": 5.0, "text": "Everything is well managed and organized. Everyone is always willing to lend a helping hand and you make close ties with the clients, as well as your coworkers.", "pros": null, "cons": null, "date_created": "October 19, 2018"},
{"id": "1cq41v9205nae800", "rating": 3.0, "text": "I am not typical, I look to strive and better myself on a daily basis.  With so many employees and so little opportunity of moving forward my future looked unsatisfied.", "pros": "Great pay", "cons": "Not efficient, split shifts", "date_created": "October 18, 2018"},
{"id": "1cpkci4m35j64800", "rating": 5.0, "text": "Working with the City of Ottawa has been a great experience for me. While exploring multiple different aspect of my area of interest, I acquired a lot of experience working with multiple diverse groups. I would love to get more involved in the area as well.", "pros": null, "cons": null, "date_created": "October 12, 2018"},
{"id": "1cn301e5952tff7a", "rating": 5.0, "text": "little shifts, its more of a seasonal kind of job.. shifts are not always available. The working environment can sometimes be harsh because we hand out flyers during winter for 2 hours before we get a break. Funny enough that's when the job's availability is more", "pros": null, "cons": null, "date_created": "September 10, 2018"},
{"id": "1cmhiokco5nd7848", "rating": 4.0, "text": "A good day at work 40 hrs a week \ralways good people to work for \rGood envoriment to work \rThe management are good employees\rThe 40 hrs a week is a good thing \rEverybody gets along", "pros": "Free Lunch", "cons": "Week end overtime", "date_created": "September 4, 2018"},
{"id": "1cli1jd0dak8rarv", "rating": 4.0, "text": "A typical shift at work consisted of teaching my student. It was a great experience that helps me develop my sense of leadership and determination. The workplace was in a nice environment", "pros": null, "cons": null, "date_created": "August 22, 2018"},
{"id": "1cjlnlu955j54823", "rating": 3.0, "text": "The city of Ottawa offers a great work life balance, they have very supportive managers and wish want their employees to succeed. There are often many jobs available.", "pros": null, "cons": null, "date_created": "July 30, 2018"},
{"id": "1cj20vd8v52t1fnh", "rating": 3.0, "text": "Depending on what department you work in, things will be different. In the receivables/collections part it was a mostly older women who are generally 'catty' for the most part. Much fun.", "pros": "Plenty of breaks", "cons": "Strange atmosphere", "date_created": "July 22, 2018"},
{"id": "1cirqs23m5j4vblo", "rating": 5.0, "text": "Unionized, fairly and clearly compensated, clear responsibility RE: replacing shifts and picking up shifts, fun environment, ample training leading up to hiring, good team dynamic (if sometimes a little cliquey - this is a teen job, after all).", "pros": null, "cons": null, "date_created": "July 20, 2018"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1ci5uh0tn5ncpff5", "rating": 4.0, "text": "Really good job for students. Get an immersive experience into laboratories world + getting a valuable network. Only available to University student within the field.", "pros": null, "cons": null, "date_created": "July 11, 2018"},
{"id": "1ci548ko15n8o8ci", "rating": 5.0, "text": "Great training programs, and people with a great chance to produce into a career.\r I would recommend this to anyone who can get the chance. \r City of Ottawa", "pros": null, "cons": null, "date_created": "July 11, 2018"},
{"id": "1chcg8r4cb80ifi1", "rating": 5.0, "text": "great bunch of people to work with and to work for. work life balance is ideal and excellent retirement benefits including pension plan. modern IT work place", "pros": null, "cons": null, "date_created": "July 1, 2018"},
{"id": "1chb88hm60mtf219", "rating": 5.0, "text": "People are very friendly and the community is all connected allowing us to stay interactive with each other and help each other when a shift is needed.", "pros": "Making new friends", "cons": "Long Hours", "date_created": "July 1, 2018"},
{"id": "1cgfp0gkf0mtl75k", "rating": 4.0, "text": "As for maintenance helper, not a whole going on, fairly simple work and repetitive.\rFor HVAC, great learning opportunity, lots of variety of Equipment and work environment.", "pros": null, "cons": null, "date_created": "June 20, 2018"},
{"id": "1cgfc4h5k1ah22rg", "rating": 5.0, "text": "A typical day at work takes a level of focus that must be maintained as long as you are getting paid for.Its easy to do as long as you are used to it. Its fun working!", "pros": null, "cons": null, "date_created": "June 20, 2018"},
{"id": "1cg4mpgrp52skagd", "rating": 4.0, "text": "It can be a great place to work. Can be difficult at times to advance. Very stagnant culture. Slow paced and bureaucratic. Pay is great for the type of work being performed but can become very boring and mundane.", "pros": null, "cons": null, "date_created": "June 16, 2018"},
{"id": "1ceu0a70952t5bl0", "rating": 5.0, "text": "Being a camp instructor the most rewarding job that I have ever had. I love coming into work, it always puts a smile on my face. I always look forward to my next shift.", "pros": null, "cons": null, "date_created": "June 1, 2018"},
{"id": "1ceq3t8175n94bju", "rating": 4.0, "text": "At times I did not have anything to do and many of the tasks I was assigned were not very meaningful. I truly found out what a \"government job\" was. I took another co-op opportunity (I was a student at the time) and a 10 $/hr pay decrease to get out of there.", "pros": null, "cons": null, "date_created": "May 30, 2018"},
{"id": "1cechefb3b892bc7", "rating": 4.0, "text": "the City of Ottawa is a great place to begin you're working career. You gain valuable workplace knowledge and develop great relationships with co-workers. Overall, it's a very positive environment, and I would recommend working for the city.", "pros": null, "cons": null, "date_created": "May 25, 2018"},
{"id": "1cdli3v6s0mcr003", "rating": 5.0, "text": "Although there is a lot of standing around, it is the best part of the job. You almost feel as though you're not doing anything. I learn a lot from the In-Services. How to treat injuries, how to speak to certain groups of people. Management was great! I loved how they were all so young and easy to relate with. Diverse group of workers. Hardest part of the job was being in the heat in 30+ humidity under a tiny umbrella if you're lucky, but it was manageable. My favorite  part of the job was all the friendships I made after doing this job for 2 years. I loved working here.", "pros": null, "cons": null, "date_created": "May 16, 2018"},
{"id": "1cd8704fi0mtq129", "rating": 5.0, "text": "this job was a lot of fun as it was pretty much just make sure the ice is clean and safe then, you get to play hockey and get paid. overall very fun job.", "pros": null, "cons": null, "date_created": "May 11, 2018"},
{"id": "1cd5q5nuc0mtq5d4", "rating": 4.0, "text": "working for the City of Ottawa provides steady employment with some basic benefits. Internal Job postings allow for movement to other positions. The salary is low, even at the top end and there are only so many higher up positions.", "pros": null, "cons": null, "date_created": "May 10, 2018"},
{"id": "1cck02015b85fci0", "rating": 3.0, "text": "I worked programs with the city such as soccer,hockey and other activities. I was then offered a job at a pool. My first 3 months were good then my boss went crazy and started over demanding. I do not recommend working more than 2 shifts a week.", "pros": "Money", "cons": "Very tiring", "date_created": "May 3, 2018"},
{"id": "1ccj1qahd52t0b30", "rating": 4.0, "text": "This is a great job if you are a student as they are very flexible with hours. You can choose not to work set hours for several months and stay on the replacement staff list.  However, shifts are set for different sessions. This also gives you the opportunity to have different positions within the City of Ottawa.", "pros": "very flexible, great for students", "cons": "not enough hours, can't leave location on breaks", "date_created": "May 3, 2018"},
{"id": "1ccdrb3iob88meqv", "rating": 5.0, "text": "Work environment is pleasant and provides good opportunities for advancement. The work culture is very dynamic and collaboration between all departments is great.", "pros": "Great career opportunities", "cons": "Subject to Council decisions which may impact job security", "date_created": "May 1, 2018"},
{"id": "1ccbv8h465nd0cjb", "rating": 5.0, "text": "If you love working with children and have a fun and dynamic personality, this is the job for you! Work with kids of all ages and teach them various skills through play!", "pros": null, "cons": null, "date_created": "April 30, 2018"},
{"id": "1cc9g2p7j5n90djh", "rating": 4.0, "text": "The city of Ottawa was a great work environment to work in. Supervisors are friendly but firm and help ensure everything is going smoothly. Decent place to work.", "pros": null, "cons": null, "date_created": "April 29, 2018"},
{"id": "1cc97h17n5n908q2", "rating": 5.0, "text": "can either be quiet or busy with camps\ryou test and do chlorine on the regular\rusually, the people hired and nice and hard working\rincludes a lot of play time with the children", "pros": "working with children, outdoors", "cons": "bad weather results in shortage of hours", "date_created": "April 29, 2018"},
{"id": "1cbv3pkr35j4pcef", "rating": 5.0, "text": "Was one of my again favourite places to work great staff back in the day, sure had certain clicks but over all got along with everyone and had my on clicks as well. Lost touch with most of the people sometimes bump into a few but its been years I hope all is well with all of the staff from 2001 to 2003.", "pros": "n/a", "cons": "n/a", "date_created": "April 25, 2018"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1cbmsmi6f5n8q9dn", "rating": 4.0, "text": "Unionized work, hours based on seniority, subsidized training. Great framework for lifeguards looking to be in it for the long run. Excellent facilities and teams.", "pros": null, "cons": null, "date_created": "April 22, 2018"},
{"id": "1cbdsonhg5j4k9o2", "rating": 4.0, "text": "With tones of other staff to help you out with any difficulty, and the ability to request hours at your own choice. The city of Ottawa is a great place to work.", "pros": null, "cons": null, "date_created": "April 18, 2018"},
{"id": "1c9uomdv3akjt9b5", "rating": 3.0, "text": "Great Summer job, enjoyed the experience, great training, staff was good to work with.  Had contract extended into the fall and their recommendation helped get me a job with the Ottawa Humane Society over the winter!", "pros": null, "cons": null, "date_created": "March 31, 2018"},
{"id": "1c9afda800kbq55g", "rating": 5.0, "text": "Great place to work. Co-workers are friendly and very easy to work with. The most enjoyable part of the job is working with kids. I learned how to take control of some situations.", "pros": null, "cons": null, "date_created": "March 23, 2018"},
{"id": "1c8v2elr20kbi0j7", "rating": 2.0, "text": "Poor management leading to poor workplace culture.\rMale-centric management, self-obsessed.\rCatastrophically risk adverse.\rTechnology adverse - IT group won't allow for any customization nor use of any non-standard software.", "pros": "HR payroll always provided a correct paycheck - on-time.", "cons": "Non-unionized staff have short life spans, easily dismissed.", "date_created": "March 19, 2018"},
{"id": "1c8o7su3v0kbi29f", "rating": 1.0, "text": "Great pay and benefits. Terrible management. Helps if you know someone to get you in permanent, Not what you know its all about who you know. Great co workers", "pros": "pays well", "cons": "management is awful", "date_created": "March 16, 2018"},
{"id": "1c88fl8lnaqjgajc", "rating": 5.0, "text": "Always looked forward to coming into work and was always around fun people. Advancement was always available if wanted, co-workers showed the same work ethic.", "pros": "Fun", "cons": "Long hours", "date_created": "March 10, 2018"},
{"id": "1c81hsidk5nbkfd1", "rating": 3.0, "text": "As it is with the City of Ottawa, it makes it very hard to get fired or lose your position. The job itself is fairly easy but includes a lot of memory and knowledge. \r The management keeps switching as they get promoted and get replaced which makes it very hard to get along with them. Some seem unorganized and can sometimes affect your job. \r With the city of Ottawa, you need to be bilingual which could be a con for some.", "pros": "Safe workplace", "cons": "Poor management", "date_created": "March 7, 2018"},
{"id": "1c7s2gfoj5j76af7", "rating": 4.0, "text": "An extremely rewarding job as youre always with children. Great employes, a very positive work place with extremely understading bosses. They're always there to assist you with anything", "pros": null, "cons": null, "date_created": "March 5, 2018"},
{"id": "1c5226l7m5j5kftp", "rating": 5.0, "text": "I worked in two departments.  The first was great... interesting work, great people to work with, overall environment was friendly and not stressful at all.  Second department I worked in was a great place to work but management would never give you a straight answer when it came to becoming a permanent employee", "pros": "Benefits", "cons": "Management made you play a guessing game to whether you had a job or not at the end of the week", "date_created": "January 29, 2018"},
{"id": "1c52220nvak659f4", "rating": 4.0, "text": "Management was good\r Pay was good\r Environment was laid-back & fun\r Employees were great to work with & friendly\r Good work/life balance\r Part-time & Full-time employment", "pros": "Good pay, good environment", "cons": "No benefits", "date_created": "January 29, 2018"},
{"id": "1c501rcts5j5k815", "rating": 5.0, "text": "I love working for the City of Ottawa. I learned to get along with coworkers, dealing with customers, and I grew as a person. I learned that customers are always right and to respect their wishes.", "pros": null, "cons": null, "date_created": "January 28, 2018"},
{"id": "1c4iughgpb89rfgs", "rating": 5.0, "text": "Very hard to make the cut.There is lots of training but overall the hours are nice,the benefits and pay are excellent..................................", "pros": null, "cons": null, "date_created": "January 23, 2018"},
{"id": "1c4gaa62lakhj9ji", "rating": 5.0, "text": "It was a good work environment in which you were able to work independently and learn good team skills. I would recommend for anyone to apply and work there", "pros": null, "cons": null, "date_created": "January 22, 2018"},
{"id": "1c4fk16re52tkda1", "rating": 3.0, "text": "Relaxed environment that brings you closer to the community. Its easy when you finish training and you don't require much supervision. The pay is steady and shifts are reliable.", "pros": null, "cons": null, "date_created": "January 22, 2018"},
{"id": "1c3rnjvn25nd7epo", "rating": 4.0, "text": "Days at work are very long but there is always learning curves and new knowledge obtained every single day. Good staff and tons of training for every situation. Overall great place to work.", "pros": "free snacks", "cons": "stressfull", "date_created": "January 14, 2018"},
{"id": "1c1o4kcr60mct6gs", "rating": 3.0, "text": "withing the city of ottawa, specifically being a lifeguard and swim instructor was a good job when i was 16-18. As i got older i was primarily working with younger people which created a very isolated work environment. \rManagement was young adults who often didn't know how to act appropriatly in the work place and towards the people \"working\" for them.\rThe job paid well however there are two different rates for lifeguarding and teaching swimming lessons. if you are interested in teaching swimming lessons you are looking at working only evenings and weekends.", "pros": null, "cons": null, "date_created": "December 19, 2017"},
{"id": "1c1m9ni570kbu0ap", "rating": 5.0, "text": "Working at the city was amazing. It had great hours as well as my coworkers were all respectful.\rThere is no better place to work then the city of Ottawa.", "pros": null, "cons": null, "date_created": "December 18, 2017"},
{"id": "1c075vooaakdc95s", "rating": 4.0, "text": "I've been working with the city for 3 years, and I have to say that I've had tons of fun working there. Working as a before care and after care counselor was never a job I would've seen myself doing, but having done it, I'd recommend it to just about anyone who's looking for a first job. Being around kids allows for a fun, fast paced work environment. It's also a great way to improve your communication skills and meet new people. My only complaint would be the lack of hours...", "pros": "Easy job if you enjoy being around children", "cons": "Lack of hours", "date_created": "November 30, 2017"},
{"id": "1bv50rld1akcocj7", "rating": 3.0, "text": "Worked 12 hour shifts cleaning sidewalks in the city of Ottawa was a fun spot to work and really enjoyed it but only worked when I got called in which was very hard to deal with and never got called back for the next year which was disappointing.", "pros": null, "cons": null, "date_created": "November 17, 2017"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1buc70j9c1d1e52v", "rating": 4.0, "text": "The lifeguard/swim instructor position offers a lot of good hours and flexible scheduling for a student who wants to work. Getting paid above minimum wage for fun work with like-minded young adults is great.", "pros": null, "cons": null, "date_created": "November 7, 2017"},
{"id": "1btscae3a52vfaft", "rating": 5.0, "text": "I like working there. always work hard with enthusiasm. want more hours and jobs for making money. I handle cash and talk and help customers with anything they need.", "pros": "breaks", "cons": "long", "date_created": "November 1, 2017"},
{"id": "1btpno3c752v9e4c", "rating": 4.0, "text": "Lifeguard training consisted of the following: \r ● Contact emergency medical personnel in case of serious injury\r● Monitor pool area for violations and potential hazardous situations\r● Assist in maintaining pool and recreation areas clean\r● Examine injured individuals, administer first aid", "pros": null, "cons": null, "date_created": "October 31, 2017"},
{"id": "1bt7rnvo45nb5bhd", "rating": 4.0, "text": "Worked great with school as shifts  did not conflict with class times.\rBarely  higher than  minimum  wage.\rIs ideal as  a part-time student  position.", "pros": null, "cons": null, "date_created": "October 24, 2017"},
{"id": "1bqb6gj9e5j5iagn", "rating": 5.0, "text": "I  directed, allocated and coordinated the day to day tasks of designated of personnel and ensured the quality & quantity of output to achieve directed\rstandards Petrie Island City of Ottawa public beach, Met deadlines according to the published schedules, Performed building/washroom maintenance, Managed the volleyball/paddle board as a rental associate/Cash handling.", "pros": null, "cons": null, "date_created": "September 18, 2017"},
{"id": "1bpm2ko7o5j5bblh", "rating": 4.0, "text": "Would have liked more hours at the Rec Centre, not much time spent there. Great staff and fun place to work. Easy contact with supervisor, always friendly and available", "pros": null, "cons": null, "date_created": "September 10, 2017"},
{"id": "1bph5h1725j5be59", "rating": 3.0, "text": "As much as I enjoyed the location that I worked at, I felt very overworked for my pay rate. There is also little room for advancement in the job sector. The staff was lovely, but the job just wasn't worth it. \r Downsides:", "pros": "Great staff, great location, good community feel", "cons": "Little room for advancement, Very little staff to take shifts from you, Low pay rate, Not enough hours", "date_created": "September 8, 2017"},
{"id": "1bonlr8m25j4veuh", "rating": 5.0, "text": "Working as a volunteer for a City of Ottawa summer camps includes collaborating with a team of coordinators to create a fun and exciting environments for youth, such as planning indoor and outdoor activities, exciting games, field trips and outings. \r It's a fun summer camp for the kids, and also a fun job for the camp counselors.", "pros": null, "cons": null, "date_created": "August 29, 2017"},
{"id": "1bn7mglrc5j5aesu", "rating": 4.0, "text": "Good and bad feelings. Work days seem to take up the whole day and leave no room for evening activities. Management makes unadvised decisions without reason. Good working with kids and good staff in a safe environnement", "pros": null, "cons": null, "date_created": "August 10, 2017"},
{"id": "1bmn2cm4f5n92cuo", "rating": 3.0, "text": "Get to work with a a great team in a small office that is set up well with great managment.  Constantly getting to work on differnt tasks and inproving my skill levels. would love a slightly more fast pased location but enjoy a bit of quiet time to do cleaning a reorganizing of the office.", "pros": "Enjoy the working with differnt projects and great people.", "cons": "Can not get enough hours", "date_created": "August 4, 2017"},
{"id": "1blthk5n75nclc0f", "rating": 4.0, "text": "At first it seemed like the day would never end with you in a chair all day just looking at a computer screen but as soon as you get to know the staff and realize how easy of a job it is you appreciate the long hours you've worked", "pros": "Great work environement", "cons": "long hours", "date_created": "July 25, 2017"},
{"id": "1bjpo01l35nd0cfp", "rating": 5.0, "text": "work restrictions are placed upon people in order to move forward , management does not encourage people to advance in the work force . tough environment to work in", "pros": "staff", "cons": "management", "date_created": "June 29, 2017"},
{"id": "1bjol80075n8s84k", "rating": 5.0, "text": "This is a great job for potential officer of the law to learn the daily routines, report writing and dealing with the population. I learned how to calmly get through a heated discussion with an individual, I know to keep the high emotions at bay so that rational decisions can be made", "pros": null, "cons": null, "date_created": "June 28, 2017"},
{"id": "1bj5ndh3v52sp8mf", "rating": 4.0, "text": "Although the hours are a bit frustrating to work around, I had an excellent experience working for the city. They allowed me to gain a lot of experience in public relations and personal responsibility.", "pros": null, "cons": null, "date_created": "June 21, 2017"},
{"id": "1bj0fhn4a52sp8gg", "rating": 5.0, "text": "I was only here for a short time but I enjoyed working here, the other staff were friendly and accepting, and we all seemed to work okay together though we all had different styles in how to handle things.", "pros": null, "cons": null, "date_created": "June 19, 2017"},
{"id": "1bims8ik2akgsd8r", "rating": 4.0, "text": "Great work environment for young people. Coworkers are often similar minded people who are always willing to help out. Employees are for the most part very skilled in their area of expertise and provide services to the best of their abilities.", "pros": "Good pay, Comfortable work environment", "cons": "Inflexible hours", "date_created": "June 15, 2017"},
{"id": "1bibqkv4ib878a9q", "rating": 5.0, "text": "Administrer les medicaments aux patients selon les prescription du Doctor et se rassurer que tous les patients sont traites avec dignite et respect, sans discrimination. Entretenir de bonnes relations avec les patient afin de faciliter la therapie( nurse -patient relationships).\rSe rassurer que les psw font leur travail de facon appropriee. Repondre aux questions posees par la famille des patients, cette situation est assez stressante car certaines familles sont trop exigentes. Reporter des incidents à l,infirmiere en charge, ces infirmieres/infirmiers sont toujours prêts à aider et le font avec plaisir\rceci rend l,admosphere agreable.", "pros": "Good team work", "cons": "No permanent position available", "date_created": "June 11, 2017"},
{"id": "1bh8r3lrn5j5bfmg", "rating": 5.0, "text": "Everything about the City of Ottawa is amazing\r Salary Vacations and work expectations.\r I would reccomend government employment to anybody.  Yay Defined Benefit Pensions", "pros": "Salary", "cons": "None", "date_created": "May 28, 2017"},
{"id": "1bgdqbgo65n8vaot", "rating": 5.0, "text": "Management supported the opportunity to advance my knowledge within my work environment. \rGreat place to work for all Ethnic backgrounds.\rA gym was on site for those who wished to participate.", "pros": null, "cons": null, "date_created": "May 18, 2017"},
{"id": "1bg4mjd905n8nfrc", "rating": 1.0, "text": "The City of Ottawa is generally a depressing place to work. The majority of the departments are filled with disinterested government workers looking to grow the size of their department. There is essentially no sense of purpose in the management and the students generally consider the entire process as a joke. Although The hours and pay was good, I can't help but feel guilty wasting taxpayers money in a clearly unproductive sector. \r Cut the student program, have students work in the private sector in the summer and actually accomplish something. I feel dirty just thinking about it.", "pros": "Easy, good pay", "cons": "apathetic management", "date_created": "May 14, 2017"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1bf80tsdq0mtq5uu", "rating": 3.0, "text": "You are just an employee number.  I found a very large disconnect from management down to the frontline workers. Management has really no idea of what the job of an Operator is.", "pros": "None", "cons": "None", "date_created": "May 3, 2017"},
{"id": "1bf5lgjmf0kbq75g", "rating": 5.0, "text": "I've been with the city of Ottawa for 2 years now and starting on my 3rd. Each year I come back it just keeps getting better. It's a full-time job, but it's definitely worth it.", "pros": null, "cons": null, "date_created": "May 2, 2017"},
{"id": "1bevt927g0mt832e", "rating": 5.0, "text": "I have worked for the City of Ottawa for two years. It is a great place to work because of the steady hours and great employees. I really enjoyed working within the traffic program and I have learned very much.", "pros": null, "cons": null, "date_created": "April 30, 2017"},
{"id": "1beod2mg90mto2ac", "rating": 3.0, "text": "Focused on new programs and initiatives to develop employees including but not limited to language training, employee mentorship, training in technical areas. The City offers a wide range of career choices in several disciplines and as such there is always the potential to switch careers.", "pros": null, "cons": null, "date_created": "April 27, 2017"},
{"id": "1bemdv37i0mtm6ib", "rating": 4.0, "text": "I enjoyed volunteering at the Cyrville Community Centre. The staff were encouraging and understanding and campers were great to work with. I would recommend it to others.", "pros": null, "cons": null, "date_created": "April 26, 2017"},
{"id": "1bejqqv6s0kbj630", "rating": 4.0, "text": "My experience working for the City of Ottawa has been quite beneficial. They incorporate many opportunities and I have learned many skills while working for the City of Ottawa. They have prepared me well with trainings and additional information about my job. Overall, I would recommend working with the City of Ottawa.", "pros": "Paid training and realistic expected work hours.", "cons": null, "date_created": "April 25, 2017"},
{"id": "1bejkg688brf498q", "rating": 3.0, "text": "I worked for the City of Ottawa as a rink supervisor under the authority of a community leader. The City of Ottawa provided the tools necessary and helped to organize both community events and was appreciative of our work in the community. As an employee of Dovercourt Recreation Centre, the city provided much of the summer camps funding and helped to shape program creation. As far of supervision or direct involvement, I understand the city provided the funds and requirements, but allowed us the operational flexibility to program our own camps to cater to our clientele. In conclusion, the City has been a fine employer and patron.", "pros": "Flexible work hours, knowledgeable program staff", "cons": "Low wages for contract work", "date_created": "April 25, 2017"},
{"id": "1bej16ve10kbj0t1", "rating": 5.0, "text": "Good place to work in the summer time. I have great respect for the city of ottawa they treat everyone fairly and honestly and their expectations are always clear.", "pros": "Working Outside", "cons": "Long hours", "date_created": "April 25, 2017"},
{"id": "1beh08l8q5ne89jk", "rating": 5.0, "text": "Gained valuable experience in the customer service industry in the public sector. Developed problem solving skills, multitasking skills and customer relations skills.", "pros": null, "cons": null, "date_created": "April 24, 2017"},
{"id": "1be8queen5j65eu5", "rating": 4.0, "text": "The workplace is incredibly friendly, everyone is happy and willing to pass down years of knowledge and experience with new and student employees. Their GIS department is interesting and it was fun getting to work with all the data in their Enterprise Databases.", "pros": null, "cons": null, "date_created": "April 21, 2017"},
{"id": "1bdhar6i75j5nco6", "rating": 5.0, "text": "A typical at work involve teaching classes and then guarding a free swim. I was always learning at work and improving my swimming skills. The workplace culture was very positive and supportive.", "pros": null, "cons": null, "date_created": "April 12, 2017"},
{"id": "1bdch72fo5nd5fpu", "rating": 5.0, "text": "Best job any kid in high school who plays hockey could ask for. I supervised and maintained a local ice hockey rink after school from 4pm-10pm. Hardest part of the job was quitting. Most enjoyable was playing hockey with my friends for 6 hours and getting paid to do so.", "pros": "Hockey", "cons": "poor wage", "date_created": "April 10, 2017"},
{"id": "1bcsu801ab89pb16", "rating": 5.0, "text": "Driving and getting people from the out lying areas of Ottawa to the downtown core. Keeping my bus on schedule and making the passengers happy by being on time and getting them to their destination safely.", "pros": "freedom of being on the road, being my own boss while in charge of my bus.great benefits.working with the public.", "cons": "working split shifts", "date_created": "April 4, 2017"},
{"id": "1bcqlprom52t6b74", "rating": 4.0, "text": "good experience, lots to learn especially for people who have not worked in politics before. Politics has less job security but is more exciting (events, socializing etc) . Good luck !", "pros": "free lunches and free events", "cons": "working with a lot of people who have complaints about the city", "date_created": "April 3, 2017"},
{"id": "1bcbkr2i85nd0anq", "rating": 5.0, "text": "Working with the City of Ottawa was very beneficial for me. I learnt a lot of new skills such as SAP, inventory control, accounts payable/receivable etc. Management was really friendly and encouraged their employees to excel in the workplace and learn new things. Overall, a wonderful experience!", "pros": null, "cons": null, "date_created": "March 28, 2017"},
{"id": "1bbe9h5s9ak92a7h", "rating": 4.0, "text": "Having to stay attentive and make responsible choices to prevent injury is the most important aspect to my job. Dealing with customer service issues and customer service payments and registrations.", "pros": null, "cons": null, "date_created": "March 17, 2017"},
{"id": "1bao5cg550mta3ib", "rating": 4.0, "text": "Management and employees were always in a great mood. Got to be a big influence to kids, which was very rewarding. It was a fun place to work because of the games and constant fun", "pros": null, "cons": null, "date_created": "March 8, 2017"},
{"id": "1baki9qb00kbl1n0", "rating": 3.0, "text": "I had a great time with the instructors and kids and learnt a lot form my experience. There were many aspects about the job that made me enjoy the idea of continuing down a path into leadership employment, especially with children, because it allows you to learn responsibility and care giving as well as being flexible and understanding considering we dealt with the very young kids.", "pros": "volunteer hours", "cons": null, "date_created": "March 7, 2017"},
{"id": "1bagh4feg1ahk3ot", "rating": 4.0, "text": "Everyday I would go in at 7, then we would sit and wait for the Zone Supervisor to give us orders of what we were going to be doing tat day. Learned a lot about different machines, and the safety of being around them. Good place to work, everyone was nice.", "pros": "The work was not hard.", "cons": null, "date_created": "March 5, 2017"},
{"id": "1ba6168su52v0deq", "rating": 5.0, "text": "Working as a parks programmer is great.  You work closely with a team of generally 6 or 7 people.  management is fantastic and there is a lot of training and making sure you feel confident with the tasks at hand.", "pros": "outdoors young atmosphere good hours", "cons": "no work if it rains no formal break hours", "date_created": "March 1, 2017"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1ba5orkhsakdg8vl", "rating": 5.0, "text": "Always a positive atmosphere.  Happy customers. Occasional work parties. The bosses where always looking out for the workers.", "pros": "Fun activities", "cons": "long days", "date_created": "March 1, 2017"},
{"id": "1b9pegavb5neufd1", "rating": 5.0, "text": "My typical work days involves interacting and playing games with children. I absolutely love this job because I get payed to play. The management of this job is fantastic because it provides me with the time to work while attending school.", "pros": null, "cons": null, "date_created": "February 24, 2017"},
{"id": "1b9enkhbp5j6g9b7", "rating": 5.0, "text": "Presently I work at Long term care, at this type of facilities a strong team work is required in order to achieve the maximum results wich are the wellbeing of the residents.", "pros": "I can be rewarding", "cons": "It can be very tiresome", "date_created": "February 20, 2017"},
{"id": "1b9c70c9h5nem8u9", "rating": 5.0, "text": "If ever given the chance to work for the City of Ottawa, you should. Any position has great job security and a well-structured management. Most jobs requiring experience pay well. Internal hiring for jobs is the most important perk of working for the city,", "pros": "Job security and advancement", "cons": null, "date_created": "February 19, 2017"},
{"id": "1b8j2ohdgak4ucmv", "rating": 5.0, "text": "bon collaborateurs \ravantages sociaux \racces facile par raport au transport", "pros": "avantages sociaux", "cons": "dificulte a monter", "date_created": "February 9, 2017"},
{"id": "1b6pfrovi52t4dbu", "rating": 5.0, "text": "Jack Purcell Community Centre was the place I did volunteering work before I got a part-time employment there as a summer job in the year 2008.\rI could not complain anything because this place gave me lot of opportunities to get connected with people and lot of fun to work with.", "pros": null, "cons": null, "date_created": "January 18, 2017"},
{"id": "1b6i15ut6akgudvq", "rating": 5.0, "text": "The job starts off with a great training weekend where you get to meet many of the new staff you will be working with. You learn how to maintain the pool, how to perform first aid in a pool setting, and how your specific community pool runs. You also learn how to safely work with chemicals (ie. chlorine). The staff and management make working fun, and engaging. You won't feel like you are going to work but rather going to hang out and have fun with that community. One of the hardest parts of the job was standing in heat for long hours, but rotations help with that. Besides seeing how happy the pool and your activities make the children far outways the negative! Plus the hours are very flexible and can work around your schedule.", "pros": "fun training weekend and staff events", "cons": null, "date_created": "January 15, 2017"},
{"id": "1b5lld5tg1ah67kc", "rating": 4.0, "text": "Staff are fun, the pay is great considering how young the lifeguarding staff generally are. Staff trainings can be annoying but with a fun group of staff and management, they can be pretty fun.", "pros": null, "cons": null, "date_created": "January 4, 2017"},
{"id": "1b54gpij90mt96fo", "rating": 5.0, "text": "Working as a lifeguard for the City of Ottawa provided me with extensive team working skills as well as building my personal leadership skills. My employers and supervisors were always helpful and always supported me and it was a very fun place to work. The staff were amazing.", "pros": null, "cons": null, "date_created": "December 28, 2016"},
{"id": "1b4sasriq0mcp4l4", "rating": 5.0, "text": "great place to build a career, with stability and stable income, you know what to expect every day and you know what you will make every pay , you will never be out of work and never worry about not having money for you family", "pros": "great benefits", "cons": "repetitive job cycle", "date_created": "December 25, 2016"},
{"id": "1b0edqd3s5j6uek0", "rating": 5.0, "text": "As an employee you have to be very attentive and scanning your classes at all times. You're responsible for the lives of those in your classes.", "pros": null, "cons": null, "date_created": "October 31, 2016"},
{"id": "1b037g96952uoeag", "rating": 4.0, "text": "Strong and friendly team environment, up to date with latest technology, environment, Recognition for Hard Work, a fun open concept atmosphere, and filled with passionate people.", "pros": null, "cons": null, "date_created": "October 27, 2016"},
{"id": "1avcuqc4vak5acdl", "rating": 4.0, "text": "Start it with the city during the summer session. I love it and decide it to stay on for the fall. Depending the pool you work at, it is a little family and teach you how to be confidence on your job. They are very strick on your training has you must stay in shape to be able to do your job well. In services are every months, so if you miss one, you have to find another one to go. The hardest part of the job is to en force the rules. Had to explain even if their child is taking swimming classes, they still need to stay at arms reach has an example (orange bracelet). The program coordinator is there to help you but do what he/she said. \r Other then that, free recert and encourage to get more advanced qualification like NLS instructor or so.", "pros": "Great staff, supportive, etc...", "cons": "Shift depends on senority, if hired in the summer months and want to work in the fall they have to reactivate you manual", "date_created": "October 18, 2016"},
{"id": "1as4t83cmakbuef2", "rating": 5.0, "text": "Public sector has always been a great place to work. I got wonderful co-workers, seniors and managers. No environment is perfect but it is pretty close to be a perfect. So far so good.", "pros": "Benefits, Flexible working hours, Good management", "cons": null, "date_created": "September 8, 2016"},
{"id": "1arm7436ias0jebp", "rating": 4.0, "text": "I to work in an environment where I can get my work done but have in an environment where it is relaxed I like to finish my work by doing one thing at a time. I lie to feel productive in the work and support my fellow co-workers.", "pros": null, "cons": null, "date_created": "September 2, 2016"},
{"id": "1aqvkbg1iaqiqbnk", "rating": 5.0, "text": "- Great people\r- Great Culture\r- Lots of Employee Growth\r- Many Opportunities\r- Service Excellence\r- Drive to improve the everyday services\r- Great to train the Staff", "pros": null, "cons": null, "date_created": "August 24, 2016"},
{"id": "1aquucgfbaqiq83t", "rating": 5.0, "text": "As a typical day at work, everybody is friendly. Work starts at 8. Everyone is willing to give help whenever its needed. Co-workers are friendly as well willing to help as well. The hardest part was when you have to deliver the work on time and you have to pay attention to details at the same time. I liked that we had the lunch hour where we meet different people from different departments and could chat a little bit about life.", "pros": "They pay should be more", "cons": "The half an hour lunch was unpaid", "date_created": "August 24, 2016"},
{"id": "1apivgs6faqi49v2", "rating": 5.0, "text": "I got my first summer job with the city of Ottawa, I've learned english, made life time friends and got many opportunities to grow and learn as a worker and supervisor.", "pros": "Friendly, fun job and great time", "cons": "late night, too many trainings and long shifts", "date_created": "August 7, 2016"},
{"id": "1apas8o4nas378g4", "rating": 4.0, "text": "I would rather you enjoy the experience on your own then me tell you. Great salary and benefits for a life long experience.", "pros": null, "cons": null, "date_created": "August 4, 2016"},
{"id": "1ap8orc2nak9tcvg", "rating": 5.0, "text": "helping my worker to organize tasks, prepare meetings, organize the office procedures and make calls to book appointments or to remind clients of their appointements", "pros": null, "cons": null, "date_created": "August 3, 2016"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1ap3a89to5na897v", "rating": 5.0, "text": "It was lovely to work for our municipal government and learn how the corporate business services branch help the people of Ottawa", "pros": null, "cons": null, "date_created": "August 1, 2016"},
{"id": "1amn09ba70mt24h9", "rating": 4.0, "text": "Nothing bad to say here. Easy to get along with co-workers/supervisors. Kids and youth are fun to supervise for the most part.", "pros": "Co-workers, trips", "cons": "Long hours", "date_created": "July 2, 2016"},
{"id": "1alqn250dak93efp", "rating": 4.0, "text": "Best Job I have worked, work was different everyday so it leaves you with excitement for the next day.", "pros": null, "cons": null, "date_created": "June 21, 2016"},
{"id": "1akmlvfsf5na5efa", "rating": 5.0, "text": "I worked with special needs individuals and gained lots of real life experience with the City of Ottawa. This experience is needed for my future long term career with special needs individuals as a Personal Support Worker.", "pros": "Got paid to have fun", "cons": "None", "date_created": "June 7, 2016"},
{"id": "1ahq2hoer5nbmek4", "rating": 5.0, "text": "Fantastic treatment of staff, and very gentle and clear on the roles you need to be doing. On top of the training's you need to complete, and supportive for more qualifications.", "pros": null, "cons": null, "date_created": "May 2, 2016"},
{"id": "1ahn2lokm52v9e5o", "rating": 5.0, "text": "Busy and much to learn, computer system, policies, added courses, client services, programs and registrations for various courses and memberships and classes in the city.", "pros": "Great people, great clients", "cons": "Not enough hrs", "date_created": "May 1, 2016"},
{"id": "1ahks2sp35nbmdpl", "rating": 4.0, "text": "Management and Job Culture are usually oriented based on the political motives of the group (i.e. cyclist friendly vs. vehicle friendly for example). A lot is not accomplished because of this except when there is a clear mandate from Council to go one way or the other.", "pros": null, "cons": null, "date_created": "April 30, 2016"},
{"id": "1ahko65to5nbmcpn", "rating": 4.0, "text": "Working as a camp coordinator for the City of Ottawa was a great experience. I was able to leave work with a new perspective on social relations and work responsibilities.", "pros": null, "cons": null, "date_created": "April 30, 2016"},
{"id": "1ahdhnuucb83qb7b", "rating": 4.0, "text": "Once you're in the City of Ottawa, it is difficult to be gotten rid of. Opportunity for advancement is sometimes there but it is difficult to get in since the starting positions (students) are often given to family members or recommendations by employees.", "pros": "Stable hours", "cons": "Union culture (difficult to get rid of bad workers, poor opinion of doing work, etc)", "date_created": "April 27, 2016"},
{"id": "1afm8ol36as2mau0", "rating": 5.0, "text": "Recognized for my experience I appreciated the opportunity given to work in place of a city employee on parental leave.", "pros": "good work environment", "cons": "my placement did not last because it was not a permanent job", "date_created": "April 6, 2016"},
{"id": "1aevv4psnaka889u", "rating": 5.0, "text": "It was an amazing job financially for an entry level position! I made great money and the benefits were nice.Management is good they always help out and coworkers are friendly and helpful the hardest part is when we are shorthanded and busy.", "pros": null, "cons": null, "date_created": "March 28, 2016"},
{"id": "1ae0db0jd0kbp0ed", "rating": 4.0, "text": "customer relations such as dispute management, professionalism, interpersonal skills, effective communication skills.", "pros": null, "cons": null, "date_created": "March 16, 2016"},
{"id": "1acaj3n2o5ne5a92", "rating": 2.0, "text": "Part time employees are not included in any training that is offered that would help them move into a full-time position.  \r Also, any full-time opportunities that arise are difficult to apply for if you are a part-time employee.  \r I feel that part-time employees could be treated more fairly and with more respect.", "pros": "Flexible hours", "cons": "Exclusion from trainings and staff events.", "date_created": "February 24, 2016"},
{"id": "1a9thoa70ak5rbee", "rating": 4.0, "text": "The shift would start with our crew leader planning our route for the day.  We'd fuel up the machines and the truck before leaving the yard.  We'd cut our parks and sports fields until the end of the shift.\r My supervisor very knowledgeable.  He took hands-on approach when training us on the lawn tractors and mowers.\r The work environment was friendly and upbeat, it made everyday enjoyable.  The full-time workers were great, they kept all the summer students informed and smiling all day.", "pros": "The work atmosphere was very upbeat and friendly.", "cons": "The shift started at 7:00 am.", "date_created": "January 25, 2016"},
{"id": "1a9t29qdmak5rfnq", "rating": 4.0, "text": "Always a fun time working, great staff and cliental around. Always learning new things in the fitness world and of the job its self. Management for the department is amazing , great boss. Co-workers are great and always happy. Hardest part is dealing with upper management . Most enjoyable part if actually working with the team.", "pros": "get to workout", "cons": "upper management isnt great and pay", "date_created": "January 25, 2016"},
{"id": "1a9c82mpvas38cah", "rating": 4.0, "text": "learn to be patient, more understanding. Its a place where you get a reality check make you love your job more and more. You are providing care to another human being. And while you are doing it, you are doing with love, patient, tenderness.\r the hardest part of the Job is not to get attach emotionally for me because I am very emotional.", "pros": null, "cons": "6", "date_created": "January 19, 2016"},
{"id": "1a7r572gnas2qcko", "rating": 4.0, "text": "I truly grounding experience with immense feelings of gratitude and satisfaction. Definitely a memorable experience.", "pros": null, "cons": null, "date_created": "December 30, 2015"},
{"id": "1a70i85mnak6ibi5", "rating": 5.0, "text": "Great hours, great pay, team environment, simple tasks, trainings to keep you sharp. The management is very friendly, helpful, and approachable", "pros": "many breaks", "cons": "Long periods standing", "date_created": "December 20, 2015"},
{"id": "1a6mr5qhbas2fdmi", "rating": 5.0, "text": "A typical day at this occupation entailed many different aspects. I worked in teams and individually to trouble shoot and complete tasks.  I had to learn the building systems (operating, troubleshooting etc) to be granted the opportunity of supervisory roles when needed. I was given all the training necessary on issues such as health and safety, working with dangerous materials, working with equipment, and providing customer service. My supervisor is great to work under because he provides hands on training and leads the team from the front. The most enjoyable part of working here are the people I work with, who not only make the job fun, but makes being there enjoyable.", "pros": null, "cons": null, "date_created": "December 16, 2015"},
{"id": "1a662k23rak62f55", "rating": 5.0, "text": "The give you all the resources yo need to improve and better yourself so you can succeed into a successful career with the options of moving from department to department", "pros": "everything", "cons": "nothing", "date_created": "December 10, 2015"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1a4c5l4moak4qavj", "rating": 5.0, "text": "Was essentially a student inspector, overseeing various projects in construction, and also complete daily dairies of the completed work.", "pros": "Great Work Experience", "cons": "Low Pay", "date_created": "November 17, 2015"},
{"id": "1a41ocisg1d0v6ai", "rating": 4.0, "text": "Really great opportunity as a starter job. I enjoyed my time there a lot, it was great to work with a staff compliment who were really committed to their workplace and enjoy what they do. I really appreciated the opportunity for advancement, and I was able to progress into a supervisory role. I've learned a lot about team management in this position.", "pros": "great hours, very friendly coworkers, supportive management team, opportunity for advancement", "cons": "very few breaks, bureaucratic", "date_created": "November 13, 2015"},
{"id": "1a1mtdmc3as0j8br", "rating": 3.0, "text": "This was a contract position.  I learned the differences between private and public sector positions.  I was fortunate to have great co-workers.  It definitely makes work more enjoyable.", "pros": null, "cons": null, "date_created": "October 15, 2015"},
{"id": "1a1h42tge1bga7ao", "rating": 5.0, "text": "Very much a team player environment.  Energetic, positive employees and management.    Supportive, encouraging coordinators.    Opportunity to move within the City of Ottawa organization.", "pros": "Fitness memberships", "cons": "Part time - no benefits", "date_created": "October 13, 2015"},
{"id": "1a1ffgu3aakbm9uq", "rating": 3.0, "text": "easy job but only minimum wage\rcostumer service experience acquired", "pros": null, "cons": null, "date_created": "October 12, 2015"},
{"id": "1a1491mpr1bg17d1", "rating": 5.0, "text": "A typical day at work includes opening the facility, greeting members into the facility, answering phones. Addressing any question and registering clients in our programs. Front line work dealing with customers and cashier work. I learned to always have a positive attitude while working and to do my best. The management was fantastic, very easy to work with and accommodating to our school schedule. My co-workers were great and now some of my good friends. The hardest part of the job would be getting to know the City of Ottawa computer operating system, but it didn't take me long to get it! The most enjoyable part of my job is dealing and working with many different people and interacting with them.", "pros": null, "cons": null, "date_created": "October 8, 2015"},
{"id": "1a002blrb5ne5e83", "rating": 4.0, "text": "Got to experience an office setting and duties for the first time, communicated daily with city councillor's, analyzed and formatted data, programmed and installed collection boards.", "pros": null, "cons": null, "date_created": "September 24, 2015"},
{"id": "19urn5b9cakabams", "rating": 5.0, "text": "I had an amazing experience working with the city, everyone I encountered were very professional and more than helpful in helping me reach the next level. I learned and developed many new skills during my stint within the city. I'm extremely grateful to have had this opportunity while attending university in Ottawa.", "pros": "meet new people everyday and offered a competitive pay rate", "cons": "hours were a little scattered even though they were flexible", "date_created": "September 10, 2015"},
{"id": "19up4uiluas2cbck", "rating": 3.0, "text": "The City of Ottawa has many programs and since the amalgamation, the programs have evolved.  The City of Ottawa Aquatic programs are highly competitive and have gained national standing.", "pros": "dynamic environment", "cons": "high staff changeover", "date_created": "September 9, 2015"},
{"id": "19unc5tf8as2cbe2", "rating": 3.0, "text": "A fun work place with flexible hours and supportive staff. \r working with kids from different background and culture was the most enjoyable part.The was a lot of different stuff to do each, witch it interesting and give you the motivation to come to work everyday. The company is very culturally diverse.", "pros": "working with Kids", "cons": "long hours", "date_created": "September 8, 2015"},
{"id": "19u0av1gdak9ja91", "rating": 5.0, "text": "Awesome, like i really enjoyed my job i'm hoping to return for more \r summers to come. Its an all around fun experience to play with kids \r and prepare activities for the community. I couldn't ask for a better \r job.", "pros": "Great Staff", "cons": "Hot weather", "date_created": "August 30, 2015"},
{"id": "19sr3lba017cm1aj", "rating": 3.0, "text": "Great! I loved working at the Sandy Hill Community Centre and I learned many professional skills during my nearly 6 years there. I was part of a large family and we helped each other out.", "pros": "Free dinners", "cons": "No benefits", "date_created": "August 16, 2015"},
{"id": "19s3vpol9as3n9ja", "rating": 3.0, "text": "Dans mes fonctions, je m’affaire à pallier aux incidents ayant un impact important pour les utilisateurs des réseaux routiers. En plus, je suis responsable des achats et certaines réunions. J’organise et participe activement aux diverses activités pour mon groupe de travail.", "pros": "Challenge", "cons": null, "date_created": "August 7, 2015"},
{"id": "19r8lv35s5naveod", "rating": 4.0, "text": "Working with the city of ottawa was a great experience. Hard work from 7 am till 5 pm. Pay was worth the long hours and hard work. Crew was great and so was he enviroment.", "pros": "Pay was great", "cons": "Very hard work", "date_created": "July 27, 2015"},
{"id": "19o8dg2vb1ahf042", "rating": 4.0, "text": "A typical day for me at work is logging on to my computer and going through my emails! I list the ones that require immediate attention and are considered a priority. I then listen to my voice messages, respond if possible or gather the information and call back. I also review  my Outlook calendar for notifications and meetings booked. \r Then it's the \"to do folder\" I created. Ths is to list any outstanding tasks to complete . It's a pleasure to put a red line through tasks that are completed. \r The most enjoyable part of the job is getting work done in a timely manner. I plan in advance and organize my day well. Of course, there are always surprises and the expectation to respond to all inquiries within 24 hours. \r The hardest part of the job, is getting external or internal responses to enquires. I have no control in getting replies. However I ensure I do follow-ups or always have an alternative person to contact.\r My co-workers are great. We work as a team. Assisting each other in all aspects of the job. For days off or vacation time, we act as the cover off for that person. It's important to work well with colleagues, to share work load  and be a source of knowledge that  I am willing to share.\r If it's a quiet day, I do my filing!", "pros": "On site gym", "cons": "Out of Province travelling", "date_created": "June 20, 2015"},
{"id": "19mgftbbf5nf0dh9", "rating": 4.0, "text": "- Usually busy and fast paced work environment.\r- I enjoyed working with people and getting their mail and parcels to the correct location in a reasonable time frame.\r- I learned how to handle mail and use a machine to stamp outgoing mail.\r- I learned how to operate a loading dock.\r Typical day at work:\r-2 mail runs\r-Helping customers with internal and outgoing mail and parcels\r-Help receive a truck and let them unload and direct them to right floor and section.", "pros": "good hours", "cons": null, "date_created": "May 29, 2015"},
{"id": "19lnk1slsak6bf4u", "rating": 4.0, "text": "A typical day here is very stressful for we provide public transit for the city of Ottawa, And making service can be tough we have mechanical issues and driver issues and weather issues to contend with, Just to mention a few.\rCo-workers are great and the hardest part of the job is that you can't please everybody and that you can't fix everything as much as you try and as much as you want to, It gets frustrating.\rThe most enjoyable part of the job is knowing you were part of a team that did a job well done and made service and no one was injured and everyone had a great shift.", "pros": "There's a full gym on site and we get a free bus pass", "cons": "Shift work", "date_created": "May 19, 2015"},
{"id": "19llvt6jjakabbnl", "rating": 5.0, "text": "I've been with the City part time for 8 years, at the same complex!\rThe daily interactions with clients, is the best part of the job. \rThe senior clientèle are the best part of my day.", "pros": "This workplace feels so rewarding", "cons": "Hard to advance/get a higher title job within the City.", "date_created": "May 19, 2015"},
{"id": "19kq7l4qc5ndee95", "rating": 5.0, "text": "I loved every minute of working for Parks and the City. I'm sad to go. This job taught me patience and that working towards the happiness of others makes me happy.", "pros": null, "cons": null, "date_created": "May 8, 2015"},
{"id": "19ko1c1ne5ndefjv", "rating": 4.0, "text": "A nice as a startup job. I liked it but I am looking forward to more fashion or fitness related job. I learned a lot there and my Training helped me a lot to deal with kids and people.", "pros": null, "cons": null, "date_created": "May 7, 2015"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "19k07k7lr52sofvv", "rating": 5.0, "text": "Over see the workings of City of Ottawa Parks. Open the wading pool. Clean up the wading pool area, park and structure areas. Duties include; hosing pool, raking sand area, picking up garbage, swept pool and surrounding areas. Guarding pool, ensuring all the children in the wading pool were safely playing and having an enjoyable time. Working with staff, supervising staff, filling in schedules, ensuring pay sheet was filled out, as well as daily log. Meeting new children that come to park every day was exciting, creating a friendship and relationship with the patrons on the park. Sometimes challenging with some children on the park, but main thing was to keep patrons on the park happy and ensure that they are safe while at the park.", "pros": null, "cons": null, "date_created": "April 28, 2015"},
{"id": "19jmbpi8r52sodh6", "rating": 4.0, "text": "Park Programmer is a awesome job for some one who loves and enjoys kids, the outdoors, and being creative. Your day consists of cleaning up the park in the morning and filling up the pool.Then life guarding and creating fun activities for the kids to enjoy. Then ending the day with emptying the pool before locking up for the day. Overall great job to spend your summer working and you get to meet a lot of great people as well!", "pros": "Great Hours", "cons": "Weather conditions effect if you work that day.", "date_created": "April 24, 2015"},
{"id": "19isdfa0c0kbq5lv", "rating": 4.0, "text": "Great work environment. Attended programs at this facility when I was younger. Many senior staff members. Close knit employees. Keep client's best interests in mind.", "pros": null, "cons": null, "date_created": "April 14, 2015"},
{"id": "19h53nup8b84g9m6", "rating": 5.0, "text": "1) A typical day of work is consisting on inspecting the work implemented at site, helping contractors in accelerating their work as much as possible within specification and drawings.\r 2) I have learned many skills such as MS Project software, reading construction drawings in details.  \r 3) Management people at my work are very friendly people, i can ask them any question anytime in order to clarify my information.  They Keep asking if i have any problems basically they are very close to their employees.", "pros": "getting the employees involved in companies accomplishments", "cons": null, "date_created": "March 24, 2015"},
{"id": "19h3lng8n5ncg80a", "rating": 5.0, "text": "The City of Ottawa is an incredible opportunity for anyone looking for a job in a fun, and dynamic setting with great staff.", "pros": null, "cons": null, "date_created": "March 23, 2015"},
{"id": "19gkk52rdak8gdi3", "rating": 5.0, "text": "•\tDeveloping and implementing  the program\r•\tPlanning, monitoring and evaluating the direct involvement of the program \r•\tSite coordination, supervision, direction of participant, cash handling, customer services, risk management procedures and general administrative tasks.\r•\tWork collaboratively with other staff to deliver efficient and effective services", "pros": null, "cons": "low pay", "date_created": "March 17, 2015"},
{"id": "19gg4cea4as0gdii", "rating": 3.0, "text": "The day begins with the children coming to the facility. We then set up the activities for the day during their free play. It may be a craft, baking or a game. We organize the activity so that every thing runs smoothly. I've learnt that children are very demanding and require a lot of attention and management. My co-workers are great and it is easy to work with them. The hardest part of the job would be the amount of attention that each child requires. The most enjoyable part of the job is when you see the children smiling and loving the program so much that they don't want to leave.", "pros": "Flexible schedules", "cons": "Short shifts", "date_created": "March 15, 2015"},
{"id": "19geudetp5ncgdre", "rating": 5.0, "text": "Working for the City of Ottawa is rewarding and a great place to build a career.The city offers training to build on new skills to advance within the corporation.", "pros": null, "cons": null, "date_created": "March 15, 2015"},
{"id": "19g5ck1jd52sg8dk", "rating": 4.0, "text": "Assisted the workers at social services for clients files or records.\rEntered information into the database, filed away client files when workers was done with file. Answered client questions and concerns. Worked with a great team of people", "pros": "Benifits", "cons": "stressed clients", "date_created": "March 11, 2015"},
{"id": "19fl6n6v45ncgbct", "rating": 5.0, "text": "A typical day at work including guarding the pool while the children were at play, and then when you rotated with your co-workers, you played with the children in the field.", "pros": null, "cons": null, "date_created": "March 5, 2015"},
{"id": "19f1vj7to5ncg9s3", "rating": 5.0, "text": "I enjoy my every day work at City of Ottawa. There is a good management and nice facility. There is a good opportunity to get valuable experience and build future career. Currently I am a part-time worker and I think I have enough experience to apply rof a ful-time position.", "pros": "Flexible hours of work", "cons": "not enough hours to fil my day", "date_created": "February 25, 2015"},
{"id": "19do7tr395n8g83e", "rating": 4.0, "text": "I enjoyed working for The City of Ottawa, unfortunately my hours were cut and I am now seeking other employment.\rI was a cleaner, worked all shifts, mostly nights at the pool.", "pros": null, "cons": null, "date_created": "February 9, 2015"},
{"id": "19dm122vp5n8gefi", "rating": 5.0, "text": "Ability to upgrade skills and knowledge to coordinate the best position to ensure longevity in a position and provide quality support to the customer.", "pros": null, "cons": null, "date_created": "February 8, 2015"},
{"id": "19dfkfkdgas0ga34", "rating": 4.0, "text": "Worked in a team oriented environment. Normal clerical duties. Assisted with project management. Great customer service experience.", "pros": null, "cons": null, "date_created": "February 6, 2015"},
{"id": "19dabp7745ncg8hc", "rating": 4.0, "text": "Since I begin the day early each day, starting to work at 6.00 a.m was perfect for me and my lifestyle.I thoroughly enjoyed working for the city of Ottawa", "pros": null, "cons": null, "date_created": "February 4, 2015"},
{"id": "19d2tsod35n8gdq6", "rating": 5.0, "text": "As a City Councillor each day held a new challenge, and filled with diverse requirements and projects. As a key decision maker in the City it was critical to understand all the projects affecting the ward I represented as well as City-wide projects like Light Rail, new developments, development of new parks, building new roads or sewers.There was not a day that was not interesting. Although I worked most evenings and weekends at events and meetings, it was an enjoyable and rewarding term of government and I achieved a number of significant accomplishments.", "pros": null, "cons": null, "date_created": "February 1, 2015"},
{"id": "19abt86v65n8gfur", "rating": 5.0, "text": "A typical day would include driving to various location sites to perform landscaping duties which for my division included cutting grass on pathways. Some of the most important things I learned while working was a greater understanding and comprehension of the French language, as most of my co-workers spoke french. Another important aspect were the required training programs made available such as occupational work safety, work harassment, and other training programs related. These courses explained work regulations and work hazards. The hardest part of the day was working in somewhat exhaustive heat throughout the summer. The most enjoyable parts of the day was ironically working outside, because being able to spend summer outside while working has its benefits but also its cons.", "pros": null, "cons": null, "date_created": "December 29, 2014"},
{"id": "198rlaqnn5n8g8ov", "rating": 5.0, "text": "The job of being a Lifeguard requires\r - on going learning and teaching opportunities. \r - There is an expectation that each individual is to work as a team in high stress situations \r - Weekly Monthly an yearly practice and certify qualifications.\r - Learn a lot about life saving, pool maintenance, paper work, community involvement and much more.", "pros": "Great Pay, Fun and active, Work with others in team buliding excercises", "cons": "Constantly teaching in cold water, chlorine rashes, clean possible vomit, etc (pool follwings)", "date_created": "December 10, 2014"},
{"id": "196niagad5ncg949", "rating": 5.0, "text": "Very enjoyable workplace, working with children is extremely fun and rewarding. All the staff are great people and it continues to be a great experience. No two days are the same, and while some children's disputes can be challenging to resolve at times, it gives a deep sense that you're making a difference in their lives.", "pros": "Great place to work", "cons": "Short hours (except summers)", "date_created": "November 14, 2014"},
{"id": "194d98ape5ncgek4", "rating": 2.0, "text": "As a lifeguard with the City of Ottawa, I have it relatively easy.\r I work at a quiet pool, with a simple task set, and a fair number of swimming lesson blocks.\r I really enjoy how structured and precise everything is. There is always a plan for everything, and the answers to any question you may have is just simple to find.\r The one thing that I don't necessarily enjoy is the management style. At my pool, the PC's office is located within the lifeguard room, separated by a few filing cabinets and nothing more. The level of micro-managing that occurs is difficult to handle at times. \r The pros are numerous. I enjoy teaching higher-level swimming lessons, so I had a few really good blocks of lessons including Swim Kids 8/9/10, and PowerSwim. Teaching these classes is great because the Head Guards provide a strong support and are available as a ready reference whenever you need. \r Overall, I've enjoyed my time at the City.", "pros": "Structure and planning is incredible", "cons": "Management team is uncooperative within itself", "date_created": "October 16, 2014"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "193lkgmabak4g83m", "rating": 5.0, "text": "As a lifeguard with the City of Ottawa, I have learned many valuable skills that can be applied in the workforce. I have learned how to work as a team and how to work with little supervision. As a lifeguard, team work is essential, as the facility is large and many lifeguards are working together to ensure the facility is safe. I also learned advanced first aid skills, included how to operate an AED machine and oxygen tanks. \r As a head lifeguard, a typical day includes setting up the facility, ensuring my staff are performing their responsibilities, responding to public relations, opening and closing the cash, closing the facility, and writing daily reports. As a head lifeguard, I would say the hardest part about my job is balancing work and personal life. As the head lifeguard, I am responsible for the entire facility and my staff. This can be very time consuming and I often find it difficult to allow myself personal time and activities while not at work. The most enjoyable part of my job is working in a great community and getting to know the patrons on a personal level.", "pros": null, "cons": null, "date_created": "October 7, 2014"},
{"id": "193lefnec5ncgchk", "rating": 5.0, "text": "i love that job, learned a lot their.\rvery helpful, nice employee.", "pros": null, "cons": null, "date_created": "October 7, 2014"},
{"id": "192l65je65ncgbqv", "rating": 4.0, "text": "The work in the public sector is quite different compared to the private sector.", "pros": null, "cons": null, "date_created": "September 24, 2014"},
{"id": "191btqei95n8gbdj", "rating": 5.0, "text": "Good management, team-oriented environment. Good benefits package.", "pros": null, "cons": null, "date_created": "September 8, 2014"},
{"id": "190sm8neuak8gd1h", "rating": 4.0, "text": "The City of Ottawa Recreation and Culture department is a workplace of opportunity. Over the course of 9 years working for the city, I've had the pleasure of working with a variety of co-workers and volunteers. The work environments in recreation are very dynamic, challenging, and rewarding. The most enjoyable part of my jobs has been making people feel happier, safer, and knowing that they are the getting value they want.", "pros": null, "cons": null, "date_created": "September 2, 2014"},
{"id": "18tvk85oiak4gept", "rating": 4.0, "text": "I really enjoy the camaraderie between all the employees and that they really tried to involve the student even if we are only there for a short amount of time. My bosses have always been very easy-going and made sure that the road work we were doing was safe.", "pros": "Great hours", "cons": "Some unpleasant tasks", "date_created": "July 28, 2014"},
{"id": "18qp04bcq5ncgahl", "rating": 4.0, "text": "Although it was difficult to get to work as I lived far from the recreation, it was quite enjoyable to play and teach the children who were enthusiastic.", "pros": null, "cons": null, "date_created": "June 18, 2014"},
{"id": "18o2slenu5n8g8ht", "rating": 5.0, "text": "Met a lot of great people and learned a lot while working with the City of Ottawa. Very laid back but professional environment.", "pros": null, "cons": null, "date_created": "May 16, 2014"},
{"id": "18nmm70bjak4gdcf", "rating": 4.0, "text": "Great time, better people! I loved getting everyone together playing, and if you enjoy playing hockey and getting paid. I highly reccemond it!", "pros": "hockey", "cons": "cold", "date_created": "May 11, 2014"},
{"id": "18mrvbh0i5n8g8fg", "rating": 4.0, "text": "This is a great job for a student, you are provided with a fun environment and management offers many ways for advancement if you're a dedicated employee.", "pros": "Union Structure", "cons": "cap on the hours available to work", "date_created": "May 1, 2014"},
{"id": "18mq69ju25n8g8sf", "rating": 4.0, "text": "A typical day consisted of going out with electricians to repair broken lights and electrical equipment at various parks and recreational facilities all across Ottawa.", "pros": "Lots of time spent outside", "cons": "Inflexible work hours", "date_created": "April 30, 2014"},
{"id": "18jbhfomp5ncgd3o", "rating": 4.0, "text": "I got to the rink and first I shoveled all of the snow that was on it off with either a shovel or snow blower. I then brought all the equipment on too the ice such as hockey nets and I made sure at all times that everyone was in a safe environment. I was always the only one working during my shift. The ahrdest part of the job was the cold days as it was hard to complete all my tasks because i was so cold. The most enjoyable part of the job was being able to watch other people enjoy the ice that i helped maintain", "pros": "Fun enviroment", "cons": "Boring at times", "date_created": "March 18, 2014"},
{"id": "18ik22g9i5ncgdo2", "rating": 5.0, "text": "Good place to learn about the construction industry. This was a great opportunity to understand the importance of communication and project management.", "pros": null, "cons": null, "date_created": "March 9, 2014"},
{"id": "18gf11knk5n8g805", "rating": 3.0, "text": "this employment was many of first jobs that was profitable such as being unionized, receiving good long hours, and more.", "pros": null, "cons": null, "date_created": "February 10, 2014"},
{"id": "18fbdqtb6b80g8pq", "rating": 5.0, "text": "Would start off by setting up before the bell ran for school to be over. I would take attendance while kids start to pile in. I would then go over the schedule for the day with the counsellors and get activities set up. It would then become circle time. Circle time is for telling all the kids of any new rules and what the plans were for the day. We would then do one activity and after would be snack. After snack we would then go into the gym for a running game. After the gym it is free time for the kids that haven't been picked up yet. I would then write in the log book about the day, who was working, and what activities we played. After the kids are gone, we would clean up, and sign our hours.\r The hardest part of my job is making all the kids happy. There are different ages so there are many suggestions for different games. I try my best compromise for everyone. \r I love going into work because the kids just brighten my day. They are so entertaining and love being around them.", "pros": null, "cons": null, "date_created": "January 27, 2014"},
{"id": "18e9i6g22b84gah7", "rating": 3.0, "text": "I worked with another student under the supervision of an inspector on water main sites. I won't name him but he was very bitter and difficult to work for and due for retirement.  The city seems to have a lot of redundant positions and this seemed like one of them.  I stood outside all day watching contractors work and writing notes, and standing around basically just making sure contractor would do work as specified by the city.  Boss would bug me about not doing anything when there was literally nothing for me to do.  I did learn a lot just from watching the watermain construction since I knew nothing about construction going in.  We had no field office for most of the summer so the rainy and cold days were sometimes rough. Overall though, it wasn't to terrible.  Time went by slow most of the time but at least it wasn't too stressful.", "pros": "Relaxing, easy job, good intro to construction, decent pay for a student", "cons": "Stand outside all day, bad management", "date_created": "January 14, 2014"},
{"id": "18dk1iua6b84geas", "rating": 5.0, "text": "Coaching children to adults in the day time programs with The City of Ottawa", "pros": null, "cons": null, "date_created": "January 6, 2014"},
{"id": "18ddg07c1ak8g91v", "rating": 5.0, "text": "I really enjoy working for the city. But unable to continue in my career due to medical reasons.", "pros": null, "cons": null, "date_created": "January 3, 2014"},
{"id": "18antlpr4ak4g95m", "rating": 5.0, "text": "- Typical day starts at 7:30 AM\r- I have enjoyed my career starting at the City of Ottawa.\r- Welcoming staff", "pros": "Hours of work, Benefits, Salary, Overtime", "cons": "Long hours", "date_created": "December 1, 2013"},
{"id": "188cnrl3m5ncgb50", "rating": 5.0, "text": "I was resposnsible for doing changes and corrections to designs that are up for review. I would come to the office and have drawings on my table ready to be corrected. I complete them and take them back for further review and corrections. Worked on multiple projects at one time and for multiple designers. Co-workers were great though! Everyone supported eachother and helped eachother when ever possible. Great team work! I loved coming in and helping the designers and others with work and seeing that i had a part to do in accomplishing a project. The hardest part of my job must have was cordinating everything. At first it was a little difficult to layout my time for which project but once I got to know how everything runs, I was able to do that part much better and easier.", "pros": null, "cons": null, "date_created": "November 2, 2013"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1871b5apdb84gbi6", "rating": 5.0, "text": "Start the day at 7 & and end at 3:30. Great working outdoors and with good happy co workers.", "pros": null, "cons": null, "date_created": "October 16, 2013"},
{"id": "184s09733b84ga5b", "rating": 5.0, "text": "A typical day at work involves meticulous cleaning and building maintenance, as well as normal operation of rental set-ups, ice resurfacing and assistance to customers.  \rI have learned a lot of valuable life lessons working for the City of Ottawa, such as managing work load, and improvement of customer service.\rMy co-workers are all very nice and have the same intentions as i do when it comes to work. They also have very good communication skills.", "pros": "good pay, good hours, amazing boss", "cons": null, "date_created": "September 19, 2013"},
{"id": "181cpndoeak8gbb6", "rating": 4.0, "text": "Amazing management. Very relaxed atmosphere and some very cool projects to work on.", "pros": null, "cons": null, "date_created": "August 7, 2013"},
{"id": "17vhcnmahb80ga2l", "rating": 3.0, "text": "Volunteer work thought me a lot of things, I didn't only do this because I had to complete my 40 hours with school but I did it because I wanted responsibility, working on a outdoor rinks demands a lot of time and effort from the maintenance of the ice to the on ice discipline this volunteer work made me a better person. ", "pros": null, "cons": null, "date_created": "July 15, 2013"},
{"id": "17ug9qb7g5ncget7", "rating": 4.0, "text": "I enjoyed going to my clients homes and interacting with them on a weekly or bi weekly basis. ", "pros": "seeing the apreciation on clients faces", "cons": "not enough hours", "date_created": "July 2, 2013"},
{"id": "17t1gt3mradsgfvv", "rating": 5.0, "text": "It is very good to me part of my team. I need more hours to work.", "pros": "more hours", "cons": null, "date_created": "June 14, 2013"},
{"id": "17sbfdkdpb84gcr6", "rating": 5.0, "text": "In a typical day I would support my team. Fast paced environment which offered challenges in frequent operational changes to deal with day to day demands.  \r I learned a great deal about managing and supporting my team.  \r ", "pros": null, "cons": null, "date_created": "June 5, 2013"},
{"id": "17s5ej7o6b80gdsp", "rating": 5.0, "text": "It was my first job working with a group of children. \r The program was diversified, some days I worked with a English group and other day I worked with the French group.\r I learned to use my imagination to create news games. We even had a \"World Cup Soccer Competition\" during the 2010 games. \r ", "pros": null, "cons": null, "date_created": "June 3, 2013"},
{"id": "17qf0p1ptb84g8ha", "rating": 5.0, "text": "I feel like that I am the luckiest person to have enjoy work for all those years.\rThe last 10 years were with management -7 staffs and being in charge of the whole operation of a daycare with 35 childrens\r The hardest part of the job was to keep staff satisfied.\r The best part was to see our clientele adult and children happy", "pros": "lots of pros--happy smiles-fun-good hours-etc..", "cons": "demanding staff-budget-24 hour job", "date_created": "May 13, 2013"},
{"id": "17qcnekbc5n8gd6i", "rating": 1.0, "text": "If you are not from the city and have no connection to senior management socially, you will be set apart particularly in the Public Works group", "pros": "Pension", "cons": "Hostile work place atmosphere", "date_created": "May 12, 2013"},
{"id": "17os7pl5j5n8g9v0", "rating": 5.0, "text": "Very large department , friendly and very helpful associates.Meetings are short and interesting.", "pros": "independence", "cons": "location is far", "date_created": "April 23, 2013"},
{"id": "17nni4aq6b80gdi0", "rating": 5.0, "text": "I really got to demonstrate my creativity when i worked on the radio ads, bus inserts and newsletters. I enjoyed the position.I got to educate the public both young and old on water efficiency. I attended public events and also helped coordinate them!", "pros": "great management, flexibly", "cons": null, "date_created": "April 9, 2013"},
{"id": "17nngo562b84g8al", "rating": 5.0, "text": "4 hour daysHow to paint on \"concrete\" and what products are availableExcellent managementSuper co-workersThe heat!Expressing myself artistically", "pros": "was able to express my artistic talent, very social environment, fun!", "cons": "we had to work outside during a \"heatwave.\"", "date_created": "April 9, 2013"},
{"id": "17nllbe06b80gcdt", "rating": 4.0, "text": "A typical day at work would be providing customer service to tourists. As well as ensuring cleanliness of assigned areas. I learnt a lot while working with the City of Ottawa. I got to meet new people everyday, I got to deal with different kinds of people, and I got to realize that our environment is getting extremely polluted. Working with my co-workers was an amazing experience. This summer program was a pilot program in which 8 students were hired therefore we all had a lot in common. The hardest part of the job was having to deal with homeless people downtown because they would always yell horrible things at us. The most enjoyable part of the job was helping and guiding people to their destination.", "pros": null, "cons": null, "date_created": "April 8, 2013"},
{"id": "17mjgtddt5ncg91s", "rating": 5.0, "text": "More great people to work with. Had some great times and laughs. Still in touch with a couple of people.", "pros": "the people", "cons": "short term", "date_created": "March 26, 2013"},
{"id": "17mijgh4rb84gc8i", "rating": 5.0, "text": "This job requires five days a week with potential for weekend shifts. I provide up to three to one care with children with special needs in an after school program setting. It is very well organized and a constant learning experience. The environment is very well rounded and with excellent and amicable co-workers. The hardest part of the job is balancing my attention between the three children. Each day they all show up in different moods and need different attention. For example: one is diabetic and needs more attention health wise where as another has more behavioral issues. The most enjoyable part of this job is seeing the children grow and progress.", "pros": null, "cons": null, "date_created": "March 26, 2013"},
{"id": "17keq4ak3adsgbjg", "rating": 4.0, "text": "This job was a great experience. I experienced real work environments, worked with people I may never have in other situations and gained valuable skills I will carry into my next job", "pros": null, "cons": null, "date_created": "February 27, 2013"},
{"id": "17kclt8v35dsgdkr", "rating": 5.0, "text": "Worked at my own pace, but hade certain milestones to achieve.", "pros": null, "cons": null, "date_created": "February 26, 2013"},
{"id": "17gvoj1eo5dogakk", "rating": 5.0, "text": "A well run, informative environment. Employees are knowledgeable and willing to help their co-workers.", "pros": null, "cons": null, "date_created": "January 15, 2013"},
{"id": "17g31k7vradsgcbk", "rating": 5.0, "text": "This was quite possibly the best work experience I had. The LRT staff was very knowledgeable and supportive. Tasks and responsibilities were assigned based on experience. There was a very rich work culture and social environment with frequent social gatherings for team building. All in all, an excellent position!", "pros": "excellent co-workers, frequent social gatherings, laid back environment", "cons": "government salary", "date_created": "January 4, 2013"},
{"id": "1e3qrqlv848d7801", "rating": 4.0, "text": "Hi work part time for 18 years if was not to pay income tax still working that at Rjk Kenney maintenance do ice cleaning building cut grass with nights and weekend till 1:30 am work for Canada Day clean some building fire hall Cumberland museums weekend day Christmas weekend", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "17bnn0ura5dsgf8l", "rating": 5.0, "text": "Great hours and great supportyou chose your typical day at workyou are always learning from othersmanagement is greatmy co-workers are greatthe hardest part of the job is dealing with complaintsthe most enjoyable part of the job is seeing people progress in swimming", "pros": null, "cons": null, "date_created": "November 11, 2012"},
{"id": "17bgj12d5adsgah4", "rating": 5.0, "text": "Driving and take care of the person i pick up make sure and are tie down propely if they used a wheelchair.the most enjoyable part is i know i did a good day when they thank me for the ride and the ear i gave them.the hard part is to go and pick up the person and they tell you she pass away.", "pros": null, "cons": null, "date_created": "November 8, 2012"},
{"id": "17b8lhnng4e0g86l", "rating": 1.0, "text": "Operating buses on route, serving the public with safe transportation and timely information.Service to the public is its own reward. A driver typically gets treated as well as he treats commuters. First you may have to endure the initial encounter, not take it personally, and rise above the complaints, then respect will be returned.Selection of managers was always questionable, there was no apparent lick between qualifications, duties and abilities. Qualified candidates are often overlooked, appointed candidate often totally incompetent. The primary skill sought appears to be the ability to deflect responsibility onto subordinates.Bus drivers are service oriented people, they often become dis-enchanted with the lack of support, lack of needed training and lack of consistency in the application of guidelines. Obvious favoritism creates distrust, the dominate attitude at OC Transpo.Dealing with supervisors who push for dervice delivery at the expense of safety. Motivating yourself when the management has alterior motives, hiden agendas, and aggressive and disrespectful tendencies towards the front line workers.The many smiles on customers faces, friendships developed after years of service and satisfaction with knowing I performed to the best of my ability despite management.", "pros": "paid well for the task performed.", "cons": "paid poorly for the abuse tolerated from the supervisors.", "date_created": "November 5, 2012"},
{"id": "17aqn5hq5adsge2u", "rating": 5.0, "text": "Lots of hard work was put in to every day of work in planning and implementing the camp programs and it was paid off to see the campers enjoying every activity. Building relationships was a fundamental part of this job in terms of coworkers, local businesses, campers, and their parents.", "pros": "trips to museums and parks", "cons": "long hours", "date_created": "October 31, 2012"},
{"id": "17a721emk5dsgc34", "rating": 4.0, "text": "cuisiner pour 200 résidents .suivre les directives, avoir des heures fixes ,suivre les politiques et procédures", "pros": "repas gratiuit", "cons": "temps partiel", "date_created": "October 23, 2012"},
{"id": "179vqvghuae0g84o", "rating": 4.0, "text": "Upheld excellent customer service to customers on behalf of city of OttawaEnsured a clear understanding on delivery of efficiency regarding metersTroubleshooted wiring problems", "pros": "you make your own hours", "cons": "long hours", "date_created": "October 20, 2012"},
{"id": "179lv5r8n5dsge1d", "rating": 4.0, "text": "A typical day at work would be having to put Chlorine into the pool 3-5 times a day (everytime by a different co-worker). We would also make crafts with the patrons, play football in the field, and do activities in the pool. My co-workers were friendly and enthusiastic. We managed through the day well. Some days would be very relaxed with barely any patrons. Other days would be busy with camps coming in.The hardest part of the job would be cleaning the scum line from the pool walls. The most enjoyable part would pretty much be everything else!", "pros": null, "cons": null, "date_created": "October 16, 2012"},
{"id": "1795ac2315dsgb9d", "rating": 4.0, "text": "Excellent place to work .Fell like you are working with company not for company", "pros": null, "cons": null, "date_created": "October 10, 2012"},
{"id": "178hvt77u5dogb72", "rating": 5.0, "text": "In a typical day, I would go out with a crew of 3 other people and help them. We could travel to various locations in Ottawa. I would help clean up when they prunned / removed trees from City property.During my time with the City, I learned that I like an environment that changes from day to day. More so, we were outside , which gave me the opportunity to see many animals during the day.", "pros": "co-workers and boss!", "cons": "sometimes lots of time spent in the truck getting to each location.", "date_created": "October 2, 2012"},
{"id": "176r8f06jae0g9fp", "rating": 3.0, "text": "Amazing staff, rewarding work, hard to get full time but it's understandable.", "pros": null, "cons": null, "date_created": "September 11, 2012"},
{"id": "176r7o0a05dogdul", "rating": 5.0, "text": "This was my favourite job. I would get home from school, and head over to work where I would be meet with my great manager and front desk staff. All the staff members there were amazing, friendly, energetic and kind. After a short time I would take off to pick up the other school of kids down the road. Myself and usually three other councillors would walk with the kids down the side walk and across a road to get to the centre. Once we got there the kids would all head to the gym to get told what the activities were for the day. (Craft, Gym, Homework Room & Circle games). From there each councillor would take a group of kids to do there activity and wait for the parents to arrive, keeping to the 10-1 ratios of kids to councillors.The hardest part of the job would be coming up with craft ideas being a guy I tended to prefer gym so craft was not my strong suit. Most of the time I would get by with fun crafts that the kids enjoyed.The most enjoyable part of the job was the ability to feel satisfied with my job and know that I was doing my part in the community I lived in.", "pros": "feeling of self worth", "cons": "short hours", "date_created": "September 11, 2012"},
{"id": "172qoq3koae0gba6", "rating": 4.0, "text": "On a typical day at work I travel between many different job sites around Ottawa doing sewer and water main inspections. I have learned alot about infrastructure development which can only be gained through experience. I work along side of the contractor and my supervisor to ensure all the work is completed correctly and promtly.", "pros": null, "cons": null, "date_created": "July 23, 2012"},
{"id": "170nhelcd4e0g9l6", "rating": 5.0, "text": "You arrive at least 15 min. Hang around with coworkers, chat for a bit, get changed, then start guarding. Rotations are very 15 min. Everyone gets along very easily.", "pros": null, "cons": null, "date_created": "June 27, 2012"},
{"id": "16v17j2haadsgajq", "rating": 3.0, "text": "The work was fairly repetitive however my co-workers were very friendly offering insights and a positive work environment. The position offered me the importance of a structured schedule and accuracy in data entry.", "pros": "introduced me to the payroll department and required tasks", "cons": "repetitive tasks", "date_created": "June 6, 2012"},
{"id": "16u9ub0qn5dogfme", "rating": 5.0, "text": "Tought kids how to skate and play hockey, cleaned up the shack afterwards, shovelled the ice when needed.", "pros": null, "cons": null, "date_created": "May 28, 2012"},
{"id": "16te2bg435dsgcvp", "rating": 3.0, "text": "I worked as a records clerk.We were 6 employees in records office.We were called in boardroom .we got pink slips.It was bad management.very bad timing for me.", "pros": "office environment was good.", "cons": "management was very poor.", "date_created": "May 17, 2012"},
{"id": "16pave7a000006ib", "rating": 5.0, "text": "It was great working for the City of Ottawa as I learned many skills on the job. I focused on collecting beach samples at various beaches across the city for further water testing of e-coli and total coliforms. It was a wonderful summer job experience", "pros": null, "cons": null, "date_created": "March 27, 2012"}
]