[
{"id": "1frg722h7t4tp800", "rating": 5.0, "text": "City of Fredericton as an employer is great to work with. I always learn new things and skills on new projects. I get support from vendors and colleagues there if I get stuck in my project. Manager is very supportive and always encourages you. ", "pros": "If you have a genuine issue, you will get work from home as an exception. Insurance benefits are good, supportive work environment, new learnings on the new projects, team is super helpful.", "cons": "Salary is low and it takes a time to become a permanent employee", "date_created": "February 9, 2022"},
{"id": "1e6hh2omb47rp800", "rating": 4.0, "text": "Supervise lodges and gyms for groups renting. some cleaning is required but you can work on assignments and homework while the group is using the facility.", "pros": null, "cons": null, "date_created": "April 22, 2020"},
{"id": "1e32dik37319o003", "rating": 4.0, "text": "Perfect position for a student living with parents. Minimum wage job but it's hard to beat the camaraderie and environment the position entails. Overall a great experience and met some lifelong friends.", "pros": null, "cons": null, "date_created": "March 10, 2020"},
{"id": "1dj5crd931d0b000", "rating": 4.0, "text": "Working for the city was a mostly positive experience. The only issues I ever experienced were with other employees who didn't seem to care about the job or abused their title/seniority.", "pros": null, "cons": null, "date_created": "August 25, 2019"},
{"id": "1d0q20tt952sv800", "rating": 5.0, "text": "Productive and fun team to work with. Management team is great to work for and genuinely wants to get to know their employees. Great place to begin or continue your career.", "pros": null, "cons": null, "date_created": "January 9, 2019"},
{"id": "1cpsviq1852uf801", "rating": 5.0, "text": "Great place to grow and develop as a young professional; . Very team-oriented culture. Management open and very approachable — both with respect to day-to-day operations and with to long-term growth initiatives. Generous amount of vacation time, extensive health benefits, education support (not formal policy but treated on case-by-case basis)", "pros": null, "cons": null, "date_created": "October 15, 2018"},
{"id": "1cpq5hgsn5neb800", "rating": 5.0, "text": "great people to work with and great work environment and a wonderful experience . i learned a lot a of helpful skills and gained great experience that will help me in the future.", "pros": null, "cons": null, "date_created": "October 14, 2018"},
{"id": "1cj4ropu45j4vcl6", "rating": 4.0, "text": "Although they had their managerial problems, I always enjoyed going in to work for the city of Fredericton. Every day was a positive learning experience.", "pros": null, "cons": null, "date_created": "July 23, 2018"},
{"id": "1c8dk7vcdaqjgbh0", "rating": 5.0, "text": "my time at the guard was great. my employer worked us hard and showed us desipline. we learned how to work as a team and how to stay focued under high presure and stress", "pros": "most days were to hot to do parade", "cons": "you had to stand still for hours at a time", "date_created": "March 12, 2018"},
{"id": "1as7i73ut5n8vef2", "rating": 5.0, "text": "Excellent work experience. Friendly and hardworking staff. The work environment was also a very positive work environment.", "pros": null, "cons": null, "date_created": "September 9, 2016"},
{"id": "18afgm6jib80gdkp", "rating": 5.0, "text": "assist with meter reading, maintenance of various areas throughout the city and help residents.", "pros": null, "cons": null, "date_created": "November 28, 2013"},
{"id": "16r5ufm97adsge9c", "rating": 5.0, "text": "City of Fredericton offers summer positions in many different areas for university students. Work outdoors and meet new people.", "pros": "work outdoors", "cons": "low salary", "date_created": "April 19, 2012"}
]