[
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "4a84e43a4c461a52", "rating": 5.0, "text": "Le travail consiste à faire traverser les enfants 4à5 heiress par jour 5 hours semaine", "pros": "", "cons": "", "date_created": "18 January 2020"},
{"id": "22d1321b23a6fecf", "rating": 4.0, "text": "J'ai travail pour la Ville de Montréal, pendant 32 ans, j'ai fait du service à la clientèle, et du travail de bureau, Fait plusieurs services dont la Sécurité du Revenu, Cours municipal, Ressources humaines et finalement l'évaluation foncière.", "pros": "", "cons": "", "date_created": "12 January 2020"},
{"id": "c2087067815b3ef5", "rating": 4.0, "text": "Travail difficile lors d’intervention, équipe solidaire et plaisante", "pros": "", "cons": "", "date_created": "11 January 2020"},
{"id": "b47794b209c8cb38", "rating": 4.0, "text": "Il y a place à  amélioration  dans la gestion des ressources humaines dans l' attribution d'un poste.", "pros": "", "cons": "", "date_created": "9 January 2020"},
{"id": "83bd460f55da3d4e", "rating": 3.0, "text": "Je recommande la ville de Montréal mais les processus on besoin d'une grande amélioration", "pros": "", "cons": "", "date_created": "23 December 2019"},
{"id": "14073532434e594f", "rating": 4.0, "text": "Beaucoup de potentiel de développement du secteur TI, \nla population vieillissante, réactive et sans initiative.", "pros": "", "cons": "", "date_created": "16 December 2019"},
{"id": "77cd587fd2028e54", "rating": 3.0, "text": "the workplace is fun because of the people you work with. Not because of the gestionnaires. they don't know your tasks and are not thankful of your work.", "pros": "", "cons": "", "date_created": "15 December 2019"},
{"id": "7dfe4a64ce7859b5", "rating": 4.0, "text": "J'étais là pour un stage non rémunéré par la ville", "pros": "", "cons": "", "date_created": "15 November 2019"},
{"id": "439ae4e2cbf9d2ac", "rating": 3.0, "text": "le travail agréable, un bon respect entre les collègues .", "pros": "", "cons": "", "date_created": "15 November 2019"},
{"id": "da1c323e2d96daef", "rating": 4.0, "text": "Un milieu remplit de potentiel, mais confronté à plein d'obstacle des pairs. Des pairs démotivés ou paresseux qui nivelle par le bas tout bon travailleur. Une administration en silo, qui fait que l'aspect théorique perçu par l'administration est  désaxé de l'aspect pratique sur le terrain. Énorme manque de communication et support.", "pros": "", "cons": "", "date_created": "12 November 2019"},
{"id": "d464fb9717b0a65f", "rating": 5.0, "text": "Travailler pour la ville de Montreal est vraiment une expérience qui vaut la peine d'être vécue, c'est travailler dans un milieu palpitant, avec une équipe dévouée et je conseillerais toute personne à la recherche d'emploi, d'une opportunité de carrière dans un environnement qui encourage le travail d'équipe, de faire un tour à la Ville de Montréal et profiter d'une expérience inoubliable.", "pros": "", "cons": "", "date_created": "5 November 2019"},
{"id": "e9fea36f87e65b58", "rating": 3.0, "text": "il y a des hauts des bas mais c'est cool :)\nsalaires est correct.", "pros": "", "cons": "", "date_created": "4 October 2019"},
{"id": "54721f9d8a33d723", "rating": 3.0, "text": "Je n'ai que des bons commentaires au sujet de la Ville de Montréal.", "pros": "", "cons": "", "date_created": "19 September 2019"},
{"id": "9649962ba48b33e2", "rating": 2.0, "text": "Le tout est basé pour la performance sous pression, vous êtes qu'un numéro, facile à remplacer", "pros": "", "cons": "", "date_created": "14 September 2019"},
{"id": "d6cef819701702e9", "rating": 2.0, "text": "To be frank and honest, the city job used to be sought out by many including myself. \nBut once i got in ... the concensus is unanimous ... Poor management has created so much dissension that, what was once considered one big relatively happy family ... is now something like a rivalry amongst peers toppled off by inadequate management both at the blue colors and white colors. Everyday you come in to work to hear complaints, disdain, anger from your fellow peers that even if you do not go through their experience, it will eventually start to wear you down. For what it is worth, it is probably better to apply to an unmerged city sector than applying for the whole of Montreal ... because what is happening right now is scary ... People are outright affraid of their security with good reasons.", "pros": "", "cons": "", "date_created": "9 September 2019"},
{"id": "d3899a8e38a24be8", "rating": 4.0, "text": "Wide variety of tasks. Good teams. Fun coworkers. The salary is good. Don't judge according to what you see on the news, most people like their job and works hard . Some managers are great. The overall experience is awesome.", "pros": "", "cons": "", "date_created": "7 September 2019"},
{"id": "a61c2ec118bcd943", "rating": 3.0, "text": "Égalité d'emploi\nSalaires concurrentiels\nMésententes entre la haute direction et les exécutants finaux", "pros": "", "cons": "", "date_created": "6 September 2019"},
{"id": "bc86b45c0105dc64", "rating": 1.0, "text": "on commence a 6h30 on finit à 16h on peut vous appeler aujourd'hui et vous remercier demain.\non ne peut pas travailler dans cette entreprise si on cherche à travailler toute l'année", "pros": "", "cons": "", "date_created": "2 September 2019"},
{"id": "0bd1b5f0ea14849a", "rating": 5.0, "text": "nice people to work with. it was short term for me as i asient working on a contract. people are friendly. long process before being hired. you have to be very patient.", "pros": "", "cons": "", "date_created": "10 August 2019"},
{"id": "b7cb4fb262af1042", "rating": 5.0, "text": "Being a lifeguard for Ville de Montréal is a good challenge at first for the employment test, but after it is really fun. Majority of lifeguards are enjoyable people.", "pros": "", "cons": "", "date_created": "28 July 2019"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "9a2d50b20d2f5a2c", "rating": 5.0, "text": "I loved my experience working for the city of Montreal as a lifeguard. I had two great summers working on Montreal pools. Was able to make great frienships with other lifeguards. Overall fun times.", "pros": "", "cons": "", "date_created": "2 July 2019"},
{"id": "dd5a1f986937b6b7", "rating": 4.0, "text": "The only reason I do not work there anymore is because I grew tired of the very unmoving nature of things. WIth so much city bureaucracy, it was impossible for me to correctly rely information, suggestions and complaints from city workers and neighborhood residents to the command chain. The reports I filed daily were never read to a point where I stopped doing them and nobody noticed. Easy to say I felt useless and the position was unfulfilling.", "pros": "breaks at my discretion as long as the flow of event remained stable", "cons": "extended periods of time with absolutely nothing to do", "date_created": "14 June 2019"},
{"id": "ace94e11d3d03f3a", "rating": 1.0, "text": "the atmosphere between colleague of montreal-nord is cold and the employer divides the employees to better handle them, there is not really any serious advantage.  if you want to waste your time apply for a white-collar position for this borough.", "pros": "", "cons": "", "date_created": "11 June 2019"},
{"id": "c8d4ef5ec81701ff", "rating": 4.0, "text": "Dynamique, jeune et motivée l'équipe favorise une approche ouverte agnostique de manufacturiers spécifiques et la collaboration entre les diverses agences impliquées", "pros": "", "cons": "", "date_created": "29 May 2019"},
{"id": "576793433d8a46f5", "rating": 5.0, "text": "Belle entreprise, j'ai adorée y travailler. Beaux avantages.", "pros": "", "cons": "", "date_created": "28 May 2019"},
{"id": "348bdebb10e9b13e", "rating": 5.0, "text": "Very bureaucratic. Very exigent but excellent job if you do what you are supposed to do. I was a tennis instructor outdoors and my bosses were comprehensible of the heat and would allow me to lessen the activities in the lessons.", "pros": "syndicate", "cons": "never paid extra", "date_created": "2 May 2019"},
{"id": "45f001078a99ebb5", "rating": 5.0, "text": "Mon expérience à la ville est très agréable je m'entend bien avec tout le monde et je note contrairement à mes autres emplois que les employées de la ville de Montréal offrent  un service à la clientèle exemplaire", "pros": "l'ambiance, le travail...", "cons": "pas beaucoup d'heures disponible", "date_created": "1 May 2019"},
{"id": "11b7487d5c083054", "rating": 2.0, "text": "pas d'avancement quand tu n'es pas permanent  et l'environnement n'est pas sain car tout le monde veut quitter pour l'ambiance alors cela devient une source de stress et de désintéret", "pros": "", "cons": "", "date_created": "23 April 2019"},
{"id": "f5fa31c295a291f4", "rating": 3.0, "text": "Déception années après années. Projets présentés ne prennent pas forme. L'humain est de moins en moins considéré. Sentiment d'appartenance n'y est plus. Aucun accommodement travail/famille. Assurances collectives très dispendieuses pour l'employé.", "pros": "Sécurité d'emploi pour le personnel syndiqué.", "cons": "Cheminement de carrière difficile.", "date_created": "6 April 2019"},
{"id": "f77524f97c675690", "rating": 4.0, "text": "environnement de travail agreable mais sur haute surveillance.", "pros": "travail au plein air", "cons": "travail sous la pluie", "date_created": "25 March 2019"},
{"id": "b43288e4ac97f378", "rating": 3.0, "text": "Il y a une variété de personnes avec qui travailler.", "pros": "Les personnes sont gentilles.", "cons": "Les enfants sont arrogants.", "date_created": "20 March 2019"},
{"id": "ad7e6319486298da", "rating": 5.0, "text": "J'aimais bien pouvoir preparer des activites pour les enfants", "pros": "", "cons": "", "date_created": "18 March 2019"},
{"id": "1600db55db3ef78b", "rating": 4.0, "text": "L'horaire de travail est assez flexible et avantageux. J'ai appris comment bien utiliser un programme sur l'ordinateur. L'aspect difficile était la charge de travail assez considérable et la charge agréable est le climat de mon travail.", "pros": "", "cons": "", "date_created": "12 March 2019"},
{"id": "cfd7be6adaa28ace", "rating": 4.0, "text": "les conditions de travaille sont favorables, le salaire est compétitif.", "pros": "pause suffisante", "cons": "pas d'heures supplementaires", "date_created": "11 February 2019"},
{"id": "1887e76c13df2941", "rating": 4.0, "text": "good place to work , nice people, security job, googd, peolpe, nice management, good ambiance, calm, nice architect,a lot of reunion,multicultural place", "pros": "", "cons": "", "date_created": "9 February 2019"},
{"id": "6d718e37df7ed9b9", "rating": 3.0, "text": "J'ai aimé travaillé pour la ville de MTL mais je veut me rapproché de mon domicile", "pros": "Bonne atmosphère de travail (usine de Pierrefonds", "cons": "Trop loin de mon domicile", "date_created": "25 January 2019"},
{"id": "12c11f595921cf71", "rating": 4.0, "text": "J'ai adoré travaillé à la ville de Montréal, plus précisément à l'arrondissement Mercier-Hochelaga-Maisonneuve", "pros": "dynamisme de l'équipe de direction", "cons": "loin du lieu de résidence", "date_created": "10 January 2019"},
{"id": "cae72c3c67be00ce", "rating": 3.0, "text": "Ce poste était une prison doré, un bon salaire, des bons avantages, bonne condition, mais aucune valorisation du travailleur", "pros": "", "cons": "", "date_created": "9 January 2019"},
{"id": "f3f4da3a9232196e", "rating": 4.0, "text": "Lifeguard duties are pretty stressful as it is, in the neighborhood, I was working we had some of the lowest salaries in the greater Montreal area, it changed a few years ago after I left though. \nManagement has become more strict and it is now harder to enjoy the team as hours have been reduced and lifeguards have been added (some way too young). The chemistry isn't the same as it used to be. \nStill a great starting job for anyone.", "pros": "", "cons": "", "date_created": "29 December 2018"},
{"id": "37faa30a5a4193f4", "rating": 4.0, "text": "Great place to learn about municipal politics with a young dynamic team. Learned how to multitask and work under pressure. A day never looks the same always some new issue popping up.", "pros": "Great team work", "cons": "Long hours under pressure", "date_created": "27 November 2018"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "fe8fadd5fd7e6a09", "rating": 5.0, "text": "Les journées étaient tranquilles en général mais parfois je devais faire face à des situations difficiles et les gérer moi même. Au fil du temps j'ai appris a mieux gérer les situations difficiles et à mieux apprécier mon travail.", "pros": "Travail dehors", "cons": "Mauvaise organisation", "date_created": "26 November 2018"},
{"id": "5b7ac7aef59832a0", "rating": 2.0, "text": "Depuis l'administration de Denis Coderre nous pouvons constater une nette dégradation de nos avantages sociaux et de la possibilité de réellement concrètement concilier travail et vie personnelle.", "pros": "Sécurité d'emploi lorsque nous sommes permanents", "cons": "Conciliation travail et vie personnel", "date_created": "21 November 2018"},
{"id": "7eaf8ee92db9290d", "rating": 3.0, "text": "Good for a stater job as there is no way you can advance.\nAs most jobs with no advancement they tell you to stick with it as it will eventually demonstrate your qualities for upcoming jobs , but it doesn't matter as you are never considered for these.", "pros": "Good for a stater job as there is no way you can advance.", "cons": "no advancement", "date_created": "19 November 2018"},
{"id": "6ab32b002f596a01", "rating": 3.0, "text": "travail d'équipe\ntravail physique\nservice essentielle\nservice travaux publics\nservice sport et loisir \ntravail a l'extérieur", "pros": "mise en forme", "cons": "travail a l extérieur avec les intempéries", "date_created": "7 November 2018"},
{"id": "91176ca9821fd293", "rating": 4.0, "text": "Possibilités de développement et de carriére. Une entreprise qui donne la valeur a son personnel et veuille sur leur épanouissement", "pros": "", "cons": "", "date_created": "7 November 2018"},
{"id": "745d427b46e035bc", "rating": 4.0, "text": "Job étudiante d’été, bonne expérience de travail mais cherche métier plus qualifier !", "pros": "", "cons": "", "date_created": "30 October 2018"},
{"id": "d80cebd367e8007c", "rating": 4.0, "text": "Environnement de travail agréable, comportement organisationnel adéquat", "pros": "Salaire très compétitif", "cons": "", "date_created": "30 October 2018"},
{"id": "b708513914ccd199", "rating": 5.0, "text": "C'est avec eux que je suis présentement. J'ai fait mon stage chez eux et je ne regrette pas mon choix.", "pros": "", "cons": "", "date_created": "25 October 2018"},
{"id": "e1e62d413b2b29b1", "rating": 4.0, "text": "Over the past 30+ years working in almost all facets of Real Estate, I have acquired a unique skill set, wherein I can wear close to a dozen \"hats\" and have always completed the mandates assigned.\nI have worked in that time via Contract, and am now in search of a permanent position where my organizational, logical, creative talents can be best served.", "pros": "", "cons": "", "date_created": "18 October 2018"},
{"id": "6888b18b9cbbd74f", "rating": 5.0, "text": "Environnement motivant, cadre attrayant, très bonne équipe.", "pros": "", "cons": "", "date_created": "13 October 2018"},
{"id": "ec5e8f37ca8fabd2", "rating": 2.0, "text": "la diversité de la clientele et l'horaire flexible.", "pros": "horaire flexible", "cons": "proximité", "date_created": "5 October 2018"},
{"id": "3f203d5b2d246cf9", "rating": 5.0, "text": "Outside work could be anything from cutting grass to walking outside in 40 below weather doing snow removal. fun work place culture. great team and management", "pros": "", "cons": "", "date_created": "26 September 2018"},
{"id": "01cf31eb1a583ceb", "rating": 4.0, "text": "Les responsables étaient vraiment des modèles, de plus l'environment était vriament agréable! La journée se séparait sur des heures de trois heures, ce qui est géniale!\nUne journée typique se décrirait ; Le matin : Assurer un environment sécuritaire pour les enfants et pour le personel. Trouver des jeux, s'assurer que tout est en ordre et que les jeunes se sentent incluent! \nL'après midi : Préparer des collations, prendre les présences et trouver des jeux et ainsi de suite!\nUn avantage vraiment génial, ce sont les horaires flexibles!", "pros": "Heures flexibles", "cons": "", "date_created": "31 August 2018"},
{"id": "5ac3edb6d80aeaec", "rating": 5.0, "text": "Great 31 years we redo it again anytime great people great ambiance met great people in 31 years even met my wife there salary is good and it's not a place that we will drag our tongues on the floor work at our own pace", "pros": "Insurance benefits great salary", "cons": "", "date_created": "29 August 2018"},
{"id": "edad97b18a1fa2c4", "rating": 3.0, "text": "agréable, calme , tranquille, horaire flexible,capacite d,apprendre", "pros": "", "cons": "", "date_created": "25 August 2018"},
{"id": "4f7be0cc1eb48bbb", "rating": 5.0, "text": "J'ai travaillé à la Ville de Montréal comme sauveteur et ce poste comporte de très bonnes conditions et un bon salaire. L'ambiance y est aussi très bonne.", "pros": "Bonne ambiance de travail", "cons": "Horaires avec pauses entre les bains libres", "date_created": "16 August 2018"},
{"id": "69a1137a47e61c34", "rating": 4.0, "text": "Très bon environnement de travail, tres bon salaire", "pros": "travail 36/sem", "cons": "etre auxiliiaire", "date_created": "15 August 2018"},
{"id": "2956789bfa03ce66", "rating": 5.0, "text": "Working with the Ville de Montreal is fun. The workload is not overbearing and the co workers are friendly and helpful. The distribution of work is fair as well as the compensation. I would most definitely do permanent work for them in the future.", "pros": "decent break times", "cons": "waking hours", "date_created": "14 August 2018"},
{"id": "4e71f0a47248d71f", "rating": 4.0, "text": "Une ville ne peut se comparer comme un autre employeur cependant la pluplart des administrant du service sont bien et de bonne personne c est les commandes politique qui rend le processus ardue entre les dirigeant et les executants\nPs : écrit avec un téléphone désolé .", "pros": "Securite d emploi", "cons": "Changement de regime parfois drastique", "date_created": "13 August 2018"},
{"id": "7ae8ec7f7f08655c", "rating": 4.0, "text": "Productive place to work, with specific and organized functions for each worker.  My internship was only two months, but it was very profitable to get the most acknowledge as I could.", "pros": "", "cons": "", "date_created": "9 August 2018"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "dcbd58946572b0ca", "rating": 4.0, "text": "When working in the finances department, it is important to be very attentive as we are registering the payments made by the taxpayer. It is important to give the right information. Precision is a must. There is a nice variety of culture.", "pros": "", "cons": "", "date_created": "27 July 2018"},
{"id": "1def931b5e88c12e", "rating": 4.0, "text": "As a lifeguard, days are definitely not relaxing but the job is stimulating for sure! This job teached me leadership and helped my sef confidence. The management could be better, sometimes decisions are made without the opinion of the employee on the field.", "pros": "", "cons": "", "date_created": "19 July 2018"},
{"id": "05a502a8a91effb5", "rating": 2.0, "text": "Days at work very typical, I have learned really a lot of things, good workplace culture, a lot of employees taking their retirement. French environnement.", "pros": "", "cons": "", "date_created": "16 July 2018"},
{"id": "12b79ae17f8a2f78", "rating": 3.0, "text": "1:Je démarre les équipes a 6:45 et je suis leurs évolution de travaille durant la journée pour planifier le lendemain`.\n2:Le point positif de cet emploie est de retourner l'eaux usées plus pur pour l'environnement\n3:Beaucoup de travaille a faire sur ce plan.\n4:Dans un monde syndical la composition de faire faire le travaille est parfois difficile.\n5:Point positif est que l'ont peut apporté plusieurs commentaires et différent manière de travaillé", "pros": "Beaucoup de vacance", "cons": "assurance", "date_created": "16 July 2018"},
{"id": "2dae314d0be4a4b0", "rating": 2.0, "text": "Mauvaise ambiance de travail. Les gestionnaires et Rh surveillent tt le temps les employés dans le but de faire croire que les fonctionnaires sont des voleurs de temps ... Aucune reconnaissance d’efforts ...mauvaise expérience .... Je préfère avoir moins d’avantage sociaux et plus de respect!", "pros": "La retraite", "cons": "Rh", "date_created": "13 June 2018"},
{"id": "8ac2e96946a734ee", "rating": 4.0, "text": "This is a great place to work. Permanent employes are very cơoperative with consultants. Great place to apply the application joint design approach. Your contributions are appreciated.", "pros": "", "cons": "", "date_created": "5 June 2018"},
{"id": "0733775339517bee", "rating": 4.0, "text": "Ce le même principe de la construction, beaucoup manque de surveillance de côté supérieur mais à la fois beaucoup de responsabilité parce que tu doit te débrouiller tout seul.", "pros": "Bonne finition du travail", "cons": "Manque de ressources", "date_created": "1 June 2018"},
{"id": "87968ce0a0b91cdc", "rating": 5.0, "text": "Belle équipe de travail. Accecible en transport en commun.", "pros": "", "cons": "", "date_created": "26 May 2018"},
{"id": "a211eec17d81ed08", "rating": 1.0, "text": "If you want a family and that is all you want from life, this job is for you as you won't care about your job.\n No challenges, nothing to look forward too, management is just busy covering themselves. Just a bore all and all. Avoid.", "pros": "", "cons": "", "date_created": "23 May 2018"},
{"id": "37c23c4fb2cf6001", "rating": 4.0, "text": "travail physique et de communication,travaux généraux,gazon,asphalte,entretiens de parcs.", "pros": "bon salaire", "cons": "pas de reconnaissance pour le travail accompli", "date_created": "9 May 2018"},
{"id": "05e3c2d9092fe1ba", "rating": 5.0, "text": "il s'agissait de faire des activités avec des jeunes\nrentrer les informations sur simple comptable", "pros": "", "cons": "", "date_created": "7 May 2018"},
{"id": "07d652ea110aa516", "rating": 3.0, "text": "Trop de procédures et lourdeur administratif, les postes temporaires ne sont plus intéressants, il faut faire beaucoup d'efforts pour être reconnue.", "pros": "horaires flexibles en général", "cons": "Lenteur", "date_created": "22 April 2018"},
{"id": "398ec03d0f35bfd1", "rating": 5.0, "text": "J'ai faite du bénévolat. À chaque événement, comme le 100 ans de Montréal-Nord, j'y étais présente. C'est quelque chose de calme.", "pros": "Nourriture gratuite", "cons": "", "date_created": "21 April 2018"},
{"id": "5290338bf19d8172", "rating": 5.0, "text": "Celui qui trouve une place avec la ville, vaut mieux qu'il la garde.", "pros": "heures sup", "cons": "poste sur appel", "date_created": "12 April 2018"},
{"id": "5a0e57394ebf56dd", "rating": 4.0, "text": "Au début, c'était très stimulant: des collègues agréables, une ambiance stimulante, de bons avantages sociaux.\nToutefois, à la longue, j'ai vu que j'avais fait le tour comme secrétaire et je voulais viser plus haut. Hélas, l'organisation ne permet pas cela. En d'autres termes, la Ville n'offre pas à ses éléments de l'interne d'évoluer puisque même avec ma maitrise de l'ÉNAP, il me fallait absolument une expérience de quatre ans.\nC'est triste, car l'organisation devrait, selon moi, accorder la chance à ses éléments de l'interne de cheminer, d'améliorer leur devenir et de viser plus haut !", "pros": "Belle ambiance et bon salaire", "cons": "Pas de possiblité d'avancement sans le nombre d'anées exigé par l'organisation", "date_created": "2 April 2018"},
{"id": "b804aff1037bc8e5", "rating": 3.0, "text": "Bon salaire et horaire de travail. Emplois extérieurs intendants.", "pros": "", "cons": "", "date_created": "11 March 2018"},
{"id": "6c9a81d2446c9581", "rating": 5.0, "text": "Échantillonnage au Palintest, traitement de données, contact avec le citoyen, planification des semaines à venir et distributions équitables des adresses et rendez-vous à tester. Tout cela m'a appris à encrer davantage ma capacité d'adaptation dans une grande équipe ainsi que ma communication entre collègues et citoyens francophones et anglophones.", "pros": "Voitures et essence fournies", "cons": "Tâches monotones", "date_created": "10 March 2018"},
{"id": "126270b36ba5db9a", "rating": 4.0, "text": "jai adoré de travaille a la ville de Montréal ca ma permi d'apprendre  plusieurs métier et d'aimer se que je fais.", "pros": "avancement durant ma carriere.", "cons": "", "date_created": "7 March 2018"},
{"id": "f55c627ccc55d4c9", "rating": 5.0, "text": "L'ingénieur de la ville de Montréal fait face à des défis stimulants.", "pros": "Avantages sociaux, encadrement, structure", "cons": "Lenteur des processus", "date_created": "7 February 2018"},
{"id": "65cfc599d37e978d", "rating": 4.0, "text": "Une journée de travail typique pour moi est une journée qui risque d'être amusante et dynamique. J'ai appris à bien interagir avec les gens dans les bonnes et les mauvaises journées. Travailler dans une culture de travail qui te correspond aide à t'intégrer plus vite.", "pros": "", "cons": "", "date_created": "29 January 2018"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "302e14aefd17348b", "rating": 4.0, "text": "Learned a lot about unionised work environments. I learned a lot about how to interact with technicians which were under my wing for multiple maintenance projects on site. I learned also a lot about the billing process since I was in charge of it when it came to maintenance projects. Managing multiple projects and employees at the same time in a short period of time without any supervision was also a great challenge that I appreciated having to go through.", "pros": "Flexible schedule", "cons": "No partial time job during school.", "date_created": "15 January 2018"},
{"id": "3ba77efba81f2c17", "rating": 4.0, "text": "Gestion du personnel, travail d'équipe , sans du devoir", "pros": "Gratification", "cons": "Stresse", "date_created": "15 January 2018"},
{"id": "0685d8ff8c085e0f", "rating": 4.0, "text": "Surveillant d’installation would have to set up the sports equipment and then watch and manage the athletes play. You are basically a security for anything to go wrong therefore, you can stay in the room you are given but if anything happens you will have to be ready.", "pros": "long hours, can do homework, amazing first job", "cons": "can get boring", "date_created": "9 January 2018"},
{"id": "1e2406984d957ade", "rating": 3.0, "text": "Culture d’entreprise absente sur le plan relation de travail", "pros": "Sécurité d’emplois", "cons": "Relation de travail", "date_created": "4 January 2018"},
{"id": "259ca31e8003b249", "rating": 5.0, "text": "environnement parfait milieu qui donne envie de travailler", "pros": "bonne expérience", "cons": "pas de recrutement", "date_created": "21 December 2017"},
{"id": "c540ad6053ddc398", "rating": 5.0, "text": "Been working there for over a decade! The place is amazing. The schedules are very good and the staff you work with are good people. We serve the citizens of Montreal and make sure that their city remains lovely!", "pros": "Amazing schedules", "cons": "Long hours", "date_created": "3 December 2017"},
{"id": "0968dc498ab4c3f9", "rating": 4.0, "text": "Milieu de travail intéressant où le personnel participe activement à l'élaboration des projets et collabore aux directives de changement permettant une meilleures efficacité organisationnelle.", "pros": "Excellents avantages sociaux, bonne rémunération, autonomie en matière de gestion", "cons": "complexité dans la structure organisationnelle", "date_created": "30 November 2017"},
{"id": "6f27283c1dc8798f", "rating": 4.0, "text": "Environnement ouvert pour modification de projets.\nTravail de route pour 44 bibliothèques a travers la ville de montréal.\nInstallez ,réparez tout équipement informatique ou logiciel et support du personnel pour toute question informatique", "pros": "Ouvert aux suggestions", "cons": "sécurité d'emploi instable pour auxiliaire", "date_created": "21 November 2017"},
{"id": "2dd4066c3cca5040", "rating": 5.0, "text": "Esprit d'équipe, partages d'infos intérêt travail.", "pros": "", "cons": "", "date_created": "3 November 2017"},
{"id": "ba97226383a79b78", "rating": 5.0, "text": "réseaux d'aqueduc spécialisé\nville de montreal et ville de westmount\npour la ville de westmount contremaitre surintendant\ngestion de personnel en aqueduc et deneigement\ngestion de bruit conduite majeurs\ntrès bonne ambiance de travail avec le personnel cadre et col bleu", "pros": "appréciation de mon expérience et de mes connaissance pour la formation", "cons": "du moanque d'expérience de mes coéquipier de travail", "date_created": "30 October 2017"},
{"id": "befc540327125e15", "rating": 5.0, "text": "Travailler à la ville de Montréal nous permet de connaître les différents projets concernant le citoyen.", "pros": "", "cons": "", "date_created": "26 October 2017"},
{"id": "ccdd8d96d4d0d738", "rating": 3.0, "text": "Durant ma carrière, j'ai appris a maitriser ma patience, j'ai appris a être poli et courtois avec les clients, a savoir trouver des solutions pour résoudre leurs problèmes. j'ai sauvé 6 personnes durant ma carrière.", "pros": "bronzage gratuit durant l' été", "cons": "matériaux peu efficaces", "date_created": "13 October 2017"},
{"id": "250c26bb8ec2ca9c", "rating": 4.0, "text": "J'ai aimé travaillé pour la ville, bons salaires .", "pros": "Repas gratuits", "cons": "Courte pause", "date_created": "5 October 2017"},
{"id": "e30f1edbf1fdad80", "rating": 5.0, "text": "très bon environnement de travail je recommande a tous le monde", "pros": "", "cons": "", "date_created": "31 August 2017"},
{"id": "ca564381aa7cc31d", "rating": 5.0, "text": "J'ai beaucoup aimé la diversité de mon travail.  Les domaines des ressources humaines, financières et matérielles étaient très intéressants et non monotones.", "pros": "", "cons": "", "date_created": "23 August 2017"},
{"id": "56818071a706daa3", "rating": 4.0, "text": "Ce fut une très belle experience. Il y a une vraiment bonne ambience entre collègues.", "pros": "", "cons": "", "date_created": "21 August 2017"},
{"id": "a020e81e0dbef342", "rating": 4.0, "text": "À l'écocentre, les journées sont obligatoirement de 9 heures (horaire de 8h à 18h) donc elles prennent beaucoup d'énergie. De plus, le soleil est constamment sur les employés puisqu'il n'y a rien pour les protéger. Sans oublier la poussière de certains matériaux de constructions qui sont désagréables. Tout de même, on s'habitue comme on le peut, le travail nous permet de développer un bon service à la clientèle. Le management n'est pas le meilleur: la raison de mon départ est à cause d'un non-respect de mes disponibilités.", "pros": "", "cons": "", "date_created": "18 August 2017"},
{"id": "bdcaaafaa8eb609b", "rating": 1.0, "text": "J'ai appris comment encoder et pucer les livres et tout les autres supports( vidéo, disque optique). Il y'avait une très grande coordination entre moi et mes collaborateurs.\nl'aspect le plus agréable dans mon travail, c'était les déplacement que je fis chaque jour dans différentes bibliothèques.Aussi, toute les personnes agréables que je rencontre.", "pros": "l'ambiance de travaille", "cons": "temps passe vite", "date_created": "8 August 2017"},
{"id": "621b8c33ba6ae159", "rating": 4.0, "text": "Une journée de travail typique est de 7h30 à 17h. J'ai appris à travailler en équipe.", "pros": "Carte opus gratuité", "cons": "Courte pause", "date_created": "4 August 2017"},
{"id": "b1d26325929b2a1a", "rating": 4.0, "text": "Surveiller des installations et prodiguer les premiers soins en cas de besoins.", "pros": "Avantage sociaux", "cons": "Aucune pause", "date_created": "26 July 2017"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "3efcc13d3b75a6ec", "rating": 4.0, "text": "Because I was on a contract, it was difficult to integrate fully the city culture in just one year.  \nThe people I worked with have been working for the City of Montreal for a very long time, and reaching their level of knowledge of the City took some effort since municipal operations are very complex. \nIt was a great experience and I would definitely recommend working for the City of Montreal.", "pros": "benefits", "cons": "n/a", "date_created": "22 July 2017"},
{"id": "ce299af89020054e", "rating": 2.0, "text": "Manque flagrant de communication, hélàs, mais heureusement il y a la sécurité d'emploi.", "pros": "les avantages sociaux", "cons": "La politique", "date_created": "11 July 2017"},
{"id": "a6c8bacae78c4303", "rating": 4.0, "text": "J aime bcp  mon travail , des patrons comprehensif j aime me surpasser travailler avec les autres aider et encourager etre un leader.", "pros": "Le travail est securitaire", "cons": "Certains collegue trop negatif", "date_created": "2 July 2017"},
{"id": "ffcaa21b20ceb28f", "rating": 1.0, "text": "Bon emploi étudiant mais aucun avenir dans le domane horaire tres instable et salaire très bas", "pros": "", "cons": "", "date_created": "23 June 2017"},
{"id": "bab869629597e60d", "rating": 5.0, "text": "La ville de montreal est très bien structuré et efficace.On ce doit de produire et respecte le délai des travaux.Normalement on travail fort et en équipe.", "pros": "Bon salaire et horaire de 3 jours ou 4 selon ton poste", "cons": "Pour ce qui est de moi j en trouve pas", "date_created": "20 June 2017"},
{"id": "d172bf52426c9a65", "rating": 5.0, "text": "\tAccueil des clients, réception et traitement des paiements, mise à jour de dossiers, classement des dossiers, courrier, photocopie, production de documents, utilisation d'un logiciel de traitement de texte.", "pros": "Environnement agréable, climat positif, des colegues très polis, conditions de travail très bonnes", "cons": "", "date_created": "18 June 2017"},
{"id": "6754d15039f6fbab", "rating": 3.0, "text": "The hardest part of the job was the early shift, starting at 6:30 AM is hard to get used to, but you get used to it. The enjoyable part of the job is to be able to spend the day outside, specially when its sunny.", "pros": "", "cons": "", "date_created": "29 May 2017"},
{"id": "8b1189b136e1ce31", "rating": 4.0, "text": "Retraitée depuis 18 mois j'ai adoré mon boulot et ce, jusqu'à la dernière journée.  Je suis définitivement à ma place au service à la clientèle.", "pros": "bon salaire", "cons": "conciliation travail-famille quasi inexistante", "date_created": "29 May 2017"},
{"id": "349fba9a0b458629", "rating": 5.0, "text": "Tons of benefits\nGreat work place\nCo-workers can be difficult at times but most of the time very pleasant to work with. \nManagement is very understanding of almost most sitatuations", "pros": "special events which are interesting", "cons": "Hours cut in the summer", "date_created": "27 April 2017"},
{"id": "bd4fab8a861fa535", "rating": 4.0, "text": "Dans cet emploi j'ai apprécié le travail d'équipe et le sens de la responsabilité de tout le monde.", "pros": "travail intéressant", "cons": "difficulté d'obtenir la permanence", "date_created": "11 April 2017"},
{"id": "7802843dd80da342", "rating": 5.0, "text": "voir a faire effectuez le travail par des employés \nen contrôlé la qualité  \nvoir a la discipline \nvoir au budget alloué \nfaire rapport a mes supérieurs", "pros": "", "cons": "", "date_created": "7 April 2017"},
{"id": "df73755a4269700d", "rating": 5.0, "text": "Je trouve l'emploi à la  Vile de Montréal tres interessant", "pros": "", "cons": "", "date_created": "20 March 2017"},
{"id": "0c1783295feea6bb", "rating": 4.0, "text": "J'ai adoré travailler pour la ville de Montréal . Chaque journée était différente. J'ai appris plein de trucs qui me sont utile aujourd'hui. Malheureusement je n'était pas permanent et à l'époque les contrats se faisaient rare et j'ai perdu mon  matricule étant donné que je travaillais ailleurs quand la Ville ne m'appellait pas et je pouvais pas toujours dire oui pour rentrer une semaine pour après ne plus avoir d'emploi.", "pros": "", "cons": "", "date_created": "9 March 2017"},
{"id": "0c36730ac083a7c9", "rating": 4.0, "text": "A big shop well organised and full of mechanics, welders and many others. Spent time repairing garbage trucks and snow shovels. I also built things like park tables and signposts. Overall a great place with free equipment such as gloves and glasses.", "pros": "Free friday", "cons": "Long hours", "date_created": "8 March 2017"},
{"id": "32d69b85ecac2a73", "rating": 3.0, "text": "État dépressif chez plusieurs employés.\nDécoration terne.", "pros": "Salaire, assurances, expérience", "cons": "Poste précaire, travail solitaire", "date_created": "26 February 2017"},
{"id": "cb431d48651f03a3", "rating": 5.0, "text": "Classifier les dossiers;\nPréparer une liste sur Excel des factures du transport en ambulance depuis 2013 jusqu'au 2016 alors je les ai triées par année et chaque année par ordre alphabétique ( c'était pas demandé, mais j'aime rendre un travail bien présenté);\nVérifier les rendez-vous des médecins et corriger s'il y a des erreurs;\nChercher des dossiers dans la voute;\nFaire la mise en page d'un document;\nTrier les pré-emplois.\nLe travail se déroulait dans une très bonne atmosphère. Toute l'équipe était serviable. En générale, c'était une très belle expérience.", "pros": "", "cons": "", "date_created": "20 February 2017"},
{"id": "e9671ec97d6d6c55", "rating": 5.0, "text": "J' ai pu approfondir mes connaissances théoriques et pratiques acquises â l' école", "pros": "", "cons": "", "date_created": "17 February 2017"},
{"id": "16a534593e632df1", "rating": 5.0, "text": "Avantages sociaux impressionnant.  Faut être solide pour évoluer dans un environnement fortement syndiqués.", "pros": "bon salaire", "cons": "convention de travail blindé", "date_created": "16 February 2017"},
{"id": "fc31cc3c3b749ad2", "rating": 4.0, "text": "Environnement agréable mais pas sécuritaire côté stabilité", "pros": "", "cons": "", "date_created": "8 February 2017"},
{"id": "0281a0da4b21b1ae", "rating": 4.0, "text": "Travail intéressant plusieurs relations entre les différents départements.", "pros": "souplesse des horaires", "cons": "Quelques longueurs dans la gestion des dossiers", "date_created": "7 February 2017"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "73bc066e17ee0755", "rating": 5.0, "text": "Travailler au sein d'une équipe diversifié professionnellement.\nLes tâches sont claires et précises.\nLe climats de travail est bien les gens sont souriant.\nLa communication au sein des équipes est A1 .", "pros": "Environnement de travail", "cons": "J'en suis à ma 3e année sur appel, un poste permanent à la ville c'est rare..", "date_created": "31 January 2017"},
{"id": "316d77c519fcc2f0", "rating": 5.0, "text": "Bonne expérience. Les membres de l'organisation sont accueillants. J'ai aimé les responsabilités qui m'étaient données et les tâches que je devais accomplir.", "pros": "", "cons": "", "date_created": "30 January 2017"},
{"id": "fc67c3848245f93e", "rating": 5.0, "text": "Très enrichissante expérience :\nTravailler dans la culture et dans le secteur touristique présente des défis gratifiants.", "pros": "Secteur enrichissant", "cons": "Administration lourde", "date_created": "5 January 2017"},
{"id": "68eba8f490ed6a16", "rating": 3.0, "text": "Mon metier m a permis ;\nEtre un leader \nUn rassembleur ( qui est un must ) \nUn technicien \nUn gars ponctuel et un enseignant pour les jeunes pompiers.", "pros": "Etre polyvalent ( tout faire)", "cons": "l horaire", "date_created": "13 December 2016"},
{"id": "b154d45bac1c42bb", "rating": 3.0, "text": "ceci est un travail étudiant qui est peu motivant. Une bonne façon d'obtenir des revenues durant les études et il est très facile de conjuguer étude travail. Cependant, ce n'est pas un travail qui permet l'évolution professionnel ou personnelle.", "pros": "", "cons": "", "date_created": "29 November 2016"},
{"id": "bde02085f00dc3f9", "rating": 5.0, "text": "Environnement de travail super agréable et conviviale avec les collègues y compris les gestionnaires", "pros": "Stationnement gratuit", "cons": "Aucun", "date_created": "28 November 2016"},
{"id": "182dd69834052d62", "rating": 4.0, "text": "Je travaille saisonnier. Je ne suis pas assuré pour le reste de l'année", "pros": "", "cons": "", "date_created": "16 November 2016"},
{"id": "e3e89fb32a5729cf", "rating": 4.0, "text": "Travail très physique être en forme être capable de travailler en équipe aimer travailler à l extérieur avec toute nos conditions aux Québec être polyvalent", "pros": "Avantages sociaux fonds de pensions", "cons": "Très long avant d être permanent", "date_created": "8 November 2016"},
{"id": "999c3cb23c4b7ce0", "rating": 5.0, "text": "Beaucoup apprécié mon séjour de 4 ans et demi à la Ville de Montréal!", "pros": "", "cons": "", "date_created": "8 November 2016"},
{"id": "5d16cb3edad75448", "rating": 5.0, "text": "opérateur équipement lourd chargeur sur roues opérateur de tracteur trottoire et camion 10 roues et 12 roues 28 ans d'expérience sur le déniegement", "pros": "", "cons": "", "date_created": "25 October 2016"},
{"id": "7ab95986a4e8a4c2", "rating": 5.0, "text": "Un travail plein de défis. Une expérience enrichissante. Un environnement de travail agréable.", "pros": "", "cons": "", "date_created": "30 September 2016"},
{"id": "5c801af3e5a93fd0", "rating": 5.0, "text": "•\tServed the neighborhoods of L'île-Bizard and Sainte-Geneviève, Qc\n•\tCustomer service and reception responsibilities\n•\tDrafting correspondence \n•\tCompleting data entry ensuring all information is entered into the appropriate system in a timely manner\n•\tMailroom duties including distribution of mail throughout the office\n•\tOrdering office supplies and ensuring that items arrive on time and as specified\n•\tUndertaking cash handling duties including accepting payment for fines and municipal taxes and ensuring till balance at end of day", "pros": "", "cons": "", "date_created": "29 September 2016"},
{"id": "2dedd0a52ba79a7c", "rating": 5.0, "text": "maintenir les cartier du centre ville propre communication avec client", "pros": "environnement propre", "cons": "", "date_created": "8 September 2016"},
{"id": "04e8b700e9c1c18f", "rating": 5.0, "text": "Nous travaillons de longue journée ou très tard la nuit. L'organisation est excellente. Les horaire son fixe.", "pros": "Emploi social", "cons": "Pas de pause", "date_created": "29 August 2016"},
{"id": "41655f60fce55335", "rating": 5.0, "text": "Très bon employeur et bons avantages sociaux en plus d'avoir d'avoir un fond de retraite!!", "pros": "Avantages sociaux", "cons": "Aucun", "date_created": "20 August 2016"},
{"id": "8d45d0c601b6790c", "rating": 3.0, "text": "Horaires très atypiques, sécurité d'emploi inexistante, bon salaire, bon milieu, avantages sociaux intéressants", "pros": "", "cons": "", "date_created": "12 July 2016"},
{"id": "6594fd9135d2f771", "rating": 4.0, "text": "J'adore le travail que j'occupe, c'est un lieu sécuritaire, un équipe qui s'entraide, mais le travail tel que l'est est stressante, car on fait affaire avec des clients qui juge qu'il paie trop de taxe pour le service qu'il reçoit.", "pros": "Travailler avec un equipe formidable", "cons": "Recevoir des betises du contribuable concernant ces taxes", "date_created": "4 July 2016"},
{"id": "03ba3b95f0bea19e", "rating": 2.0, "text": "une entreprise qui empeche tout meilleure entente\nmanque de respect généralisé", "pros": "salaire", "cons": "tout", "date_created": "12 June 2016"},
{"id": "3026610909de8ecd", "rating": 3.0, "text": "- Cirer et récurer des planchers\n- S'assurer que l'endroit de travail soit propre\n- S'assurer de respecter les consignes soumises par le ou la supérieur(e).\n- Rendre une salle de bain utilisable\n- Laver des tapis", "pros": "", "cons": "", "date_created": "31 May 2016"},
{"id": "67f01d39623ea789", "rating": 5.0, "text": "Travail enrichissant\nChaque journée est différente\nNotre avis est pris en compte\nJ'ai appris à gérer du personnel\nDévelopper des relations avec la police et les pompiers\nTravailler dans un parc est très agréable\nGérer les crises est le plus difficile", "pros": "Travailler dans un parc", "cons": "Gérer des crises", "date_created": "30 May 2016"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "0c3915b9b92a4652", "rating": 4.0, "text": "Environnement de travail dynamique et motivant.\nBonnes conditions de travail.\nManque un peu de flexibilité", "pros": "", "cons": "", "date_created": "30 May 2016"},
{"id": "2d259e59d770b279", "rating": 4.0, "text": "Il est important de savoir se débrouillé et de respecté les citoyens de la ville.", "pros": "", "cons": "", "date_created": "16 May 2016"},
{"id": "15a87766296d66c2", "rating": 4.0, "text": "I liked how the managers were organised and their expectation were clear. They are very nice too. \nI loved working with the people in the parc.", "pros": "", "cons": "", "date_created": "8 May 2016"},
{"id": "2117dc269dbcadf8", "rating": 3.0, "text": "Les restructurations sont dure mais les avantages sociaux sont bons. Je quitte la Ville pour des raisons personnelles et non pour le travail en soi.", "pros": "Avantages sociaux", "cons": "Niveau hyérarchiques trop élevés", "date_created": "6 May 2016"},
{"id": "111a60d33998f631", "rating": 5.0, "text": "C'est un emploi saisonnier, quant il y a des tempêtes de neige, je pars avec le remorqueur attitré pour pouvoir aviser en flutant dans des rues stratégiques ou il y aura de contraventions à mettre si les gens ne se déplace pas pour l'heure indiquée et seront relocalisés dans une autre rue qui n'est pas en déneigement.", "pros": "autonome", "cons": "aucun", "date_created": "4 May 2016"},
{"id": "0b33a9a2369b1bab", "rating": 4.0, "text": "Journée de 730 a 1700\nFormations nécessaire données\nIndépendance\nManque d'encadrement au début", "pros": "", "cons": "", "date_created": "2 May 2016"},
{"id": "58f9327743b0d692", "rating": 4.0, "text": "C'est un emploi d'été idéal. On passes ses journées à l'extérieur avec  des équipes dynamiques et efficaces. Cependant, les journées de travail peuvent être très longues.", "pros": "Très bon salaire", "cons": "Très longues journées de travail", "date_created": "12 April 2016"},
{"id": "fa7e6f7a1b34e2fc", "rating": 4.0, "text": "Management parfait.\nCollaborateurs très coopératifs.\nPleine compréhension des traitements de la Cour Municipale.\nSuivi hebdomadaire des projets au moyen de réunions périodiques qui apportent un plus.\nUne fois les objectifs connus le travail a été relativement facile étant donné mon expérience.\nLes délais ont toujours été respectés, c'est la chose la plus agréable puisqu'elle donne satisfaction à tout le monde.", "pros": "Nombreux projets.", "cons": "Parfois contraintes budgétaires.", "date_created": "6 April 2016"},
{"id": "642a4c4ba119fd09", "rating": 5.0, "text": "Environnement de travail propisce aux défis et à l'apprentissage", "pros": "salaire concurrentiel, avantages sociaux, apprentissage, formation", "cons": "flexibilité d'horaire", "date_created": "1 April 2016"},
{"id": "c5eee00667da1946", "rating": 4.0, "text": "Dynamic and friendly people\nWork flexibility\nGood benefits\nChallenging environment\nLearning something new every day\nFast paced", "pros": "", "cons": "", "date_created": "25 March 2016"},
{"id": "24e2e8d71847e115", "rating": 5.0, "text": "Excellent stage que j'ai réalisé chez la Ville de Montréal, l'ambiance est excellent et le respect est toujours sur place.", "pros": "Respect, l'ambiance, etc", "cons": "Création profil informatique c'est tardative, la premier paye a toujours un gros délai.", "date_created": "23 March 2016"},
{"id": "2bad2f36600176bf", "rating": 5.0, "text": "management very smart, very organized, strong work team, very job structured, environment corporative, feel vwery well the environment,", "pros": "", "cons": "", "date_created": "23 March 2016"},
{"id": "694d7b90bca012b2", "rating": 3.0, "text": "Travail d'équipe en petit group entre 5 et 8 personnes.\nUne journée typique est d'analyser et de numériser des données par ordinateurs. \nHoraire flexible et supervision de travail à la semaine.", "pros": "", "cons": "", "date_created": "23 March 2016"},
{"id": "5f9ffe63eeeda70f", "rating": 4.0, "text": "Dans le cadre de mon emploi, j'ai pu me réaliser à plusieurs niveaux", "pros": "", "cons": "", "date_created": "17 March 2016"},
{"id": "578d0d4fa7c0e30d", "rating": 4.0, "text": "Journée de travail très diversifiée. Servir un cadre et plusieurs professionnels et m'assurer qu'ils soient tous satisfaits de la qualité de mon travail. L'aspect le plus difficile était le manque de confiance de ma supérieure immédiate. J'ai appris plusieurs choses dans le domaine de la culture artistique.", "pros": "Énormément d'avantage sociaux", "cons": "Manque d'esprit d'équipe de certaines collègues", "date_created": "15 March 2016"},
{"id": "be5d2dcd525a49ad", "rating": 4.0, "text": "cétait un super travail d'été rien de bien difficile on fessait du menage mais ca ma apris a etre débrouillarde car javais 3 grosses roulotte a ma charge", "pros": "", "cons": "", "date_created": "13 March 2016"},
{"id": "eabf4ced758af679", "rating": 5.0, "text": "Bonnes assurances employés, principe de congé mobile, principe d'une banque de journées de maladie, équité d'emploi.", "pros": "", "cons": "", "date_created": "11 March 2016"},
{"id": "2cf2ebd42eb52d8e", "rating": 4.0, "text": "Environnement de travail agréable\nSécurité de l'emploi et évolution de carrière intéressante", "pros": "", "cons": "", "date_created": "8 March 2016"},
{"id": "a8cbf65b5e1117ee", "rating": 5.0, "text": "Les emploies a montréal ne sont pas difficile, les gérants sont très respectueux.", "pros": "", "cons": "", "date_created": "29 January 2016"},
{"id": "d3ac6c5e1b51f0a4", "rating": 4.0, "text": "nous avons bien appris\ntrès bon employeur\nune bonne ambiance\npas beaucoup de difficultés  \ntrès agréable", "pros": "dans l'ensemble c'est bon", "cons": "tres limité", "date_created": "27 January 2016"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "42fe7ed9f23f6a36", "rating": 5.0, "text": "Rien n'est difficile quand on travail en groupe, tous le personnel s'entre aide, les jours de travail ce passe sans aucun stress.", "pros": "pas de stress", "cons": "", "date_created": "13 January 2016"},
{"id": "32226640cbb02bca", "rating": 3.0, "text": "Mon travail avec la Ville de Montréal était saisonnier. Mais tout ce que je peux dire est j'avais une bonne relation avec ma supérieure immédiate. Étant donné qu'on était sur la route pour toute la durée du quart de travail, le climat de travail n'était aussi signifiant. Mais entre employés, il y avait une bonne relation de travail.", "pros": "", "cons": "", "date_created": "12 January 2016"},
{"id": "0dfc7a1ea19ff110", "rating": 3.0, "text": "-Les ''heures de travail'' sont sous contrat avec des heures fixes\n-Impossible d'accommoder les étudiants, les étudiant s'accommodent aux heures\n-Peu passer de 0h/Semaines à 30h/semaines avec disponibilités\n-Boss très peu présent pour les employés\n+Congés mobiles payés\n+Congé de maladie payés\n+Heures certaines lorsque non étudiant", "pros": "", "cons": "", "date_created": "10 December 2015"},
{"id": "e79930f8cea0f076", "rating": 5.0, "text": "Une journée de travail comme préposé au remorquage, demande d'être organisé, rapide et efficace car j'ai le devoir d'émettre les contraventions aux voitures qui sont mal stationnées lors du déneigement. Il faut que je sois rapide pour permettre au remorqueur de déplacer les voitures pour ne pas faire attendre les camions de chargement. L'aspect le plus difficile de ce poste c'est la réaction des personnes en colères. Je dois garder mon calme pour que la situation ne se dégénère pas.", "pros": "", "cons": "", "date_created": "9 December 2015"},
{"id": "a66a8b5d47e4fa00", "rating": 5.0, "text": "En général, j'ai apprécié les équipes à la Ville de Montréal et l'ambiance de travail est assez agréable en règle générale.", "pros": "", "cons": "", "date_created": "7 December 2015"},
{"id": "30342eca5354703a", "rating": 5.0, "text": "Ce levé très tôt le matin pour récolter des légumes.\nLe travail d'equipe est le plus important dans cet entreprise.\nLes collegues de travail.\nToujours être penché dans les champs pour recolté les légumes.\nLe melange de plein air et interieur.", "pros": "", "cons": "", "date_created": "4 December 2015"},
{"id": "77fc3ca31414389d", "rating": 1.0, "text": "Doit appeler toutes les semaines pour connaitre mon horaire de travail,malgré 5 ans au mëme poste.", "pros": "Bon salaire", "cons": "Aucun supports et aucun suivi", "date_created": "1 December 2015"},
{"id": "b39ded529c91aa58", "rating": 5.0, "text": "Travailler a la ville de Montréal est très  intéressant .\n- offrir un service de qualité de la  sécurité routière a nos  enfants  proche des écoles primaires", "pros": "travail dans un milieu scolaire proche des enfants qui ont besoin un service de sécurité routière", "cons": "travailler a temps partiel", "date_created": "26 November 2015"},
{"id": "cce9eccc8f7e471e", "rating": 4.0, "text": "le service de l'eau est présentement en restructuration et il y a d'énorme défit a relever et je suis fier d'y travailler seulement mon nouveau poste demande une disponibilité que je ne peut offrir.", "pros": "grand défit stimulant a relever", "cons": "les postes de cadre sont en mouvement présentement", "date_created": "20 November 2015"},
{"id": "5fc71f7fb3a984be", "rating": 5.0, "text": "Se fût une expérience enrichissante. J'ai eu à côtoyer des gens très ouverts d'esprits et très dynamique", "pros": "", "cons": "", "date_created": "18 November 2015"},
{"id": "ea4daae3a08120e7", "rating": 4.0, "text": "Le poste que j'occupe est très intéressant, il permet de connaitre de domaine aquatique, de travailler avec de nombreux partenaires. \nNous devons s'assurer un offrir un service de qualité dans l'optique que chaque client qui viendront dans nos installations auront une période d'amusement en toute sécurité que ce soit pour faire de la natation, de la nage de compétition, de la nage en famille.", "pros": "", "cons": "", "date_created": "11 November 2015"},
{"id": "dc7fcce77d36cde6", "rating": 5.0, "text": "Ensure that they put you in a task that you will enjoy and youll be happy it is repetitive but the hours are nice the pay is weekly and the vacation process is smooth", "pros": "", "cons": "", "date_created": "8 November 2015"},
{"id": "5d777b6c14d0582e", "rating": 5.0, "text": "Très bon environnement de travail. C'est un emploi qui se base sur le travail en équipe et le leadership. Il sollicite également une certaine autonomie et une capacité à travailler de façon autonome.", "pros": "", "cons": "", "date_created": "6 November 2015"},
{"id": "1f198e487be6cd4f", "rating": 4.0, "text": "Qualified as a professional, flexible work hours are the norm. Work environment with a manager that leaves you to do your work without micromanaging.", "pros": "", "cons": "", "date_created": "12 October 2015"},
{"id": "1045b801b7c1378c", "rating": 4.0, "text": "Il y avait un bel esprit d'équipe entre les employés. L'aspect le plus difficile était le stress à tous les jours. L'aspect le plus agréable de mon poste était un travail diversifié.", "pros": "De bons collègues de travail", "cons": "Le stress", "date_created": "29 September 2015"},
{"id": "468eed5556da0160", "rating": 4.0, "text": "Être animatrice de camp de jour pour la ville apporte plusieurs avantages, tel que avoir 35 heures semaines, ambiance de travail très agréable et tout pleins d'avantages comme stage et etc.", "pros": "Horaire respecté, avantages sociaux", "cons": "", "date_created": "21 September 2015"},
{"id": "62fee5d222d0ea39", "rating": 4.0, "text": "Nous avons un environnement de travail très agréable.  Avec beaucoup de travail d'équipe.", "pros": "", "cons": "", "date_created": "21 September 2015"},
{"id": "4049bcd3bcee74d8", "rating": 5.0, "text": "milieu de travaille très stimulant, vécu des expériences enrichissantes, rencontre de personnes ayant une renommés nationales et internationnales. Je garde de très très beaux souvenirs de cette étape de ma vie", "pros": "beaucoup de place pour les initiatives", "cons": "aucun", "date_created": "19 September 2015"},
{"id": "c1eb6a8b7e460b68", "rating": 5.0, "text": "Les personnes étaient particulièrement souriantes et accueillantes. Il n'y avait pas de pression au travail mais plutôt une grande autonomie qui démontrait la confiance qui nous était donnée en tant qu'employés.", "pros": "", "cons": "", "date_created": "16 September 2015"},
{"id": "715f0d884c62aeaf", "rating": 4.0, "text": "Meeting new people with different cultures makes you more flexible.\nVery nice work schedule, can be flexible sometime.", "pros": "", "cons": "", "date_created": "15 September 2015"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "3ec9bad7364b760e", "rating": 5.0, "text": "Je trouve que cet emploi nous amène chaque jour a essayer de nouvel chose", "pros": "", "cons": "", "date_created": "11 September 2015"},
{"id": "abe55ed9c2996519", "rating": 4.0, "text": "employé auxiliaire, donc aucune sécurité d'emploi, toujours sur contrat et peu de possibilité de permanence", "pros": "", "cons": "", "date_created": "27 August 2015"},
{"id": "3a49fbb589776f35", "rating": 4.0, "text": "Journée typique :\n- préparation des dossiers,\n- préparation des grilles d'entrevues,\n- accueil des gestionnaires-clients\n- formation des différents comités évaluateurs\n- évaluation des différents candidats\n- débriefing, après chaque entrevue, avec les membres du comité évaluateur\n- documentation du dossier du candidat quant à son évaluation\n- conseiller le gestionnaire-client quant au choix approprié du candidat\n- retour aux candidats sur leur performance en entrevue (points négatifs et positifs)\n- confirmation de réussite ou d'échec aux candidats\nLes opportunités de développement sont grands à la Ville de Montréal. Il n'en tient qu'à la personne de tracer son chemin en prenant les dispositions appropriées.\nL'aspect le plus agréable était le contact avec les différents collaborateurs et clients.\nL'aspect le moins agréable était la rétroaction sur entrevue lorsque le candidat contestait la décision du comité évaluateur.", "pros": "C'est une grande entreprise qui permet de belles opportunités de développement.", "cons": "Il n'y a pas vraiment de points négatifs.", "date_created": "19 August 2015"},
{"id": "4cea04a1c10033c1", "rating": 5.0, "text": "-Travail très agréable avec un lien assez proche avec la population.\n-Le temps au travail passe assez vite et l'équipe de gestion du secteur est très bien organisé\n-L'aspect le plus difficle du poste est l'organisation des dossiers puisque le poste est relativement récent sur le Plateau Mont-Royal\n-L'aspect le plus agréable est que je suis libre et je gère ma productivité et mes dossiers moi-même.", "pros": "", "cons": "", "date_created": "18 July 2015"},
{"id": "090d50e567905ce4", "rating": 4.0, "text": "Over all good place.  Needs a better job security and permanent placements.  Friendly co-workers.  No stress, good team work.", "pros": "", "cons": "", "date_created": "22 June 2015"},
{"id": "d5051aaf3a16e9f4", "rating": 4.0, "text": "Étant donné que je voulais toujours travailler en génie routier, cet emploi à la Ville m'avait permis de mettre en pratique les notions acquises dans le cadre d'un cours en entretien routier. Ce fut une bonne expérience.", "pros": "Expérience en entretien routier", "cons": "Trop court", "date_created": "11 June 2015"},
{"id": "62bf0e5db1d13729", "rating": 5.0, "text": "c est un travail tres valorisant \nla securite est tres importante et les parents apprecie beaucoup \nmon travail ainsi que les policiers \net la seule parties desagreable et hors de mon controle \nc est la temperature souvent excecrable", "pros": "pouvoir securiser la traverse", "cons": "temperature", "date_created": "22 May 2015"},
{"id": "a3193bf52edd697d", "rating": 4.0, "text": "L'environnement de travail offre une facilité de concentration et nous avons à notre disposition les outils nécessaires pour bien accomplir notre travail.", "pros": "accommodement des heures de repas", "cons": "", "date_created": "15 May 2015"},
{"id": "cd9036d3f889359f", "rating": 4.0, "text": "La Ville de Montréal est une organisation riche en expertise, ressources et possibilités. Certes un peu lourde comme organisation administrative, elle n'en demeure pas moins capable de réaliser de grands et magnifiques projets, même en de courts délais. \nJ'ai eu la chance de réaliser plusieurs mandats dans différents domaines, d'occuper plusieurs postes enrichissants à souhait et de côtoyer des professionnels passionnés en leur domaine. Imagninez 27 000 employés et des centaines de champs de compétences pour permettre le fonctionnement et le développement d'une grande ville. Un monde du travail diversifié et aux mille possibilités, voilà qui représente très bien ce milieu de travail.\nAu cours de ma carrière j'ai pu être inspiré par de grands leaders qui sont encore une source de référence et des modèles pour moi, même après mon départ et le leur. \nMon développement professionnel en évènementiel, en culture, en sport et en loisir au sein de la Ville de Montréal me sert encore et me motive toujours pour les prochains défis que la vie me réserve.", "pros": "Tout y est possible.", "cons": "Tout peut y être plus difficile.", "date_created": "7 May 2015"},
{"id": "16fa80d6985dfe53", "rating": 5.0, "text": "my first job where i learn how to work in a team. i also had to take care of an inventory for the first time. i really enjoy working there with a really good team.", "pros": "", "cons": "", "date_created": "5 May 2015"},
{"id": "8cef8742caa36332", "rating": 5.0, "text": "horaire flexible\nTravail valorisant\nGestionnaire compétant.", "pros": "", "cons": "", "date_created": "1 May 2015"},
{"id": "1234a785230edcfa", "rating": 5.0, "text": "Travail principalement fait au téléphone afin de trouver des fournisseurs externe.", "pros": "", "cons": "", "date_created": "26 April 2015"},
{"id": "2def961bd76dfc70", "rating": 5.0, "text": "Cette expérience fut très enrichissante, me permettant de d'agrandir mon champ de compétences en comptabilité et administration à l'aide de tâche utile et pratique. \nCe stage d'observation s'est avéré très complet.", "pros": "Personnel facile d'accès et aidant", "cons": "", "date_created": "12 April 2015"},
{"id": "8304439177fa1640", "rating": 4.0, "text": "-J'apprécie le dynamisme et l'esprit d'équipe de l'entreprise.\n- Beaucoup de possibilités d'avancement\n- Bon avantages sociaux", "pros": "La concilliaton travail-famille", "cons": "", "date_created": "9 April 2015"},
{"id": "f036527d4069c6a0", "rating": 3.0, "text": "I work at night with a remorque.on driver moves the vehicle malstationnés and address .on tickets writes a report offenses, trips and required fees.", "pros": "", "cons": "", "date_created": "24 March 2015"},
{"id": "2a05b7bdb2bfa7c7", "rating": 5.0, "text": "le matin préparer instrument plans toutes les instrument  nécessaires a utiliser, mes coéquipiers ont été de très bon personnes m ont montre beaucoup de information pour devenir meilleurs a chaque jour etc.", "pros": "une excellente emploi", "cons": "rien de négative", "date_created": "20 March 2015"},
{"id": "5b53836b487acec1", "rating": 4.0, "text": "Service a la clientèles , émettre des contraventions pour des stationnements illégale. Travaille d'équipe.", "pros": "", "cons": "", "date_created": "18 March 2015"},
{"id": "c7133e05abf10968", "rating": 4.0, "text": "the foremans there who manage do a very poor job. it seems like their objective are to show their superiors that they can fire or slap infractions on the blue collar workers.", "pros": "good pay", "cons": "horrible management and poor quality control", "date_created": "17 March 2015"},
{"id": "2dce1e91415d00eb", "rating": 4.0, "text": "Le plaisir de partager ses idées.                                                      Rencontrer et connaître ses confrères de travail.                             Nous amène à s'entraider.", "pros": "Belle ambiance de travail", "cons": "Personne qui ne collabord pas.", "date_created": "11 March 2015"},
{"id": "4f1058af3965ad8a", "rating": 4.0, "text": "L'ambiance de travail est bien. L'horaire de travail est variable ce qui est bien.", "pros": "", "cons": "", "date_created": "11 March 2015"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "7dc0da103f362013", "rating": 3.0, "text": "Je suis tombé malade avant même de commencer à prendre gout dans mon emploi au début c était fatigant.", "pros": "", "cons": "", "date_created": "23 February 2015"},
{"id": "58f40c1a1d213625", "rating": 4.0, "text": "Travailler à la Ville, rempli de frustrations et de joie!\nTout le monde connaît les avantages et les désavantages de travailler pour la Ville de Montréal...", "pros": "", "cons": "", "date_created": "28 January 2015"},
{"id": "533711060c2ac2ee", "rating": 5.0, "text": "Meme chose que précédemment: survol description de taches du clos rosemont petite patrie, beaucoup de tact, empathie et communication .", "pros": "défi a chaque tempête", "cons": "aucun", "date_created": "28 December 2014"},
{"id": "74463ddbf05e6017", "rating": 5.0, "text": "C'était un grand plaisir de travailler en tant que Col Bleu dans les parcs, les bureaux...\nbon avantages sociaux\ntrès bon salaire\nbon condition de travail", "pros": "salaire", "cons": "les horaires", "date_created": "7 December 2014"},
{"id": "6c569de4b2c3b270", "rating": 5.0, "text": "J'ai bien aimé travailler au sein de cette entreprise, bonne structure, bonne condition.", "pros": "", "cons": "", "date_created": "18 November 2014"},
{"id": "e6a1b26e66b925c3", "rating": 5.0, "text": "C'était un travail de terrain. Je devais m'occuper de l'équipement (entretien et calibration) et préparer les tournées d'échantillonnage. J'échantillonnais ensuite plusieurs plans d'eau ou égouts pluviaux. Je faisais la saisie de données et toutes autres tâches connexes.", "pros": "travail stimulant", "cons": "travail difficile physiquement", "date_created": "6 November 2014"},
{"id": "8e6e9b1996bf48d1", "rating": 5.0, "text": "journée de travail chargée\ntravail d'équipe\nLe respect\ndes heures flexibles\nles opportunités d'apprendre plus", "pros": "heures flexible", "cons": "", "date_created": "4 November 2014"},
{"id": "4e410fed1fee70c0", "rating": 5.0, "text": "Je devais suivre des échéanciers et m'adapter à la température changeante puisque je travaillais dehors. Je marchais beaucoup avec mon équipement et je devais photographier toutes les maisons d'Ahuntsicen quelques mois seulement. Je devais donc être très assidue. Je devais aussi répondre aux diverses questions des gens qui étaient inquiets de voir quelqu'un photographier leurs maisons. J'ai beaucoup aimé la confiance que mes employeurs m'ont donnés.", "pros": "Être photographe", "cons": "", "date_created": "16 October 2014"},
{"id": "d9d30e75f3bbc247", "rating": 3.0, "text": "-Servir efficacement la clientèle en la transportant en toute sécurité;\n-Effectuer la vérification avant départ de l’autobus;\n-Connaître et appliquer la réglementation;\n-Assurer la sécurité et la discipline à bord;\n-Tenir les différents registres à jour;\n-Débrouillardise;\n-Patience;\n-Concentration;\n-Bon sens de l’orientation;\n-Sens des responsabilités;\n-Sens du service à la clientèle.", "pros": "", "cons": "", "date_created": "16 October 2014"},
{"id": "c934fe98f272b273", "rating": 5.0, "text": "Ce travail vous permet d’être responsable avant tout , de surveiller et d'assurer la sécurité des personnes  . Il vous permettra de prendre vos propres initiatives, de prendre les bonne décision , et aussi d'avoir une bonne équipe de travail qui détend l’atmosphère et rend ce travail agréable", "pros": "bien payés", "cons": "quand il n y'a personne", "date_created": "14 October 2014"},
{"id": "0328d501a7832a87", "rating": 3.0, "text": "A lot of corruption in this city.\nPublic servants are the main cause of corruption.\nInefficient structure and management.", "pros": "Glamour, prestige", "cons": "Complex management structure", "date_created": "20 September 2014"},
{"id": "a0d3b18de21b96a9", "rating": 3.0, "text": "- assurer le suivi des dossiers à l'étude et tenir les échéanciers de   \nprésentation\n- management évolutif\n- collaborateurs bienveillants\n- aspect difficile, composer parfois avec une clientèle peu collaboratrice\n- aspect agréable, oeuvrer pour l'atteinte des objectifs fixés", "pros": "bon esprit d'équipe", "cons": "", "date_created": "10 September 2014"},
{"id": "4822f7e253a084a2", "rating": 3.0, "text": "Travail périodique et sur appel en hiver\n12 heures par jour.\n2 poses pour jour.", "pros": "Aider les concitoyens", "cons": "Travail sur appel", "date_created": "4 September 2014"},
{"id": "5a9e976dc0ddf08f", "rating": 4.0, "text": "Préfère ne pas trop en parler.  Climat de travail très agité par la nouvelle politique de ressources humaines. Les temporaires en subissent le plus quel que soit leurs apports à la performance organisationnelle et la période passée dans leur poste, comme ce sont la solution la plus facile que les gestionnaires trouvent pour répondre aux exigences de leurs supérieurs.", "pros": "", "cons": "", "date_created": "14 August 2014"},
{"id": "0acec2c3479def18", "rating": 3.0, "text": "C'est un milieu fortement syndiqué et, si l'un demande ceci, l'autre demandera cela. De sorte que, de négociation en négociation, il y a une spirale qui s'est créée.", "pros": "pas stressant", "cons": "pas de défis", "date_created": "14 August 2014"},
{"id": "560b75631a20a4bc", "rating": 5.0, "text": "Working for the city can be tough: People are always complaining that they pay taxes and they deserve this and that.\nThe great team spirit that the City encourages makes all the difficulty of the job worth it, you might be having a tough day but you're team is always going to make you smile and feel like you belong.", "pros": "World-Class Team Spirit", "cons": "Rigid structure", "date_created": "29 July 2014"},
{"id": "2c10a5128ef1134f", "rating": 4.0, "text": "nous parton souvent en équipe pour le quart de travail pas toujours le même travail sous les ordre du contremaitre", "pros": "travailler avec public bonne paye", "cons": "pas assez dheure", "date_created": "28 July 2014"},
{"id": "cdfd1fd6d79721bc", "rating": 4.0, "text": "Travail d'équipe intéressant\nLe respect et la collaboration des équipes\nTravail gratifiant", "pros": "", "cons": "", "date_created": "14 April 2014"},
{"id": "b37b92087ad5de66", "rating": 4.0, "text": "Une journée de travail typique: Placer les accessoires sur la plage et vérifier la qualité de l'eau du bassin. Accueillir les baigneurs sur la piscine et leur expliquer les règlements. Surveiller les baigneurs et s'assurer de leur sécurité. Répondre aux questions des visiteurs. S'occuper de la fermeture de la piscine.\nL'aspect le plus difficile de mon poste: Devoir régler les conflits entre les baigneurs.\n \nL'aspect le plus agréable de mon poste: Pouvoir créer un contact avec les baigneurs et mes collègues de travail.", "pros": "", "cons": "", "date_created": "6 April 2014"},
{"id": "f8fc249942157256", "rating": 5.0, "text": "un milieu sain, dynamique et avec des perspectives\ndes tâches variées", "pros": "avantages sociaux", "cons": "aucun", "date_created": "31 March 2014"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "371b86fd5a811521", "rating": 4.0, "text": "Prendre connaissance des mandats.\nDistribuer les tâches sellons l'ancienneté et les ressources disponibles.\nSuperviser les travaux veiller à la sécurité dans l'exécution, trouver des solutions aux problèmes.\nPlanification des travaux et suivie pour les jours qui suivent.\nLes opportunités son grande bien que assez difficile sans (bac).\nPour ce qui est de la gestion il y a beaucoup de niveaux décisionnelles.\nLa collaboration est bonne surtout en situation d'urgence.\nPas de souci du travail bien fait ou rendre service au citoyens, toutes les decisions son budgétaire.\nLe plus agréable c'est d'avoir les outils pour travailler de façons sécuritaire.", "pros": "La competance des ouvriers", "cons": "Les employés traité en numéro", "date_created": "17 March 2014"},
{"id": "998f48a989908116", "rating": 3.0, "text": "Il manque la relation avec clientèle. J'ai été bénévole dans des organisations sportives pendant plus de 10 ans et après j'ai travaillé chez Future Shop pendant près de 7 années.\nJ'ai besoin de milieu différent que le travail de bureau.", "pros": "", "cons": "", "date_created": "24 February 2014"},
{"id": "fe8ae8925e3e5677", "rating": 3.0, "text": "le developpement economique a ete une priorite a montreal jusqu en 2002 , depuis la ville ne sais pas quoi faire en ce domaine", "pros": "une equipe au talent diversifie", "cons": "trop de gestionnaire et trop d employes", "date_created": "14 February 2014"},
{"id": "6836e8af60544874", "rating": 4.0, "text": "J’aime bien travailler pour la ville de Montréal. Moi je suis affecté au parc, on me donne un parc en début d’été et j’y travaille tout l’été.\nJe peux aussi bien couper le gazon, vider les poubelles du parc ou faire la préservation de l’hygiène service sanitaire ou autres tâches selon la direction.", "pros": "Autonomie au travail", "cons": "saisonnier", "date_created": "12 February 2014"},
{"id": "780d12814e94c915", "rating": 4.0, "text": "Sous la responsabilité du chef de division, le contremaître gère les activités d'une unité administrative dont la mission consiste à planifier, coordonner, diriger et contrôler l'exécution des travaux d'exploitation et d'entretien de plusieurs point de vente de type casse-croûte et cafétérias, de même que de l'approvisionnement . Il voit aussi au bon fonctionnement des distributeurs automatiques.", "pros": "beaucoup de travail", "cons": "Très peu réussi", "date_created": "30 January 2014"},
{"id": "e2ea5c0ec1be2290", "rating": 3.0, "text": "Supervision d'une quinzaine d'employés cols bleus dans les arénas, les centres communautaires et dans les piscines. Voir à la sécurité des employés et des usagers utilisant les services offerts par la Ville.\nFournir les équipements de protection aux employés. Faire partie des comités de relation de travail et de santé et sécurité au travail avec les ressources humaines, des collaborateurs cadres et les représentants des syndicats cols blancs et cols bleus. Formation des employés et tous les suivis budgétaires. \nLe service à la clientèle est pour moi l'aspect valorisant du travail que j'avais à accomplir.\nLe seul côté négatif était le manque de personnel. Une dizaine de personnes avaient été relocalisées ailleurs du service et avaient rendu les tâches à faire plus difficilement.\nDans l'ensemble j'ai adoré le travail à faire et j'y retournerais si je le pouvais.\nMarcel Deroy", "pros": "Rencontres divers groupes en dehors de Montréal pour tables concertations en loisirs en autre.", "cons": "Rencontres tardives dans les arénas pour rencontrer des clients abusifs.", "date_created": "17 January 2014"},
{"id": "84cd41ad298c4bc4", "rating": 4.0, "text": "Les avantages sociaux  et les stabilité et la possibilité d'expansion sont des critères les plus recherchés en emploi", "pros": "Grosse entreprises", "cons": "appareils désuetes", "date_created": "13 January 2014"},
{"id": "19e699a6e5d65a7a", "rating": 5.0, "text": "As an intern for two months from France, I learned a lot of cultural things about Canada. Management in Montréal is totally different from France because people trust in each other and they are more confident.\nI worked 4 days per week, starting at 6:15AM until 4:30PM with a 45min break for the lunch. It was probably the hardest part of the job because it's not usual in France. Nevertheless, within 2 weeks, it was no more a problem for me. \nCo-workers were very friendly and respectfly, which I enjoyed a lot ! A real relation between managers and co-workers was living in the city.", "pros": "Good relation between co-workers", "cons": "/", "date_created": "6 January 2014"},
{"id": "611bc56ac0031a0b", "rating": 5.0, "text": "Stage pour la Ville de Montréal automne 2013\ndans la section de l’expertise et du\nsoutien technique (géotechnique)\n• Assister les chargés de projets dans la supervision d'études géotechniques\net de caractérisation environnementale, pour des projets d'infrastructure à\nla Ville de Montréal.\n• Surveillance de travaux de forages.\n• Vérification de calcul de soutènement, de capacité portante et de\ntassement.", "pros": "", "cons": "", "date_created": "20 December 2013"},
{"id": "a69547c6887d6dc8", "rating": 5.0, "text": "Apprentissage excellent malgré le fait que c'était un emploi temporaire (remplacement de congé de maladie).  Superviseur motivant.", "pros": "horaire", "cons": "emploi temporaire", "date_created": "5 December 2013"},
{"id": "1835596cf9551e26", "rating": 5.0, "text": "Une expérience très profitable aussi bien pour l'employé que pour l'employeur.", "pros": "", "cons": "", "date_created": "19 November 2013"},
{"id": "27399a485706118e", "rating": 4.0, "text": "- Immobilisme\n- Culture en cours de changement \n- Nouveaux apprentissage\n- Bonnes perspective d'avancement\n- Travail d'équipe", "pros": "Horaire stable 37.5 par semaine", "cons": "Aucun", "date_created": "21 October 2013"},
{"id": "61e7b1dd6d4e5483", "rating": 4.0, "text": "De beaux défis à relever afin de rendre l'organisations bien perçue à la suite des derniers événements de quelques personnes ma l intentionnées.", "pros": "Aide à la population", "cons": "Image", "date_created": "24 September 2013"},
{"id": "d37414faf2a7808b", "rating": 5.0, "text": "Stress free. Repspectfull and  understanding. Flexible hours.", "pros": "Layed back and being outside all the time", "cons": "poor salary", "date_created": "4 September 2013"},
{"id": "6b77262b763a4d51", "rating": 5.0, "text": "travail sur la route.\npériode de travail de 12 heure\nhorraire de 3 jours de fin de semaine", "pros": "", "cons": "", "date_created": "19 August 2013"},
{"id": "74f65d0fffe21d8b", "rating": 4.0, "text": "Je communique avec les citoyens-jardiniers pour les informer des techniques de jardinage. Je collabore avec mes collègues des différents départements pour servir les citoyens, concernant les livraisons de matériels, les réparations, l'amélioration des sites, etc..", "pros": "Rencontre enrichissantes et stimulantes pour ma vie personnelle et professionelle.", "cons": "Le poste à temps partiel ne me permet pas de répondre à tous les besoins des jardiniers.", "date_created": "8 August 2013"},
{"id": "4df239ac0a5bc664", "rating": 4.0, "text": "Tous les jours, nous rencontrons beaucoup de contrevenants (clients) qui aimeraient faire des ententes de paiement ou des travaux compensatoires pour les contraventions reçues. 80% de la journée, nous encaissons des sommes importantes.\nSelon le cas de chaque personne, nous devons appliquer les règlements et faire en sorte que les décisions prises corresponde", "pros": "Travailler la patience, rapidité, savoir se débrouiller selon les situations", "cons": "nous étions toujours débordés", "date_created": "24 July 2013"},
{"id": "10986d3b938ba2eb", "rating": 5.0, "text": "Travail à suggéré aux jeunes sans emploi car c'est un endroit où vous allez aimer et vous allez aussi sortir avec une connaissance.", "pros": "", "cons": "", "date_created": "19 June 2013"},
{"id": "6bf8de70e4df67a1", "rating": 2.0, "text": "On travaille beaucoup et le travaille n'est souvent pas reconnu et apprécie à sa juste valeur!", "pros": "Les enfants sont géniaeux", "cons": "...", "date_created": "11 June 2013"},
{"id": "4dd021084ef90e76", "rating": 5.0, "text": "Wonderful boss, very pleasant. The Director was elected at City Hall to create a new department exclusively for all the mayors of Greater Montreal. She was organizing regular meetings between them and the Mayor of Montreal. I was her assistant.", "pros": "", "cons": "", "date_created": "29 May 2013"},
{"id": "f2d175f5ac1aa7f0", "rating": 4.0, "text": "It was an amazing opportunity to work for the city of Montreal. The salary was amazing. There was a lot of advantages working at the city such as good working conditions.", "pros": "", "cons": "", "date_created": "22 December 2019"},
{"id": "e02de9cccfb7003c", "rating": 4.0, "text": "Travail fait de défis: recherche du meilleur rapport qualité-prix dans le respect de la Loi sur les Cités et Villes.", "pros": "", "cons": "", "date_created": "24 April 2013"},
{"id": "04ba1a42dca4eadd", "rating": 5.0, "text": "Never was a routine, new people everyday, friendly co-workers", "pros": "customer service", "cons": "extreme temperatures", "date_created": "16 April 2013"},
{"id": "cc918b6d783bf86c", "rating": 3.0, "text": "Presque 20 ans pour la Ville dans différents départements. J'ai assez aimé ce travail de commis de bureau et en secrétariat. J'ai quitté le jour qu'ils nous ont annoncé que le bureau déménageait au centre ville. En ce temps-là je demeurais à Mascouche. J'ai donc quitté pour travailler plus proche de mon domicile.", "pros": "", "cons": "", "date_created": "8 December 2012"},
{"id": "086b0a1e261db69d", "rating": 4.0, "text": "* pars intervention and activity building\n* patience and understanding\n* good but not as present\n* weather dependent; for example couldnt work if it was raining\n* changing lives", "pros": "working with all groups of ages", "cons": "weather dependent", "date_created": "21 November 2012"},
{"id": "3c72085fd69ae85b", "rating": 5.0, "text": "Je devais repondre au téléphone . Faire des Permis.\nDistribuer le courrier aux gens de mon etage.", "pros": "savoir des choses avant meme que les gens de la ville le sache", "cons": "aucun", "date_created": "18 November 2012"},
{"id": "8b336932b8c2e0d6", "rating": 4.0, "text": "Gestion de l'équipe de réception\nTravail clérical\nGestion des grilles horaires\nLe plus difficile était de satisfaire le plus de gens possible\nLe plus agréable le sentiment d'appartenance", "pros": "", "cons": "", "date_created": "9 August 2012"},
{"id": "369019fa0647c8b6", "rating": 5.0, "text": "Responsable de la division de l'occupation du Domaine public au Module technique du Service des travaux publics.\nJ'avais 34 employés à gérer.\nApprobation des localisations des utilités publics.\nÉtudes des fermetures de rues,ventes de ces dernières et abandons des utilités publiques\nOccupation du domaines publics avec des structures souterraines tunnels etc.\nMise à jours des plans d'utilités publiques.", "pros": "responsabilite, autonomie, défi à relevé, etc.", "cons": "", "date_created": "5 August 2012"},
{"id": "1af41dd917438f26", "rating": 2.0, "text": "L'environnement de travail est bon. mon poste est différent selon les saisons.", "pros": "", "cons": "", "date_created": "9 July 2012"},
{"id": "6967962030eca3a2", "rating": 5.0, "text": "• Veiller à la sécurité des usagers\n• Surveiller les automobilistes\n• Appeler la remorqueuse au besoin", "pros": "", "cons": "", "date_created": "26 June 2012"}
]