[
{"id": "84b2a353fc315896", "rating": 3.0, "text": "it was alright, not the best experience. jobs tend to take advantage of teenagers since they don't know what standards should be met due to lack of experience.... had i known there were much better jobs out there, i wouldve quit this boring job way sooner.", "pros": "", "cons": "", "date_created": "4 December 2019"},
{"id": "8659b0d93f93fd67", "rating": 3.0, "text": "Senior management was hard to work for. Some directors were under qualified for their positions. Made bad decisions based on poor understanding of key issues! Also other directors formed a \"good old boys/girls club\"!", "pros": "A lot of great people work for the City.", "cons": "Bad management.", "date_created": "15 April 2018"},
{"id": "bedd7285c2890c8e", "rating": 5.0, "text": "Close to the park and the lake. People who worked there were easy to get along with. Had coffee free everyday.  Nice big windows in some of the offices give you day light while you're at work.", "pros": "", "cons": "", "date_created": "3 May 2017"},
{"id": "922bde36571f1755", "rating": 5.0, "text": "great managers, easy going but still made sure the jobs were getting done. Easy going environment and diverse group of workers. Fast paced job with lots of change and adaptation.", "pros": "", "cons": "", "date_created": "12 January 2017"},
{"id": "45d0257bb0609ebc", "rating": 4.0, "text": "Starting this position, there was the General Manager and myself. I was responsible for the senior administration and setting up of a newly formed office. We reported to a volunteer Board of Directors, who led us to hosting the 2008 Arctic Winter Games, in Yellowknife. The best part of this position, was creating new templates, procedures,meeting new people, building community relations and seeing the Games grow to over 2400 volunteers. I received a promotion in September 2006, as the Volunteer Coordinator. I worked  with all of our divisions (IT, Security, Accreditation, Special Guests, Volunteer & Protocol, Accommodations, Food Services, Sport Technical, Marketing, Fundraising) in ensuring their volunteer requirements were met. I also helped form our registration/accreditation online registration/accreditation system. This position made me realize my potential and that hard work goes a long way. The hardest part was after the Games and realizing that it was over.", "pros": "Challenging, fast paced and meeting new people.", "cons": "A term position once the Games were over.", "date_created": "8 July 2015"},
{"id": "1f105bb736c335c9", "rating": 4.0, "text": "some coworkers are the best you could hope for....\nThe management seems to be entranced in the past and do not seem to understand that they work for the residents of the City and have an old boys club that may not be the best overall for the workers and residents.", "pros": "", "cons": "", "date_created": "6 April 2014"}
]