[
{"id": "17c2lfvqc4e0gf1f", "rating": 3.0, "text": "a good day was fr 7:00 untill 3:00 learn lots at my job mangagement were great my co worker were all right the hardest part of this job was putting it the time the good thing you got paid every week...", "pros": "good", "cons": "good", "date_created": "November 15, 2012"},
{"id": "1f5vphgaasaai800", "rating": 5.0, "text": "No job security and sometimes you are waiting on a job site for materials to finish the task that you started that day. Supervisor was awesome and the crew I worked with also", "pros": "Not stressful", "cons": "No job security", "date_created": "May 18, 2021"},
{"id": "1ead8gsvmrfn7800", "rating": 5.0, "text": "Really great place to work for. Great people. Work place culture is amazing. If I get a chance again I would still go back to work for city. So far it was the best work experience for me.", "pros": null, "cons": null, "date_created": "June 9, 2020"},
{"id": "1e4u00slio933801", "rating": 4.0, "text": "I loved what i did and would of loved to stay, seeing I'm a citizen of saint john all my life. Left cause there was too long of a list to become full time and wasn't guaranteed to return. Work for Parks and recreation.", "pros": null, "cons": null, "date_created": "April 2, 2020"},
{"id": "1dc0ir3st0mtc000", "rating": 5.0, "text": "great place to work great people and well paid, days go by very quickly and it overall is a great community and organization to find yourself to be apart of", "pros": "easy to work", "cons": "confusion", "date_created": "May 28, 2019"},
{"id": "1db78682b5ne2800", "rating": 5.0, "text": "City of Saint John is a great employer. Management is very professional. Employees are expected to work hard but are also provided with good remuneration package.", "pros": null, "cons": null, "date_created": "May 19, 2019"},
{"id": "1dapdbsag52t7800", "rating": 5.0, "text": "It was a good and rewarding job seeing all the kids at the city daycamp i work at because it gave people from all walks of life an opprotunity to take part in a camp.", "pros": "Working with all sorts of people.", "cons": null, "date_created": "May 13, 2019"},
{"id": "1colq6plk5ne1800", "rating": 5.0, "text": "it is a great place to work. there are many different departments to work in. There is garbage, ashfault working on the roads and painting lines. It is a great", "pros": null, "cons": null, "date_created": "September 30, 2018"},
{"id": "1cj68sdpbaqh2854", "rating": 5.0, "text": "The Playground program is a free program provided by the city. It is a great program for those families that can't afford to send their kids to camp, or day care.", "pros": null, "cons": null, "date_created": "July 24, 2018"},
{"id": "1bcad96cc5nd0eoq", "rating": 3.0, "text": "Very minimum salary for the work and effort put in. Had an okay time at the job I was at, worked with good people, management wasn't the best, very hard to reach and distant when speaking with them.", "pros": null, "cons": null, "date_created": "March 28, 2017"},
{"id": "1b5oa1g9l0kbu1dl", "rating": 5.0, "text": "Working for the City of Saint John was such a great experience. The work environment was always positive and upbeat. The staffs passion and enthusiasm towards their jobs was both contagious and inspiring. My supervisors went above and beyond to offer guidance when needed and to lend a helping hand. It was a great experience to have worked there.", "pros": "great team", "cons": null, "date_created": "January 5, 2017"},
{"id": "1aqmtcv8gakaj9n1", "rating": 4.0, "text": "Mostly enjoyable work and workplace. Busy telephones and reception. Professional setting. Please see pros & cons listed for more details/explanation.", "pros": "Professional work atmosphere, mostly nice coworkers, great work location and generally a great team", "cons": "Training was woeful, impassive and unsupportive trainer", "date_created": "August 21, 2016"},
{"id": "1al55ed23akbbb4v", "rating": 4.0, "text": "Overall great experience, co-workers were awesome. Special events brings people together in such a great way. Coordinating community centres was fantastic.", "pros": null, "cons": null, "date_created": "June 13, 2016"},
{"id": "1afjsjctcak5fft4", "rating": 5.0, "text": "we learned how to work with a group, with kids. It was a very good time. Had to learn how to fix problems quickly and how to organize a day with the kids.", "pros": null, "cons": null, "date_created": "April 5, 2016"},
{"id": "1ablg9pq1ak8jbfu", "rating": 4.0, "text": "Working with really excellent employees and foreman, Always to help with any job related material. City bran out of money prematurly and job discontinued 3 months early", "pros": "good working hours", "cons": "poor pay", "date_created": "February 16, 2016"},
{"id": "19gk3gn7b5ncgale", "rating": 4.0, "text": "Prepare schedules, arrange field trips, run day to day activities and special events. I was also entrusted to initiate the program and communicate with the community.", "pros": "working with kids", "cons": "working with my own kids", "date_created": "March 17, 2015"},
{"id": "18nn85ldd5n8gcgk", "rating": 3.0, "text": "Fun job but have to like kids and have patients. I learned how to deal with kids better, The boss is awesome and loves doing what he does so makes it better and all co workers are very fun to work with, the hardest part would be dealing with angry parents or kids, And the most enjoyable part is having freedom and teaching kids.", "pros": "fun work environment.", "cons": "low salary", "date_created": "May 11, 2014"},
{"id": "18601f1kjb84g8r3", "rating": 3.0, "text": "The actual work I was doing was great, although there were no benefits, nor job security of advancement.", "pros": "Worked in the public in a nature environment", "cons": "adequit staffing.", "date_created": "October 3, 2013"},
{"id": "1836g9n185ncgbko", "rating": 5.0, "text": "Low stress.\rNot very physically demanding.\rExcellent job security.", "pros": "Unionized, security.", "cons": "Unionized, slow advancement regardless of performance.", "date_created": "August 29, 2013"},
{"id": "1806dtbv15ncgcvj", "rating": 4.0, "text": "Monitor and maintainance on approximately 80 different water and waste water locations throughout the City of Saint John. ", "pros": "All stat days off", "cons": "Low pay", "date_created": "July 23, 2013"},
{"id": "17aumv0kq5dsgagl", "rating": 2.0, "text": "it was an interesting job restoring an old building to a new and better held together structure", "pros": "learning experience", "cons": "hard work teaching new workers how to use equipment", "date_created": "November 1, 2012"}
]