[
{"id": "1e2v53qjk32nd003", "rating": 3.0, "text": "It's great for a second job as long as you get benefits elsewhere. As a Temporary Staff worker you can only work an average of 20 hours per week and there are no benefits other than state mandated benefits.", "pros": null, "cons": null, "date_created": "March 9, 2020"},
{"id": "1g5qgrjfoiom1800", "rating": 1.0, "text": "These guys are the BIGGEST KNOBS to work for! You are only a 24 hour ATM machine to them that  they can use to deposit and withdrawal anytime that's convenient for them. To boot they hire mostly immigrants trying to be DIVERSE. However most of their immigrant employees are back stabbers! And do nothing but whine and complain along with their very poor driving skills! Almost got hit a few times while I was employed there! Management is terrible and they don't listen to any of your concerns in regards to matters! I'm glad I QUIT and am no longer there cause it's an awful bunch of folks there! GOOD BYE and GOOD RIDDANCE! There are far better jobs out there to those reading this. Your hours aren't guaranteed with them and it takes a few years to get any seniority if they don't lay you off in the fall winter! Don't waste your time with these door knobs! look elsewhere for work! Buy the way other municipal jobs out in the suburbs pay more than here to boot!", "pros": "none", "cons": "days seem to drag on forever and boredom factors in.", "date_created": "June 17, 2022"},
{"id": "1g28qhjbih20r801", "rating": 4.0, "text": "Nice teams to work with. Most members are collaborative. Salary is low and not sufficient for the the cost of living in the city. High work loads, can be stressful. ", "pros": null, "cons": null, "date_created": "May 4, 2022"},
{"id": "1f4rv3f6uu392800", "rating": 5.0, "text": "Caring supervisors/mangers. Even though I worked a seasonal position the managers where able to get me to do other jobs for the City of Vancouver while I was looking for another job. ", "pros": null, "cons": null, "date_created": "May 4, 2021"},
{"id": "1eur1m70jo15p800", "rating": 4.0, "text": "Generally a good place to work - great benefits. My department has a great manager but that can vary depending on which department you work in. The people I work with are wonderful.", "pros": null, "cons": null, "date_created": "February 18, 2021"},
{"id": "1e5lnm414on3s801", "rating": 5.0, "text": "they try to balance work and home life, while paying you well\rthey try to get the best and make sure you succeed to the fullest\roverall, they are pretty good joes", "pros": "they try to balance work and home life, while paying you well", "cons": "n/a", "date_created": "April 11, 2020"},
{"id": "1e3ar1v31fdns800", "rating": 1.0, "text": "Please do not expect advancement. People are not what they seem. Trust nobody. Management does not have your back. Please document any and all interactions with management.", "pros": "Adequate vacation and PTO days", "cons": "They will beat you down", "date_created": "March 13, 2020"},
{"id": "1e2cu0h2lf0me800", "rating": 5.0, "text": "Good community, job can be very stressful for some people. Job hours are very flexible and the two locations make it more accessible to people........", "pros": null, "cons": null, "date_created": "March 2, 2020"},
{"id": "1dvd37pceb68v800", "rating": 4.0, "text": "The center I work in has a large swimming pool, fitness center, and a game room.  The compensation is very good.  The hardest part of the job is that sometimes there is not enough time to get some projects done when you work with customers.", "pros": "Wellness opportunities", "cons": "Upper management does not create work relationships with employees.", "date_created": "January 24, 2020"},
{"id": "1du44tdsqf12j803", "rating": 5.0, "text": "I can not say enough good things about working with the City of Vancouver and the team at Firstenburg Community Center. Everyone from the center director all the way down to our cleaning staff are absolute gems and true assets to the City.", "pros": null, "cons": null, "date_created": "January 8, 2020"},
{"id": "1ds7kct1eh40j800", "rating": 2.0, "text": "Write ups for very small things including what you do in your off time, but only if management doesn't like you. If they like you, you will advance quickly. Very much based on favoritism.", "pros": null, "cons": null, "date_created": "December 16, 2019"},
{"id": "1douo62l9bre9802", "rating": 2.0, "text": "typical day would include redlining or facility inspection\rlearned about storm water facilities and geography of the city\rworkplace culture seemed dull, everyone kept to themselves\rhardest part of the job was finding work to keep me busy\renjoyed learning about the storm water facilities around Vancouver", "pros": null, "cons": null, "date_created": "November 5, 2019"},
{"id": "1dm4lam2mbrdc802", "rating": 5.0, "text": "I loved working for the City of Vancouver!\rFirstenburg Community Center became my home away from home!\rI miss it very much and would do it again in a heartbeat!", "pros": null, "cons": null, "date_created": "October 1, 2019"},
{"id": "1ddh2ajb3brf9800", "rating": 1.0, "text": "No opportunity for advancement. Unhappy workplace. Everyone lives in fear daily for their job. You cannot trust your Manager, you cannot trust HR. It breeds mistrust.", "pros": null, "cons": null, "date_created": "June 16, 2019"},
{"id": "1d7ftt6v31d12001", "rating": 5.0, "text": "Really enjoyed working for the city.\rEveryone was so relaxed and no stress. Learned a varity of different jobs,trained in many different fields.\rBosses were easy to get a long with", "pros": "everything", "cons": "easy work pace", "date_created": "April 2, 2019"},
{"id": "1crvnv8t75nbb800", "rating": 1.0, "text": "Horrible place to work. The trainer and lead is horrible is rude and only teaches you what she wants. Then if your not fast enough for their  team they will let you go. Even if you say something they are not willing to work with you.The worst experience I ever had .", "pros": null, "cons": null, "date_created": "November 10, 2018"},
{"id": "1cq6ncmotbrec800", "rating": 2.0, "text": "The mangers would rather ignore issues with staff than deal with them until HR has to get involved. If you can wait 20 years until someone retires you might get a chance at advancement. Most of the technology is older with major advancements to technology only coming every 3-5 years. Requirements for on-call rotations is ridiculous. Most of the staff is very unfriendly and introverted there are a couple exceptions.\r City wants to change its working culture but in reality they do not.", "pros": "Generous vacation time and good health benefits", "cons": "Pay is below the market and there is no advancement", "date_created": "October 19, 2018"},
{"id": "1cq2jdqmvb82k800", "rating": 5.0, "text": "City of Vancouver is a great place to work. They offer great benefit package, health benefits and of course retirement benefits. Along with working with a wide range of professionals.", "pros": null, "cons": null, "date_created": "October 17, 2018"},
{"id": "1c8o3isp01fdg6m6", "rating": 4.0, "text": "The environment was normal for a small IT department. The draw back was that the employees are long term so made it difficult to be excepted.One of the most difficult parts of the job was finding transpiration to remove sites.", "pros": "regular hours", "cons": "not a fun place to work", "date_created": "March 16, 2018"},
{"id": "1c6nms1h7b83dc1e", "rating": 4.0, "text": "As far as a children's seasonal camp goes, it is a decent work environment for off seasons for high school and college students. The management of the camp was great, and it helps build leadership skills.", "pros": "Fun to work with kids", "cons": "No breaks", "date_created": "February 19, 2018"},
{"id": "1b2v0s73ub88sdl0", "rating": 4.0, "text": "Great temporary job. The crew I work with are a great group that care about my success.I have learned a great deal about public utilities. I would recommend it to anyone looking for work.", "pros": "Great Crew", "cons": "none", "date_created": "December 1, 2016"},
{"id": "1e2v53qjk32nd003", "rating": 3.0, "text": "It's great for a second job as long as you get benefits elsewhere. As a Temporary Staff worker you can only work an average of 20 hours per week and there are no benefits other than state mandated benefits.", "pros": null, "cons": null, "date_created": "March 9, 2020"},
{"id": "1av3c7s7db8adah9", "rating": 4.0, "text": "Good hours, nice co-workers, fun work environment. Excellent Center Director. Variety in job duties. Good health care benefits.", "pros": null, "cons": null, "date_created": "October 15, 2016"},
{"id": "1aiguunc2b80v98n", "rating": 4.0, "text": "New mayor did not embrace the importance of sustainable practices and was a global warming denier. Great location, worked with all departments, reported to the mayor.", "pros": "Stable, good supportive infrastructure", "cons": "New Mayor did not assign importance to the policy area", "date_created": "May 11, 2016"},
{"id": "1a5l5ai6bb811e8l", "rating": 4.0, "text": "Loved working here as a lifeguard! Really fun environment. Loved all the management. Not much room for advancement, high turnover with employees but really great first job!", "pros": null, "cons": null, "date_created": "December 3, 2015"},
{"id": "1a20evol4b81feka", "rating": 4.0, "text": "I loved working with the parks and recreation of Vancouver, WA. I worked there through high school and the management was amazing, very flexible with scheduling and will work around your schedule. Excellent experience!", "pros": null, "cons": null, "date_created": "October 19, 2015"},
{"id": "1a0pt58gras3o87o", "rating": 5.0, "text": "Awesome place to work. Taught children how to rockclimb. Co workers were good. Management was great. Hardest part of the job was talking in front of big groups.", "pros": null, "cons": null, "date_created": "October 4, 2015"},
{"id": "19k5fup9bb81gesa", "rating": 5.0, "text": "People understand their tasks and the organization.  \rExcellent management.  \rStrong leadership.\rWork hours are typical but flexible.\rCo-workers are professional and positive.\rWonderful atmosphere.", "pros": null, "cons": null, "date_created": "April 30, 2015"},
{"id": "19bd9m3pab84gakt", "rating": 4.0, "text": "Manage the entrance to the locker room/pool entrance on your. When on deck keep a close eye on patrons in the water. Clean up locker rooms, deck and pool office.\r You learn basic-advanced leadership skills, CPR, AED and ILTP rescue Procedures.\r Hardest part is being able to walk for hours on end.\r the most enjoyable part is the team and patrons.", "pros": "Free access to the Pool for exercise", "cons": "only 30 min breaks every 6 hours", "date_created": "January 11, 2015"},
{"id": "19as6kdd9b80g801", "rating": 4.0, "text": "This was a great fun environment to work in, friendly and caring people and good food. It was a good working experience  and I built a lot of different skills, like counting money, and talking with people.", "pros": null, "cons": null, "date_created": "January 4, 2015"},
{"id": "191tbnrlrb84gbdq", "rating": 3.0, "text": "In some departments there is a toxic corporate environment that is very uncomfortable for line staff, and begins with senior management. Staff development is limited to technical and \"feel good\" training, but ongoing support and development is virtually non-existent in most departments. \r Some managers are focused on maintaining status quo and are not interested in creative solutions despite the need for change. Others are very open to collaboration and change. Be sure you know which is which by asking smart questions during interviews.", "pros": "Excellent vacation benefits", "cons": "Typically not a good envirionment for creative ambitious people", "date_created": "September 15, 2014"},
{"id": "1909vo32mb84g806", "rating": 5.0, "text": "I learned as much as they could teach me at my internship working along two hard working supervisors.", "pros": null, "cons": null, "date_created": "August 26, 2014"},
{"id": "18sh5c52qb80gfp8", "rating": 5.0, "text": "Enjoyed working with the other employees. Made some long term friendships.", "pros": null, "cons": null, "date_created": "July 10, 2014"},
{"id": "18jcss3g5b84gb8k", "rating": 5.0, "text": "Long shifts with a lot of walking. Must be vigilant at all times.", "pros": null, "cons": "Not many hours", "date_created": "March 19, 2014"},
{"id": "177v71k6i4e0gbtf", "rating": 5.0, "text": "A very fun job with learning values, and public contact. The City of Vancouver offers many oppurtunities to learn about the city I work in and what is happening in local government.", "pros": "interesting, ability to use my skills and qualifications.", "cons": "short term contract.", "date_created": "September 25, 2012"},
{"id": "171cjccbp4e0gb0o", "rating": 1.0, "text": "I learned everything about water and sewer utilities, the review of proposed development, setting up 6 yr capital improvement programs, compliance reports (water and NPDES wastewater), designing pipeline projects for the water system, coordinating on project teams for utility impprovements during regional transportation projects, engineering design and pipeline construction inspection practices. I enjoyed the co-workers at all parts of the city and learned an incredible breadth and depth about all parts of the utility through my work on project planning and proj; management teams", "pros": "generous benefits, and mostly the work experience working in a larger program", "cons": "i would have enjoyed a chance to work in the construction area before leaving", "date_created": "July 5, 2012"},
{"id": "16o95j9ko00002ku", "rating": 5.0, "text": "I loved working as a lifeguard for the City Of Vancouver. They are very professional and safety is a big must with them. The people are so helpful and will work around your home/school life.", "pros": "can swimm laps for free", "cons": "more for teens kind of job", "date_created": "March 14, 2012"},
{"id": "16gvcp19g00007mj", "rating": 2.0, "text": "The work is rewarding; the staff would like to make a difference. In all departments, folks who should never lead people continue to create a toxic work environment. Two women run the show and they hire their friends. Results do not matter; who is your friend does.", "pros": "work purpose, dedicated staff, work/life balance.", "cons": "management by fear, no accountability, bullies flourish", "date_created": "December 14, 2011"},
{"id": "16dntbqig000012t", "rating": 4.0, "text": "A neat environment with nice people. People love to swim and they can anytime in this fun setting with shallow toddlers pool, deep end and water slide.", "pros": "employees can use the pool free", "cons": "humid on hot days", "date_created": "November 4, 2011"}
]