[
{"id": "1fvt2eklq309c002", "rating": 4.0, "text": "I enjoy working here and like that your home every night. Has good benefits and decent pay. Good work environment. Made some friends here and supervisors are helpful. ", "pros": "4 ten hour shifts", "cons": "Working in extreme conditions", "position": "Heavy Equipment Operator (Former Employee)", "date_created": "April 5, 2022"},
{"id": "1gbqu8nhegaii800", "rating": 1.0, "text": "Terrible, toxic, relationship with management. Unsafe work practices, no advancement, pay is mediocre. It used to be a really great place to work, it isn't anymore. ", "pros": null, "cons": null, "position": "Mechanic (Former Employee)", "date_created": "August 31, 2022"},
{"id": "1gaiaphttjrrk802", "rating": 5.0, "text": "Pay is very good, EDO's are great. Some bosses are amazing and understanding, others are bitter and jaded. It depends on who you work with, but most people are really laid back and easygoing.", "pros": "EDO's, pay for education", "cons": null, "position": "Labourer (Current Employee)", "date_created": "August 15, 2022"},
{"id": "1g1p5mcgmi7kk802", "rating": 5.0, "text": "I had a great time working for the city. My only reason for leaving is that I had to take care of my children for a some. Great place to work for.  Good pay aswell ", "pros": "Good pay", "cons": "Hours", "position": "Maintenance Technician (Former Employee)", "date_created": "April 28, 2022"},
{"id": "1ftmi67oju2ju800", "rating": 2.0, "text": "Worked with a group of mechanics - parks branch, became very unhealthy for my health to have to try to waste time all day as requested by Manager and supervisor, Drive around and waste tax dollars was the goal there, I would rather have kept busy in the shop and been productive, but wasn’t an option because they’d make your life difficult.Safety was a issue with unauthorized staff coming in work place area (Shop) all the time Union and HR basically are one together.Hiring friends that have no experience or ambition to work than sublet work out to other vendors, over other applicants that would have experience.Was so unhealthy I quit along with other good mechanics in the past ", "pros": "Gaining experience / knowledge from other Departments Employees", "cons": "Unhealthy for wanting to be productive", "position": "Auto Mechanic (Former Employee)", "date_created": "March 8, 2022"},
{"id": "1fq6j6k703oa9002", "rating": 4.0, "text": "I enjoyed my work as a seasonal labourer. Although the job can be physically demanding, you get to be outside all day in the summer and can take pride in maintaining our city's wonderful parks. Management can be hard to deal with, and the culture can be clique-y, but overall it's a fun place to work. Beware that as a seasonal employee, you don't qualify for benefits. I worked for them for 6 years and never qualified because I didn't have enough CONSECUTIVE hours.", "pros": "every third Friday off (EDO), outdoors", "cons": "no benefits", "position": "Parks Labourer (Former Employee)", "date_created": "January 24, 2022"},
{"id": "1fea85plg3od8001", "rating": 3.0, "text": "Job itself can be very stressful. Management add a lot of unnecessary stress. Great group of co workers. Lots of split shifts, very difficult to get weekends off. Holidays are based on seniority making it difficult to get desirable time off. (Winter and summer holidays)", "pros": "Great benefits", "cons": "Stress, split shifts, hard to get time off, management.", "position": "Operator (transit) (Current Employee)", "date_created": "August 29, 2021"},
{"id": "1f79v77vjo1nd800", "rating": 5.0, "text": "Every thing doing well and I love working with them, very friendly and we have some fun. My co worker and I help us each other, my supervisor thought me a lot.", "pros": "Big salary", "cons": "Hot inside pool area", "position": "Custodian Building (Current Employee)", "date_created": "June 3, 2021"},
{"id": "1f2ufa8t2him2800", "rating": 1.0, "text": "bad experience in the city transit maintenance I feel I am not welcome to work here the management it's so  very stressful I should quit earlier my mistake I'm trying to kill the pain  it took me 8 years before I realize I do not belong here ", "pros": "no free", "cons": "stressful", "position": "service line mechanic (Former Employee)", "date_created": "April 10, 2021"},
{"id": "1elk46damu1cn800", "rating": 2.0, "text": "I applied for the same engineering position twice at the City.For the first time I applied, the interview was more than a month after the posting closed. Then it took a month after the interview in order to get a firm answer on the outcome. Very painful.For the second time I applied, it took them 3 months to try to decide what to do with recruiting the position, and they ultimately cancelled the process. Pretty lame, and real lack of communication from a large organization.", "pros": null, "cons": null, "position": "Engineer applicant (Former Employee)", "date_created": "October 26, 2020"},
{"id": "1ekl03ihmnpmq800", "rating": 4.0, "text": "I enjoyed my work here, the management is good and my coworkers are supportive. I miss my work here and given a chance i would still work here at City of Saskatoon", "pros": null, "cons": null, "position": "Labourer (Former Employee)", "date_created": "October 14, 2020"},
{"id": "1e8s75tc6nh9s800", "rating": 3.0, "text": "Good environment when it comes to having opportunities for advancement. The best thing about it is work/life balance. Great working outside and very friendly enviroment", "pros": "gives you working experience", "cons": "same routine", "position": "Labourer (Current Employee)", "date_created": "May 21, 2020"},
{"id": "1e857cvp5ouev800", "rating": 1.0, "text": "Manager doesnt know what they are doing, director makes comments that are untruthful, showed true colors during covid. This place is very micromanaged  not allowed to have a thought of your own and, the trainer has been there since highschool and if you bring up some ideas to implement during training they get defensive.      Most people stay there for the money because they are stuck st this point.  Managment in the last 5 years is the worst!", "pros": null, "cons": null, "position": "Customer Service Representative (Former Employee)", "date_created": "May 12, 2020"},
{"id": "1e5b1mh8ioccl803", "rating": 5.0, "text": "I was in charge of a summer camp with my partner. I met a lot of great kids and had fun spending the summer with them. The work staff was also great and I had a great supervisor. I would definitely recommend working here!", "pros": "Free Lunches if you forgot yours, Great kids and staff, had no problems with parents", "cons": "Only a summer position", "position": "Summer Program leader (Former Employee)", "date_created": "April 7, 2020"},
{"id": "1e51l1885o18r802", "rating": 4.0, "text": "Loved working here it was very fun, very flexible and good pay. Casual hours for the job, but the job its self was also very casual and laid back. Afternoon hours.", "pros": null, "cons": null, "position": "Learn to Skate Instructor (Former Employee)", "date_created": "April 3, 2020"},
{"id": "1e3039tjmol98803", "rating": 4.0, "text": "All the areas work together to help each other, even if the job itself is independent. Everyone is supportive and helps each other grow and become better at their job or help advance each others careers. everyone is well respected, and our opinions do not go unnoticed.", "pros": null, "cons": null, "position": "Financial Customer Service Cashier (Current Employee)", "date_created": "March 9, 2020"},
{"id": "1e1kmous1hbgo802", "rating": 4.0, "text": "This was a fun and upbeat place to work. I made my own choreography and chose my own music. I had freedom to teach the way I felt comfortable. Always encouraging!", "pros": null, "cons": null, "position": "Certified Fitness Instructor (Former Employee)", "date_created": "February 21, 2020"},
{"id": "1e1auo1vqhcjq802", "rating": 5.0, "text": "Working for the city of Saskatoon fitness centres has been great! Flexible hours for work, free gym membership for trainers, and great parking too. I highly recommend applying if you have the proper qualifications", "pros": null, "cons": null, "position": "Personal Trainer and Fitness consultant (Current Employee)", "date_created": "February 17, 2020"},
{"id": "1dvk3nsmvblvk803", "rating": 5.0, "text": "Very friendly staff to work with great job experience \r  Outdoor work\rRelaxed work environment \rFair pay \rUnfortunately only seasonal employment and would prefer full time\rI recommend to work for city", "pros": null, "cons": null, "position": "Saskatoon sports fields (Current Employee)", "date_created": "January 27, 2020"},
{"id": "1dug5mr2bhdnc802", "rating": 5.0, "text": "It was a good experience for me especially right after I finished my office schooling. I did enjoy the other people that I worked closely with and the building was nice and old.", "pros": null, "cons": null, "position": "Secretary II (Practicum) (Former Employee)", "date_created": "January 13, 2020"},
{"id": "1dtumnnumhblo803", "rating": 4.0, "text": "I like going to work every morning. My coworkers are great and very helpful. Management leaves something to be desired sometimes and interdepartmental communication is bad. Still a great place to work.", "pros": null, "cons": null, "position": "Clerk/Cashier (Current Employee)", "date_created": "January 6, 2020"},
{"id": "1fvt2eklq309c002", "rating": 4.0, "text": "I enjoy working here and like that your home every night. Has good benefits and decent pay. Good work environment. Made some friends here and supervisors are helpful. ", "pros": "4 ten hour shifts", "cons": "Working in extreme conditions", "position": "Heavy Equipment Operator (Former Employee)", "date_created": "April 5, 2022"},
{"id": "1dttr8kqch6l9803", "rating": 3.0, "text": "Work conditions are good. Not much for supervision which is nice. Salary,time off is good. Co workers are easy to get along with. If you need a job it's a good place to work.", "pros": null, "cons": null, "position": "Custodial Worker (Current Employee)", "date_created": "January 6, 2020"},
{"id": "1dtf1o24kq3ma802", "rating": 5.0, "text": "Really wonderful work culture. Amazing support from Management. Very well paid and benefits as well.awesome coworkers.\rOnce you start here to work no one leaves until retirement", "pros": null, "cons": null, "position": "Recreation Worker (Former Employee)", "date_created": "December 31, 2019"},
{"id": "1dsan6qleb88k803", "rating": 4.0, "text": "- Collaborative\r- Data Analysis,  Advance Policy Preparation, Writing Reports \r- Inclusive Culture\r- Working on projects which directly and positively impacts the citizens", "pros": "Collaborative Work Culture", "cons": "Fast paced workplace", "position": "Policy Research and Analysis (Current Employee)", "date_created": "December 17, 2019"},
{"id": "1dqb6sqtuh46a800", "rating": 3.0, "text": "Lifeguarding is a good fit to get through university. Through my time with the City I watched the work environment gradually increase in micromanagement of employees' time. However not all personality types are suited to both interacting with the public, and teaching children to swim. It is a very involved job.", "pros": null, "cons": null, "position": "Lifeguard/Instructor (Former Employee)", "date_created": "November 22, 2019"},
{"id": "1dpsl2gmvh3q5802", "rating": 4.0, "text": "The salary is great and the co-workers and supervisors are very friendly. It is a place that one can develop his or her career. They organised internal training for staff at all times.", "pros": null, "cons": null, "position": "Project Manager (Current Employee)", "date_created": "November 17, 2019"},
{"id": "1dps7g5m7h3mg800", "rating": 1.0, "text": "First 6 years were exciting.  Alot of various jobs.  Management was a bit much.  They throw away thousands of dollars away on poor ideas from city hall,  and nickle and dime employees.  Poor leadership and low moral was a huge problem.  Worked there for 18 years.", "pros": null, "cons": null, "position": "Labourer (Former Employee)", "date_created": "November 17, 2019"},
{"id": "1dpgmmes5h3q2800", "rating": 4.0, "text": "Good place to work. Relaxed and slow paced but has a lot of projects and meetings. very secure job with lots of benefits. would Highly recommend having a permanent job here.", "pros": null, "cons": null, "position": "Internship (Current Employee)", "date_created": "November 12, 2019"},
{"id": "1dp48ucakh41o802", "rating": 2.0, "text": "I worked for 6 years as a para transit bus driver.  It was extremely difficult job to be good at.  The schedules were virtually impossible to keep up with.  Dealing with clients with physical and mental issues can be a very scary thing.  Management did not back the drivers ever when there were complaints from clients.  High stress", "pros": null, "cons": null, "position": "Para transit bus driver (Former Employee)", "date_created": "November 7, 2019"},
{"id": "1dosntijph3ph803", "rating": 5.0, "text": "The  City of Saskatoon is a excellent place to work  the wages are decent and a chance for advancement  the management is alright if competent. Some are and some aren’t!", "pros": null, "cons": null, "position": "Supervisor (Former Employee)", "date_created": "November 4, 2019"},
{"id": "1doeqms3bh3p9802", "rating": 5.0, "text": "it is a great place to work everyone is so nice everyone suports each other and encourages one another it is nice to learn something every day you work", "pros": null, "cons": null, "position": "Labourer in Parks Department (Current Employee)", "date_created": "October 30, 2019"},
{"id": "1doeeqnaih3t9803", "rating": 4.0, "text": "I work at the sign shop which is a very nice and relaxed environment to work. the people are good and the supervisors are great, supportive and helpful.", "pros": null, "cons": null, "position": "Sign Shop Associate (Current Employee)", "date_created": "October 30, 2019"},
{"id": "1dn0fadu8h3p0802", "rating": 5.0, "text": "City of Saskatoon provides work opportunities and strong platform for enhancing professional careers. Enforce to balance personal as well as professional life.", "pros": null, "cons": null, "position": "Programmer Analyst (Current Employee)", "date_created": "October 12, 2019"},
{"id": "1dlarq3nj24ec000", "rating": 4.0, "text": "-Go out and make sure things are running smoothly in the city. \r-Get jobs for the day and complete them.\r-All depends on where you are and what you are doing for the day, but it usually is relaxed and not stressful.", "pros": null, "cons": null, "position": "Seasonal Laborer (Former Employee)", "date_created": "September 21, 2019"},
{"id": "1dkttuhb024e1001", "rating": 4.0, "text": "The parks division is very unorganized making day to day work sometimes difficult. The workplace was overall decent making days go by quickly, the hardest part of the day was just getting to work.", "pros": null, "cons": null, "position": "Seasonal Labourer (Current Employee)", "date_created": "September 16, 2019"},
{"id": "1dke71tdi24fr000", "rating": 4.0, "text": "The environment was good, the people were great, the job was fun. The only problem was the hours were minimal because it was teaching kids how to skate and it was on the opposite side of town as me. So going all the wa over there for 4 days of the week for an hour - an hour and a half at a time was not worth it. No problems with management or the job. Good for people who are on that side of town and are looking for a first job.", "pros": null, "cons": null, "position": "Learn To Skate Instructor (Former Employee)", "date_created": "September 10, 2019"},
{"id": "1dk634dalh3kg800", "rating": 2.0, "text": "Don't ever be late. Don't get sick too often. Certainly don't care about your job because that isn't what they want. Do what you're told and never show initiative. as far as your co-workers go you're either in the in crowd or you're not. not a good place for anyone with a mental disability.", "pros": null, "cons": null, "position": "labourer (Former Employee)", "date_created": "September 7, 2019"},
{"id": "1dk1kq4qsh40l800", "rating": 4.0, "text": "The people, work, and training is well implemented with opportunities for advancements. Would still be working there, however due to relocation to Winnipeg, was not able to stay..", "pros": null, "cons": null, "position": "Clerk-Steno (Former Employee)", "date_created": "September 5, 2019"},
{"id": "1djun6mkp24gj004", "rating": 4.0, "text": "Very fun and a site manager as the job duties were vast and never had a dull moment.  City workers are always treated well and the compensation is fantastic.  Only con would be that it is unionized.", "pros": null, "cons": null, "position": "Site Manager (Former Employee)", "date_created": "September 4, 2019"},
{"id": "1dgviritvh41q80k", "rating": 4.0, "text": "time management is a major task at this employer, working a lot of hours and split shifts are required. working alone and handling many different situations during your shift while working and dealing the public are the major factors in this job.", "pros": null, "cons": null, "position": "Transit Operator (Current Employee)", "date_created": "July 29, 2019"},
{"id": "1dd71nkgnb8ba800", "rating": 4.0, "text": "With the amount of leisure facilities in the city, this is an awesome job for a person who doesn't like to stay in one place for long periods of time.", "pros": null, "cons": null, "position": "Lifeguard/Instructor (Former Employee)", "date_created": "June 12, 2019"},
{"id": "1fvt2eklq309c002", "rating": 4.0, "text": "I enjoy working here and like that your home every night. Has good benefits and decent pay. Good work environment. Made some friends here and supervisors are helpful. ", "pros": "4 ten hour shifts", "cons": "Working in extreme conditions", "position": "Heavy Equipment Operator (Former Employee)", "date_created": "April 5, 2022"},
{"id": "1dap7hk71h45h800", "rating": 5.0, "text": "Excellent place to work while on my work placement program, just unfortunate there was no job guarantee. Lots of work to be done, no real sense of urgency strangely enough", "pros": null, "cons": null, "position": "Custodian (Former Employee)", "date_created": "May 13, 2019"},
{"id": "1da2bh2u0h3l3800", "rating": 5.0, "text": "I started in the city of Saskatoon as a temporary labor. I had all the college qualifications to become the plant operator. The management were very helpful in keeping me informed about all the certifications i should acquire in order to apply for the job in operations at the water or waste water treatment plants. When the opportunity arrived I had everything ready to be a successful candidate. I worked both at the water and waste water treatment plants in the city of Saskatoon and my experience was simply put awesome.", "pros": "Great opportunities within the city, great work culture, provides safe workplace.", "cons": null, "position": "Assistant plant operator (Current Employee)", "date_created": "May 4, 2019"},
{"id": "1d73u6cvl1d18000", "rating": 5.0, "text": "I was brought on board for specialized duties. The diversity team saw that i had knowledge that could be utilized in entering data to the employee database over a period of 9 months. I was invited to my schools career fair workshop for the city of Saskatoon as a working example for after training. I did the first screening for the temporary seasonal recruitment process from start to completion.", "pros": null, "cons": null, "position": "Secretary II, Human Resources (Former Employee)", "date_created": "March 29, 2019"},
{"id": "1d5vh11q524gv000", "rating": 4.0, "text": "23 years serving the city was a  career\rliked the regulars on a daily bases\ra growing city environment\rco-workers \rsocial events put on by the transit social", "pros": "serving the city", "cons": "winter driving", "position": "Transit Operator (Former Employee)", "date_created": "March 14, 2019"},
{"id": "1d5pf2ae9b84n800", "rating": 1.0, "text": "Working for the city is stressful.  They are bullies. They lie,  threaten and bully their employees.  They will go as far as making up pages of lies to have you suspended.", "pros": "Pay, benefits", "cons": "Management makes up lies bc they love to bully people, no one knows what they are doing. Complete joke.", "position": "Operator/Driver (Former Employee)", "date_created": "March 12, 2019"},
{"id": "1d3jojkioakgi800", "rating": 5.0, "text": "I loved working for the City of Saskatoon as well as the YWCA.  I was treated very well.  The focus was on client satisfaction as well as staff learning and wellbeing.", "pros": "variable shift options", "cons": null, "position": "Life Guard/Swim Instructor/aqua-fitness instructor (Former Employee)", "date_created": "February 13, 2019"},
{"id": "1cvvtam3s1ahe000", "rating": 4.0, "text": "Great place to work, pay is good. Safety is up to standard. Sometimes management seems disconnected with regular staff but it only hinders departments rarely.", "pros": "Good pay", "cons": "Bad culture", "position": "Irrigation Technician (Current Employee)", "date_created": "December 30, 2018"},
{"id": "1ctim8u6has3a801", "rating": 5.0, "text": "Regular Rotating Workload. Clerical support and customer inquiries are handled by phone and in person. In this department building and plumbing permits are processed for both commercial and residential projects.", "pros": null, "cons": null, "position": "Clerk (Current Employee)", "date_created": "November 30, 2018"},
{"id": "1cs9eqbhhakej800", "rating": 5.0, "text": "Only thing bad about working for the Parks Dept. is most jobs are only seasonal...Management does not always listen to employees..The part i like most about working for the city is that i ;earned to operate different types of equipment.", "pros": "Good Place to work", "cons": "Not full-time", "position": "Equipment Operator/Labourer (Current Employee)", "date_created": "November 14, 2018"},
{"id": "1crgp4oa9ake6800", "rating": 4.0, "text": "my day is pretty simple I work by myself and I pick every garbage container that is out on my route. the hardest part of the job is actually getting to know the routes its easy when u drive the same truck every week", "pros": null, "cons": null, "position": "ULTITY COLLECTION OPERATOR (Current Employee)", "date_created": "November 4, 2018"},
{"id": "1cr39ckqlak72800", "rating": 2.0, "text": "all the joy is stripped from management.  It is micro managed to a point where days off were denied because the manager didn't want to do the paperwork.", "pros": null, "cons": null, "position": "Credit & Collections Representative (Former Employee)", "date_created": "October 30, 2018"},
{"id": "1cquv6o7hak6v800", "rating": 3.0, "text": "With overtime a lot of money can be made with the City but there is little incentive to improve or even care at all about your work. Extremely little accountability and promotions seem to go to the worst possible people. It's okay for a short while but I wouldn't stick around too long.", "pros": null, "cons": null, "position": "Engineering Technologist (Former Employee)", "date_created": "October 28, 2018"},
{"id": "1cq5h55v7ak6j800", "rating": 4.0, "text": "Love my job as an operator. Duties are flexible as you can go from operating equipment to helping out with horticulture duties. Just wish that there were more full time positions available in my department.", "pros": null, "cons": null, "position": "Labourer/Operator (Current Employee)", "date_created": "October 19, 2018"},
{"id": "1coer0t1aakh9800", "rating": 4.0, "text": "Inclusive and positive work environment. Has a union and follows union standards. Management can be mildly disorganized but is overall successful. More promotion of the branch's services at schools and public places could improve attendance at summer youth centers. Enjoyable people to work with.", "pros": "inclusive work place", "cons": "mild struggles with organization and timelines", "position": "SUMMER PLAY PROGRAM LEADER (Former Employee)", "date_created": "September 27, 2018"},
{"id": "1cjr764a90mt75uc", "rating": 2.0, "text": "Union based.  Quotas are really low to achieve and exceeding them gets you in trouble.  Lost my job because I wanted to excel.  Let go days before my 3 month period was almost finished so they could fire me with no cause.", "pros": null, "cons": null, "position": "Accounting Clerk (Former Employee)", "date_created": "August 1, 2018"},
{"id": "1cjog9nvq1ba30ac", "rating": 3.0, "text": "A typical day at work for me would be to arrive at 8:09 and work on work that has been assigned to me throughout the day. Some of the work I do is research on projects, which I do enjoy. I do not get to interact with the public as much in my job as I did in previous positions. I miss this a lot as I like to work with others and help and guide them. \r Typically, throughout the day, I  will take breaks often to get away from the computer. Sitting is too hard on the body and being an active person like myself, I need to move around a lot. \r The work I do is very interesting as it deals with managing the assets of the City. I never realized how much Infrastructure we have in our City. Maintaining this Infrastructure is important as we need to have make sure the services we offer are in good working condition.\r Everyday, I am very glad to be part of the team.", "pros": "EDO get off every third Friday", "cons": "The work place culture, not every is accepted.", "position": "Infrastructure Analyst (Current Employee)", "date_created": "July 31, 2018"},
{"id": "1cit8brk7brd4f54", "rating": 5.0, "text": "I had a fun filled day of meeting and working with new people in an upbeat and friendly environment. It was a long day but except for one or two instances we all seemed to work well together.", "pros": null, "cons": null, "position": "Issuing Deputy Returning Officer (Former Employee)", "date_created": "July 20, 2018"},
{"id": "1chvmhgm5akckfa0", "rating": 2.0, "text": "The city has lots of great people that care about the overall well being and delivery of services to citizens.  Unfortunately, the culture and work environment is toxic.", "pros": null, "cons": null, "position": "Manager Operations (Former Employee)", "date_created": "July 9, 2018"},
{"id": "1ccklltuoaqgp82d", "rating": 5.0, "text": "While this is not where I chose to work for the rest of my life as I find myself more suited to the IT field, the 3 years I spent there were amazing. Absolutely great people. The required duties and assigned work were definitely fulfilling, and a good challenge at times. Working outside all summer long is a great experience that I will never forget. I highly recommend working for them if you are a student looking to make some extra cash, or even someone who is genuinely interested in horticulture and park maintenance. These people take their job very seriously and strive to upkeep the parks and garden areas for the citizens in the area.", "pros": "Staff breakfasts, full time hours, good benefits upon full time employment.", "cons": null, "position": "Parks Department Laborer and Equipment Operator (Former Employee)", "date_created": "May 3, 2018"},
{"id": "1cbfprpjkak4mf10", "rating": 5.0, "text": "Small office environment. Fun people to work with. Answered the phone. Gave directions to how to get to the office. Booked meetings for the boardroom.", "pros": null, "cons": null, "position": "Office Clerk", "date_created": "April 19, 2018"},
{"id": "1fvt2eklq309c002", "rating": 4.0, "text": "I enjoy working here and like that your home every night. Has good benefits and decent pay. Good work environment. Made some friends here and supervisors are helpful. ", "pros": "4 ten hour shifts", "cons": "Working in extreme conditions", "position": "Heavy Equipment Operator (Former Employee)", "date_created": "April 5, 2022"},
{"id": "1bs133l8db879fli", "rating": 4.0, "text": "Typical day:\rReviewing emails\rRunning scheduled tasks\rPrinting bills and invoices for the people of Saskatoon\r Many opportunities within the city for possible advancement.", "pros": "Availability of online training", "cons": "minimum of a Bachelors degree", "position": "Operations Technician (Former Employee)", "date_created": "October 9, 2017"},
{"id": "1bq0ongfjakdn8sc", "rating": 3.0, "text": "a typical day of work can consist of multiple rush sequences, everyone works as a team and works to better benefit each other and the company by selling and making profit for the business.", "pros": "$12.00 free lunch charge for each shift.", "cons": "Heated Kitchen, in one position for", "position": "A&W Staff Trainer (Former Employee)", "date_created": "September 14, 2017"},
{"id": "1bpfvtagkakdeb1q", "rating": 5.0, "text": "A very safety orientated place to work with high regard for their employees.  All safety equipment is provided by them. everyone is very friendly and willing to help you if needed.", "pros": null, "cons": null, "position": "Labourer (Former Employee)", "date_created": "September 8, 2017"},
{"id": "1bor9b1rfakd3ag0", "rating": 4.0, "text": "i loved the environment except one thing that I was working alone so my management will never able to know my abilities and they have to judge me on some random basis as they never worked with me physically.", "pros": null, "cons": null, "position": "Cashier (Current Employee)", "date_created": "August 30, 2017"},
{"id": "1bnp8e4o31aie5mc", "rating": 5.0, "text": "Great place to work, very organized with no room for half-effort(s).\rGreat management. Meetings are always productive/useful, as well. Ideal for full-time or shift-work.", "pros": "City Hall Cafeteria", "cons": "Equipment", "position": "Custodian (Former Employee)", "date_created": "August 17, 2017"},
{"id": "1bn7o0s2oak989t8", "rating": 4.0, "text": "You are always surrounded by excellent co-workers that are always ready to help out. The majority of customers are friendly and are excited to use city facilities.", "pros": null, "cons": null, "position": "Cashier & Receptionist (Available Part-Time) (Current Employee)", "date_created": "August 10, 2017"},
{"id": "1blr3undl1ahi2s2", "rating": 1.0, "text": "shift work, lots of physical labour, good people to work with all cultures, staff, patrons, good advancement if work good. cleaning decks, floors, exercise equipment, bathrooms", "pros": "get in shape", "cons": "job security", "position": "Pool Custodian lead hand/supervisor (Former Employee)", "date_created": "July 24, 2017"},
{"id": "1blf19q121ba825h", "rating": 5.0, "text": "Nice supervisor  and nice colleagues , enjoy my work ,help residents ,fix the road. Clean the city,park. Fix the back alleys   take obstacle away from  road", "pros": null, "cons": null, "position": "Labourer (Former Employee)", "date_created": "July 19, 2017"},
{"id": "1bk9ocab4akdcdc1", "rating": 5.0, "text": "This is a great job.  It is easy to work around my schedule.  Great people.  Easy to talk to.  Always nice to deal with new people that are taking there time to help out the Community they live in.", "pros": null, "cons": null, "position": "Instructor Placement Coordinator (Current Employee)", "date_created": "July 5, 2017"},
{"id": "1bfd05hhbaqghafu", "rating": 4.0, "text": "The hardest part of working for the City of Saskatoon was cleaning the pool with the vaccumn.\rArrived at work, empty the garbage, added chemicals to pool filter, janitorial work, event set up and clean up.\rThe most enjoyable part of the job was working and meeting with new people.\rManagment was always available whenever I had a question or concern.", "pros": "working outside", "cons": "getting up at 4 am", "position": "Custodian/Maintenance (Former Employee)", "date_created": "May 5, 2017"},
{"id": "1bf2ia2vu1d1307i", "rating": 3.0, "text": "It was very easy working with the city, but did not offer many rewarding challenges. It was hard to go to work knowing nothing I was going to do was going to be a challenge.", "pros": null, "cons": null, "position": "Labourer (Former Employee)", "date_created": "May 1, 2017"},
{"id": "1bbs62i88ak92f0i", "rating": 5.0, "text": "Normal working day except few days. More experience on how to intereact with the community/public and contractor. Ability to manage assigned project effectively. Hardest part of the job is when one have to work on various weather conditions. Workplace culture is wonderful. The most enjoyable part of the job is when one have to share experience with fellow colleagues.", "pros": null, "cons": "Normal working hours except few days", "position": "Engineering Technologist (Former Employee)", "date_created": "March 22, 2017"},
{"id": "1b8hndkefak4ucln", "rating": 3.0, "text": "they were ok.went threw alot of employees somrtimes they werent real organized but it was very fast paced work.ost part there were good people there.", "pros": "good work", "cons": "rain delays", "position": "Skilled Labourer (Former Employee)", "date_created": "February 9, 2017"},
{"id": "1b56dhl6c1ba271k", "rating": 4.0, "text": "This was one of my most enjoyable jobs, the job itself was great and the people were very fun to work with. I loved that there was multiple positions offered with guest services.", "pros": null, "cons": null, "position": "Guest Services Representative (Former Employee)", "date_created": "December 29, 2016"},
{"id": "1b3201gs61d0i4lh", "rating": 4.0, "text": "Hardest part of the job was almost always having an audience and getting orders from subordinates. Management was close minded and unwilling to listen to concerns", "pros": null, "cons": null, "position": "Maintain. Electrician (Former Employee)", "date_created": "December 3, 2016"},
{"id": "1b0om1dqnas0u92s", "rating": 5.0, "text": "Enjoyable place to work. Lots of breaks. Good management. The city focuses on safety. It is our number one priority. The job can take longer as long as everything is done safely", "pros": null, "cons": null, "position": "Laborer, Locations (Current Employee)", "date_created": "November 4, 2016"},
{"id": "1aulu170kas3590n", "rating": 2.0, "text": "Trusted with nothing, asked to do lowest level of work or sometimes nothing at all. Often sit on my hands during shifts because there are no duties to be done beyond minding the facility.", "pros": null, "cons": null, "position": "Recreation Technician (Current Employee)", "date_created": "October 9, 2016"},
{"id": "1arusdnkob823f07", "rating": 3.0, "text": "The desire to ensure the customer is always right above and beyond established policies and procedures creates a stressful work environment. The corporation as a whole also tends to be reactive instead of proactive", "pros": "Wage allows me to earn a decent living. My immediate supervisor is fantastic", "cons": "Lack of support from management", "position": "Clerk (Current Employee)", "date_created": "September 5, 2016"},
{"id": "1aji13gn9ak5rehd", "rating": 5.0, "text": "Overall good experience, typical union red tape, good pay, good benifits. However, once you understand the job, not much changes", "pros": "Double time OT", "cons": null, "position": "Engineering Technologist", "date_created": "May 24, 2016"},
{"id": "1ae0i2sco1ags6jf", "rating": 3.0, "text": "we are trustworthy have integrity and have respect for all employes and the general public.We have enough work that time goes by fast., not to many duties that you have to rush and make duties unsafe.We consentrate on work safty,an fesical well being.The city has great support system for all employes", "pros": "geat benifits and pension", "cons": "with shedualle hard to find 2nd job", "position": "custodian/maitence (Current Employee)", "date_created": "March 16, 2016"},
{"id": "1fvt2eklq309c002", "rating": 4.0, "text": "I enjoy working here and like that your home every night. Has good benefits and decent pay. Good work environment. Made some friends here and supervisors are helpful. ", "pros": "4 ten hour shifts", "cons": "Working in extreme conditions", "position": "Heavy Equipment Operator (Former Employee)", "date_created": "April 5, 2022"},
{"id": "1ab16f50bb87vb6e", "rating": 3.0, "text": "Easy work but with only 4 hours given per week or even 2 weeks this is super unsustainable for serious workers. The pay is slightly above average with decent benefits surprisingly.", "pros": null, "cons": null, "position": "Activity Leader (Former Employee)", "date_created": "February 8, 2016"},
{"id": "1aafd5bp6b83kegf", "rating": 5.0, "text": "Working outside and being involved with different Saskatoon communities was a lot of fun. I really enjoyed my time with the City of Saskatoon and would definitely work there again.", "pros": null, "cons": null, "position": "Labourer (Former Employee)", "date_created": "February 1, 2016"},
{"id": "1a5qcuuuras1keps", "rating": 5.0, "text": "Great place, job is not hard at all, great co-workers, flexible schedule, union membership, great work environment, health benefits", "pros": "Being a part of the union", "cons": "Not enough work hours", "position": "Building custodian (Former Employee)", "date_created": "December 5, 2015"},
{"id": "1a5kkaqpuas1kdcj", "rating": 5.0, "text": "A grat deal of work making sure the city is running well, devoid of hazards, accidents and problematic issues. Quick responce to arising issues be it natural or man caused.", "pros": "Get to know the city more and how things are handled.", "cons": null, "position": "Utility Operations and Staff (Former Employee)", "date_created": "December 3, 2015"},
{"id": "1a48c9r7tas0o8au", "rating": 4.0, "text": "Went out with surveyors to various contract sites around the city to ensure contractors were up to engineering standards. Mostly road-work, ensuring that sewer and storm pipes were put in place properly, but dealt with land development a little too.\rWell-organized, fun and casual workplace among the surveyors.", "pros": "discounts on civic centre memberships", "cons": "public are mildly hostile to city workers", "position": "Engineering Technician (Surveyor) (Former Employee)", "date_created": "November 16, 2015"},
{"id": "1a46on06p1d0v7f1", "rating": 5.0, "text": "Fun to be with all the other lifeguards and swimming teachers. need to be a good roll model for the public as we are always in public eye. always busy doing something, never a dull moment at any of the city facilities.", "pros": "Teamwork", "cons": "Nothing.", "position": "Full Time since Sept. 2011 (Former Employee)", "date_created": "November 15, 2015"},
{"id": "1a41jks1hak8m9eo", "rating": 4.0, "text": "I enjoy my current position at the city, the kinship I have  with coworker and supervisor makes my job easier and it is a great place to work.  The work that I do maintaining the water treatment is different on a daily bases as it could be as easy as emptying out the truck to working on the pump system.  I enjoy working for the city due to the advancement and training, it is just the salary.", "pros": "four ten hour shifts", "cons": "pay is not enough", "position": "Building and Groounds (Current Employee)", "date_created": "November 13, 2015"},
{"id": "1a39poev5as1fak1", "rating": 5.0, "text": "Summer job with the City of Saskatoon . cleaned up Shelter Belts , pruined trees and shrubs , cut hedges , maintained parks area, worked under no supervision.", "pros": null, "cons": null, "position": "Seasonal Fulltime Laborer (Former Employee)", "date_created": "November 4, 2015"},
{"id": "19pa9vfbtak57ejn", "rating": 5.0, "text": "I love my job and all the great people I work with.  However, I was hired for a Temp Position for 3 months.  I have been extended month by month with no sense of security.  I have been told by many (including my Supervisor that I'm doing a great job.  She said that she would love to keep me, if she could.  I have been applying for every position that I think relates to my experience.  I would really like to continue my employment here with The City of Saskatoon, I'm just feeling discouraged by the seniority, and hiring policies.", "pros": "Great salary, and EDO's", "cons": "Paying for parking everyday", "position": "Clerk Steno", "date_created": "July 3, 2015"},
{"id": "19p2uolk0ak90bpu", "rating": 5.0, "text": "The City of Saskatoon i s a great employer. They provide opportunities for advancement and have employees best interests in mind when creating programs. Flexible schedules make life easy to manage.", "pros": null, "cons": null, "position": "Customer Service Manager (Current Employee)", "date_created": "June 30, 2015"},
{"id": "19f410jq0ak8gb0q", "rating": 5.0, "text": "I learned new software for engineering Design. co-workers helped me lot initially to learn the work properly.I enjoyed lot to work with government projects.", "pros": null, "cons": null, "position": "Planning Technologist (Former Employee)", "date_created": "February 26, 2015"},
{"id": "198r8gdmmb80g8f4", "rating": 4.0, "text": "I really enjoyed my supervisors and co-workers. I had a lot of fun with them. Having the responsibility to be professional took its toll at times, as patrons expected different responses as I was inclined to give. Sometimes I did not receive adequate information on how to deal with certain situations, but in these times I had a respectful supervisor to aid me. All in all, a great work experience.", "pros": "Great supervisors, co-workers and atmosphere.", "cons": "Dealing with patrons at times deemed difficult.", "position": "Lifeguard/Swim Instructor (Current Employee)", "date_created": "December 10, 2014"},
{"id": "1976v2jooak4gada", "rating": 5.0, "text": "It was a valuable experience as an intern student to work with the city. Everyone at work was friendly and always willing to help or point me toward the right direction for it. The work environment and culture were great with some flexibility. It was an enjoyable and eye opening experience to talked to some of the senior engineers and learned from their experience.", "pros": null, "cons": null, "position": "Engineering Intern (Former Employee)", "date_created": "November 20, 2014"},
{"id": "18v31kr2c5n8gdhv", "rating": 4.0, "text": "4 day work week is awesome, good experience.\rgood people.\rlearned how to troubleshoot and read electrical drawings well.", "pros": "4 day work week", "cons": "Pay is sometimes lower than industry", "position": "Instrumentation Technologist (Former Employee)", "date_created": "August 11, 2014"},
{"id": "18nrlo6ckak4gahl", "rating": 1.0, "text": "I was moved around a lot with this company but it within the plant.", "pros": null, "cons": null, "position": "Building Custodian (Former Employee)", "date_created": "May 13, 2014"},
{"id": "18n71afgcak8gdou", "rating": 5.0, "text": "I worked for a good company good all around experience.  I learned a lot about different types of equipment how to change oil and grease them up my co-workers were friendly I worker by myself and always got my job done on time it was a good experience.", "pros": "close to my home", "cons": null, "position": "Labourer (Former Employee)", "date_created": "May 5, 2014"},
{"id": "18jjj76doak4g8dm", "rating": 4.0, "text": "City of Saskatoon allowed for me to build my skills in management to better further myself.  \rMy days varied - no day was the same with what was needed to be done.  \rThe management was not always clear as to what they wanted from their team.  \rCo-workers were great, often stressed and overworked.  \rThe hardest part of the job was the management \rThe most enjoyable part were the co-workers.", "pros": "Great Benefits and Wage", "cons": "Poor Management", "position": "Support Service Manager (Former Employee)", "date_created": "March 21, 2014"},
{"id": "18fbm0ufub84gbur", "rating": 5.0, "text": "I really enjoyed it the staff was friendly, I learn't how to paint and powder coat,and seeing the boss smiled", "pros": "overtime", "cons": "Long Hours", "position": "Painter (Former Employee)", "date_created": "January 27, 2014"},
{"id": "182ma2j9sak4gdjo", "rating": 4.0, "text": "9 to 5pm workday\rhow to be organized \rtime management\rvery friendly", "pros": "Free coffee", "cons": null, "position": "Receptionist (Former Employee)", "date_created": "August 23, 2013"},
{"id": "17vjtddupb80g9ue", "rating": 4.0, "text": "I made my owe work ,I learned, see a need , then fill that need.Your  job will be a lot more fun.Management they worked hard ,very political,not much fun for them.The workers where the full range, very good to useless.the hardest part is  the politics.Allways learning.", "pros": "verry secure", "cons": "to many jobs at one time. fractured.", "position": "lead arborist  /trainer (Former Employee)", "date_created": "July 16, 2013"},
{"id": "1fvt2eklq309c002", "rating": 4.0, "text": "I enjoy working here and like that your home every night. Has good benefits and decent pay. Good work environment. Made some friends here and supervisors are helpful. ", "pros": "4 ten hour shifts", "cons": "Working in extreme conditions", "position": "Heavy Equipment Operator (Former Employee)", "date_created": "April 5, 2022"},
{"id": "17moq4k8o5n8gckh", "rating": 5.0, "text": "my job duties differed day to day . i learned alot of different things and had good experiences with the city. i enjoyed working with people in the city and hope to work there again", "pros": "safety", "cons": null, "position": "labourer (Former Employee)", "date_created": "March 28, 2013"},
{"id": "17gejklmmadsgcnh", "rating": 5.0, "text": "A typical day at work for the city of Saskatoon starts at 7 am and ends at 4:04 pm. It starts off with a tool box meeting and orders given out on what our duties are for the day. We are usually assigned with partners to work with and the jobs could be in any part of the city with whatever machine we may be alotted. Every day is a learning experience for example, learning how to use machinery in a landscaping operation. As for management, they are very good and knowledgable. They are always on hand if we need assistance or are in need of anything. All the co-workers get along and if anything did come up the supervisors and their higher-ups are on it right away.The hardest part of the job- well their is no hard part as long as you know what you are doing and enjoy it. I enjoy operating.", "pros": null, "cons": null, "position": "Equipment Operator, labourer (Former Employee)", "date_created": "January 8, 2013"},
{"id": "178kt2e5h4dsg92n", "rating": 4.0, "text": "Worked with plants and in horticulturegood managementgood co-workersgreat summer job", "pros": null, "cons": null, "position": "Laborer for Horticulture North West (Former Employee)", "date_created": "October 3, 2012"}
]