[
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1giin57fghbiv800", "rating": 1.0, "text": "edmoton transit is one of the worst places i have worked in Canada, you have no respect, no decent schedule, no social life, no family life, if you don't work overtime you don't make enough to survive, and if you do just the required you be begging friends for money. most of the people you will see working have side businesses like realtor, RCIC consultant, insurance and other things with using city for just the benefits, now having a brown nose slowhi at the helm, ETS is destined to be doomed. union is also a brown nose policy and its always the same s#!t who get elected. evern you get told who to vote for now.  ", "pros": null, "cons": null, "date_created": "November 23, 2022"},
{"id": "1gi6dhs6ch21s800", "rating": 4.0, "text": "As a casual part-time, the management does not understand the needs of a student with a work-life balance.  My manager is extremely old school and looks for discipline every time something happens.", "pros": null, "cons": null, "date_created": "November 18, 2022"},
{"id": "1gi37l2ibi47n800", "rating": 3.0, "text": "I worked as a zookeeper for 4 years. The work environment was toxic. Supervisors bullied staff. a lot of people left due to stress and burnout. the job itself was wonderful and rewarding but the management was horrible. From what I hear, not much has changed in the 10 years since i've been there. ", "pros": null, "cons": "toxic work environment", "date_created": "November 17, 2022"},
{"id": "1ghrn2vv3kp3s801", "rating": 5.0, "text": "Great place to work, Good work life balance and perfect for gaining experience. Helpful work environment with really wonderful staff. The work culture was welcoming and big on team work. ", "pros": null, "cons": null, "date_created": "November 14, 2022"},
{"id": "1ghrermfj28f0000", "rating": 5.0, "text": "I loved working with City great team but busy work place not lot time to have fun but they do have once a month fun activities but limited as I was in payroll had pay close ever other week.", "pros": null, "cons": null, "date_created": "November 14, 2022"},
{"id": "1ggaktjf3i425802", "rating": 1.0, "text": "Part time employees have no benefits, no security, and are not valued. To become a permanent employee is through association alone. There is no accountability for gross mismanagement. Management treat workers like trash, they do not listen or respond to serious safety issues. There is no safety culture, and the trainers are not competent. ", "pros": null, "cons": null, "date_created": "October 26, 2022"},
{"id": "1gg8ggcb4hal3800", "rating": 3.0, "text": "Nothing special. Just worked there over the summer. There's about 10 games at the football game and I just did what was needed. Occasionally there would be concerts so I got to watch those which were cool.", "pros": "Watch games and concerts free", "cons": "Standing a lot", "date_created": "October 25, 2022"},
{"id": "1gfv1ddlkhal3800", "rating": 5.0, "text": "The city of Edmonton provides every employee with competitive wages and excellent training. As an operative employee, I had training beyond what was needed for my posting to ensure I was engaged and included.", "pros": "Top 75 employers 2021; I enjoyed it.", "cons": "Union vs. Corporation drama", "date_created": "October 22, 2022"},
{"id": "1gfru0ha8gbu2802", "rating": 5.0, "text": "fun place to work but a little strict at times. they need to think more about giving employees more benefits and to take better acre of them these days", "pros": null, "cons": null, "date_created": "October 20, 2022"},
{"id": "1gcv53rhn2p30000", "rating": 4.0, "text": "Decent pay for work achieved, it was hard to get a permanent contract due to Union Rules. I enjoyed two of the teams I worked with. My manager tried to get me a perm placement but it was impossible due to covid layoffs.", "pros": null, "cons": null, "date_created": "September 14, 2022"},
{"id": "1gcsn9pjoi41v802", "rating": 4.0, "text": "Great atmosphere to work in !!! The employees are what make this a great place to work you can have fun all day on the job and still get the work done and everybody gets home safe", "pros": null, "cons": null, "date_created": "September 13, 2022"},
{"id": "1gcqdkgshmjgp800", "rating": 3.0, "text": "The City of Edmonton pays extremely well, however the management is getting increasingly toxic. Too many managers, frequently hiring their friends, forcing them to make up projects and initiatives to justify their jobs - at the expense of people who actually work in the field. Total disconnect between management and field workers.Increasingly moving away from full time jobs to \"11 month postings\" to ensure they don't have to give benefits and can drop you without justification.Potential advancement is blocked by education and accumulating seniority - almost no emphasis placed on merit.", "pros": "Excellent pay, good work life balance", "cons": "Toxic management, disconnect from upper management and workers in field. No value for hard workers.", "date_created": "September 12, 2022"},
{"id": "1gcf92106i9js801", "rating": 2.0, "text": "Poor managementHad inexperienced people in positions which made the job twice as hard because of baby sitting or having to do your job as well as theirs and looking over your shoulder because they are friends with management.", "pros": "None", "cons": "Poor job investigations and big favoritism.", "date_created": "September 8, 2022"},
{"id": "1gbv71pt9ltfc801", "rating": 4.0, "text": "I had a good experience, the on boarding process is on line, time consuming and you’re not paid for it so that’s a downfall. Unpaid training. Working there was great otherwise. Co workers were good people and the job itself was fun to do. ", "pros": null, "cons": null, "date_created": "September 2, 2022"},
{"id": "1gapsv7dokc2k800", "rating": 5.0, "text": "Decent job security if you can manage to secure a permanent position with the City. City work is unionized so you will always have work-life balance. Pay is fair with industry standards. ", "pros": null, "cons": null, "date_created": "August 18, 2022"},
{"id": "1gams8dpvkc0q800", "rating": 4.0, "text": "Contract work is great as a foot in the door, however it is very hard to get job security and peace of mind. A large organization like the City of Edmonton should do more to keep the people they hire.", "pros": null, "cons": null, "date_created": "August 17, 2022"},
{"id": "1gacakb72llq9800", "rating": 4.0, "text": "Fun job while in university, only stressful thing was report cards and parents. Teaching kids was fun. Got to use skills learned in WSI to make a difference.", "pros": null, "cons": null, "date_created": "August 13, 2022"},
{"id": "1ga96j0c8llq9801", "rating": 4.0, "text": "Overall good, a big organization that is trying to make major changes.  This puts lots of extra work on everyone.  Senior management is trying to take care of staff.", "pros": null, "cons": null, "date_created": "August 12, 2022"},
{"id": "1g9bmsvsf25ed002", "rating": 1.0, "text": "Management doesn't care about their employees and their management strategy needs a lot of work. If you want further opportunities you need to become a favorite and a yes man. They go against union rules all the time and penalize those that speak up when it occurs.", "pros": null, "cons": null, "date_created": "July 31, 2022"},
{"id": "1g7pq0f41isbk802", "rating": 3.0, "text": "Lots of time off. The pay floor is good. Ceiling isn’t great. Management sometimes gets in the way of employees decision making. Over all a decent place to work if you don’t plan on becoming rich. ", "pros": null, "cons": null, "date_created": "July 12, 2022"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1g73omg1lhbjm802", "rating": 1.0, "text": "Terrible place to work. Management is unleashed and can do whatever The rules is only for union employees. Union is not very helpful because of the hands tight.", "pros": null, "cons": null, "date_created": "July 3, 2022"},
{"id": "1g6lmc26nioll801", "rating": 3.0, "text": "Worked there for a little bit, wasn’t all bad, wasn’t all great. Some supervisors are good some aren’t. The workload is manageable and the pay was good ", "pros": null, "cons": null, "date_created": "June 28, 2022"},
{"id": "1g5i73v6bk2ki802", "rating": 4.0, "text": "Great place to work. Lots of growth opportunities   Fair pay. Constant improvement and service excellence is foundation of culture. Excellent benefits and access to health programs ", "pros": null, "cons": null, "date_created": "June 14, 2022"},
{"id": "1g5hac8bc2aq8000", "rating": 2.0, "text": "If you are the one who brings results, you will have to work continuous overtime. But no appreciation or recognition. You will have to do 3 person's work and your work result will be someone else's. No transparency and honesty in Senior Management. Many inexperienced and incompetent Senior Managers but over compensated. Diversity and Inclusion is the only policy.", "pros": null, "cons": null, "date_created": "June 14, 2022"},
{"id": "1g4c5esp2t5ks802", "rating": 4.0, "text": "Experience will vary a lot by the team. You can learn new things and work with some new tech, but may also be stuck woth some outdated software. Management is all over the place. Overall it is OK.", "pros": null, "cons": null, "date_created": "May 30, 2022"},
{"id": "1g3pk6tj4jtd8801", "rating": 1.0, "text": "Very abusive environment and too much management.  Too many back stabbers trying to get into a management position so they do not have to do anything. Could not possibly make friends as there are too many unhappy employees ", "pros": "none", "cons": "no life", "date_created": "May 23, 2022"},
{"id": "1g3iiqe61k568800", "rating": 5.0, "text": "Great people, great union, wish there was a better opportunity for full time permanent employment... I enjoyed working for the City of Edmonton.. Great City Awesome Hockey Team too.. Go Oilers................................", "pros": "Half hour lunch", "cons": "No permanent employment opportunities", "date_created": "May 21, 2022"},
{"id": "1g3592b3ht5rr802", "rating": 5.0, "text": "10 hour days 4 days a week wasn't bad, just some of my co workers were lazy or thought they were managers because they were older. You pay into a union with No benefits or pension or job security and you pay into a charity that is non negotiable but the pay was pretty good ", "pros": "Pay was good", "cons": "Co workers were lazy and rude", "date_created": "May 15, 2022"},
{"id": "1g31m1b2ni6i5801", "rating": 1.0, "text": "Worked for the city for 7 years. I would never recommend working for the city period. Management don't know what there doing there not educated enough to see problems happening right in front of there eyes. They sit I. The office doing nothing and have no understanding of the work place. There's absolutely no security unless you can get full time Union sucks bigger than the city. where you pay Union and nothing will ever happen if it ever comes to needing your union union will not back you up unless you're full-time and don't work the winter because it sucks even more than the summer. . Not recommended this place this review the city controls in what I real want to say about the city. And names I would love to share but city will not let me post stuff that really happens behind the closed doors", "pros": null, "cons": null, "date_created": "May 14, 2022"},
{"id": "1g2oiom3lo25j800", "rating": 4.0, "text": "Good pay. Good pension. I enjoy working for the city. There is really good job security.  Dealing with people all day can sometimes be a drag. If you want to progress and move up there is opportunity for that ", "pros": null, "cons": null, "date_created": "May 10, 2022"},
{"id": "1g1n2u0cio1cp802", "rating": 3.0, "text": "Management is the shortfall with the City. Pay and Benefits are good once Permanent Status is achieved. Lots of talk about Contracting out. Stats plus Days in Leiu of off!", "pros": null, "cons": null, "date_created": "April 27, 2022"},
{"id": "1g0cs3ca4t4i2800", "rating": 2.0, "text": "Safety meeting in morning, get to your equipment, circle check, get to work.  The hardest part, was not always on the same run, so had a hard time learning the run", "pros": "Good people in our group. Lots of laughter.", "cons": "No Benefits.", "date_created": "April 11, 2022"},
{"id": "1fuap39pqms9p800", "rating": 4.0, "text": "I worked hard and enjoyed my co workers.We got to know all about each other and why the city needs to employ more people to keep our roads and parks safe and clean", "pros": null, "cons": null, "date_created": "March 16, 2022"},
{"id": "1fu0fckvmu3em802", "rating": 3.0, "text": "okay place to work. would try to find something with better pay. you are just a number here but you dont have to really care too much about the job. really hard to get in and land a perm posting. ", "pros": "very low stress", "cons": "no responsibility", "date_created": "March 12, 2022"},
{"id": "1ftrt0o8jm6j7802", "rating": 4.0, "text": "Strong union presence which at times can be frustrating but the job security is nice. Room for mobility but you need to be willing to take some less desirable shifts. ", "pros": null, "cons": null, "date_created": "March 11, 2022"},
{"id": "1fru39e4nm6il800", "rating": 1.0, "text": "Private company the best choice over this job. Here you are expected to work for free - stay late but never leave before 4:24- unpaid lunch and no breaks- eat on the run,You are expected to work for free to have the privilege to work for city- does no pay to work harder and killing time is the norm.Stay clear- ", "pros": "Higher than average pay and benefits-", "cons": "No promotions, and no OT, expect you work for free or shorthand because it is a City job", "date_created": "February 15, 2022"},
{"id": "1fqcm3nrvosjg800", "rating": 3.0, "text": "Its a toss up. You might love it. You might hate it. Depends on where you end up you m8ght find yourself satisfied or might find yourself losing ambition and passion for your job. Merit has no merit. Qualifications mean nothing if your a minority or trans or female. But.. it puts food on the table", "pros": "Work life balance.", "cons": "Management and politics are unbearable at times", "date_created": "January 26, 2022"},
{"id": "1fol2of5hsa9a802", "rating": 5.0, "text": "Fantastic place to work. Management is supportive and encourages collaboration while still ensuring the team has the resources to succeed. Extremely supportive throughout the pandemic to allow WFH.", "pros": null, "cons": null, "date_created": "January 5, 2022"},
{"id": "1fo8qkffdp13f800", "rating": 5.0, "text": "I worked in a warehouse for ETS and it was a good place to make a decent living. Wages were great for the roles (this was a union shop) and management was OK. Floor employees were mostly hard working, but there were a few union sleazebags just like anywhere else. ", "pros": "Great pay and benefits Relaxed work environment", "cons": "Shift work is not my cup of tea", "date_created": "December 31, 2021"},
{"id": "1fnpm8msco2ef802", "rating": 3.0, "text": "Working at the City of Edmonton truly depends on the group you work in and the team around. Unfortunately, a few rotten apples spoil the bunch. If you are fortunate enough to work on a solid team ... congratulations. ", "pros": "Not long hours.", "cons": "Constant indoctrination.", "date_created": "December 25, 2021"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1fnlsjhvjo2ef801", "rating": 1.0, "text": "Wages are far below average due to deductions. Extremely micromanaged no planning of work flow Safety culture is very weak Very weak leadership on all levels", "pros": "Some good techs but little teaching goes on.", "cons": "Terribly managed no flow of work and very clicky.", "date_created": "December 24, 2021"},
{"id": "1fmj48sdcsa96800", "rating": 3.0, "text": "Most of the people at the City are dedicated and hard-working public servants, but I feel we are continually let down by senior management. Constant re-organizations over the last five years and near-annual budget \"adjustments\" (i.e. cuts) have led to burnout and poor morale. Senior management does a poor job of supporting and advocating for their employees.  Experiences vary widely depending on what department / branch people are working in. Little to no prospects for advancement - senior management seems intent on hiring from outside for anything Director level and up.Out-of-scope (non-union) employees have had a pay freeze for years and mediocre benefits compared to unionized employees.  The trade-off  in accepting lower compensation is supposed to be stability/job security and work/life balance, but the last few years have seen threats to jobs and people being asked to do more with less.If you are fortunate to have a good team, you will enjoy the work.", "pros": "Interesting and fulfilling work, Collaborative approach in most business areas, Good horizontal integration, Most employees are dedicated and hard-working", "cons": "Mediocre Benefits for non-union employees, Political environment, Absolutely no perks (bring your own coffee pods), Poor vertical communication", "date_created": "December 10, 2021"},
{"id": "1fmipldbro1i9800", "rating": 3.0, "text": "It was too chill and non chalant. The management was poor. They do not have a clue or proper training on how to mage employees. Not many people used the parks so you'll be bored a bit. But your supervisor would expect you to be working like there was a crowd.", "pros": null, "cons": null, "date_created": "December 10, 2021"},
{"id": "1fknaqorvsa8i801", "rating": 5.0, "text": "Definitely a good place to work there’s room for advancement and lots of good people throughout the company aswell as nice lease trucks and supportive supervisors", "pros": "Pays well", "cons": "Lots of walking", "date_created": "November 17, 2021"},
{"id": "1fhv4i8hmnpll800", "rating": 1.0, "text": "Everyone is concerned about how they look to their superior. Quality of work comes second. Nepotism is a huge problem  at the city of Edmonton. Hours are horribly scheduled. They give you just enough so that you do not get shift differential. Probably why everyone quit.", "pros": "Do whatever you want", "cons": "Work till 3 am most nights and they won't even give you 40 hrs a week which is why I quit.", "date_created": "October 14, 2021"},
{"id": "1ffigj8cboc8k802", "rating": 3.0, "text": "There are problems there but they are trying to resolve them.Where I worked, my coworkers were excellent, my internal clients were respectful, and the leadership was generally competent and acknowledged my expertise.", "pros": null, "cons": null, "date_created": "September 14, 2021"},
{"id": "1fe7un21vt4d3801", "rating": 1.0, "text": "Management is not respectful of the employees despite preaching how the City is a respectful workplace. They are backward thinkers, management heavy and are going backwards regarding work life balance. It's like working in the 1970's.", "pros": "Salary is good", "cons": "Hours about to increase, earned days off about to be removed and too many managers", "date_created": "August 28, 2021"},
{"id": "1fbte9ppgpib1800", "rating": 2.0, "text": "If you’re worried about the city of Edmonton wasting your tax dollars at every turn you are right to worry. The bureaucracy is unparalleled and the laziness and incompetence deeply rooted.", "pros": "Wages", "cons": "Management", "date_created": "July 30, 2021"},
{"id": "1f8h7cb4qs7nm800", "rating": 1.0, "text": "The city is moving to 40 hour w/week with no EDO program eff Jan 2022.  They tout themselves as an equal work life balance employer.  I guess no more.  It was a great program and really helped those with young and extended families and those with medical needs.   Although you have job security there is little to no advancement if your not liked through the grapevine.  Believe me managers talk.  They say there is growth but nothing happens in certain areas.  A lot of processes are changed without employee input and it's frustrating to fix things and find work arounds.  Department hiring has to be approved by the ELT (Executive leadership team) and they are more worried about their bonus than hiring.  Overtime is expected but not paid or rewarded. It's an attaboy reward.  Most people skip breaks and work past in order to keep things afloat.  When the hours change, and the EDO program is removed.  It will be a a horrible place.  And many of those unhappy now will leave.  It will go from an okay place to an awful place to work.  ", "pros": "Current work hours and EDO program", "cons": "40 hour work week starting Jan 2022, End of EDO program, management too busy to care", "date_created": "June 18, 2021"},
{"id": "1f1f7d3oooch2800", "rating": 5.0, "text": "Enjoyed my job as well as the people. Being a senior employee it was gratifying to  pass on my knowledge and experience to the younger person that will be filling my boots as I am moving on. Will miss you.All the power to ya! Your friend +Ex-coworker. MIC.", "pros": null, "cons": null, "date_created": "March 23, 2021"},
{"id": "1f0mqavcbnpl8800", "rating": 5.0, "text": "As a recreation technician you most likely will be sent to a site to work by yourself. If you're into team work and used to collaborating this can be a difficult shift but you have weekly meetings with the your coworkers and visits from your supervisor so I got used to it. I loved working for the city. My job made me feel like i was making a difference", "pros": null, "cons": null, "date_created": "March 13, 2021"},
{"id": "1ev084vndnpna800", "rating": 2.0, "text": "the managers try to catch you making a mistake vs supporting you - & there is no recognition of your accomplishments- a sick day is considered an 'incident'if you do take a medical leave and go on modified duties, they ignore your Dr.'s reccomendations for any limitations they punish you for being ill or injured", "pros": "easy job especially if you are a people person & love to drive", "cons": "poor support from operator control centre when medical or security incidents occur on the bus", "date_created": "February 20, 2021"},
{"id": "1ett46t3kosn9800", "rating": 4.0, "text": "The work is both challenging and rewarding. Managers are self serving and always looking to find faults. Training is very good leaving no doubts in your mind what is expected.", "pros": "Good pay and co workers great training.", "cons": "Dealing with ungrateful public", "date_created": "February 6, 2021"},
{"id": "1er9s8dg2o2gs800", "rating": 4.0, "text": "Fellow workers were some of the nicest people I ever worked with! There was issues with management when it came to siding with public irregardless of whether the incident was the fault of the operator or not. The operators were always were hesitant to approach Inspectors as they tend to fault find instead of giving corrective criticism Or praise.", "pros": "Great training and benefits", "cons": "Constantly wary of being spied on", "date_created": "January 5, 2021"},
{"id": "1eqj0gbdco2gs800", "rating": 1.0, "text": "Was a great place to work before new vision. Now is filled with fake idealistic under achieving liberal communist values.  Employees are now paranoid and only care about themselves.", "pros": "pay and benefits", "cons": "Poor Treatment of employees from management and supervisors.", "date_created": "December 27, 2020"},
{"id": "1eq06iktao2gs800", "rating": 5.0, "text": "My review doesn’t reflect other departments or the entire organization. Where I worked, at 311, the management was very supportive but the job itself was really stressful. The pay and benefits were good, most of your co-workers are helpful. ", "pros": "Good pay and benefits", "cons": "Stressful", "date_created": "December 20, 2020"},
{"id": "1epmlt2rco2gs800", "rating": 5.0, "text": "A typical day at work here was fun, informative and always welcoming. My supervisor was always quick to respond and always had positive advice to give. The most enjoyable part of my job was interacting with the kids and my coworkers. Overall, I would highly recommend. ", "pros": "Coworkers", "cons": "Limited hours.", "date_created": "December 16, 2020"},
{"id": "1enm32dcso15h800", "rating": 5.0, "text": "I enjoyed working with the city of Edmonton because they were clear with the scope of work needed to complete the job task at hand. They had to tools to do so and communicated and thought in house how to use the tools and systems needed to do the job. They were passionate on how to excel and a team and company ", "pros": "Communication and fun", "cons": "Didn’t give enough challenge", "date_created": "November 21, 2020"},
{"id": "1en4rauono22b800", "rating": 2.0, "text": "Insiders in the new club get all preferred positions, regardless of education or experience.  Micro managers and those only interested in personal advancement are the norm.  Over politicized relationships with councilors defiescommon sense and the requirements of the Municipal Government Act.   Things are a real mess.", "pros": "Wages are comparable", "cons": "no appreciation of anyone's experience, education or common sense. Just want blind support.", "date_created": "November 14, 2020"},
{"id": "1emsqdrcdnptv800", "rating": 4.0, "text": "I had an ok time while working with the city, the staff had me cracking up a few laughs here and there but in the facility there were a lot of gossiping happing. The managers and the higher ups were always talking behind our backs not just me but a lot of the other staff there, I never once there felt a sense of security while working with the staff mainly because of the major gossiping happing its not just in my facility but many others. I thought I would put my point of view on this thank you for your time much love from niche gang(this is a joke am not in a gang don't @ me please)", "pros": "the pay was fair and the job was fairley simple", "cons": "not many hours and the gossipng has to to stop, honestly if I kept the job I would have become even more depressed", "date_created": "November 11, 2020"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1emcu7v9as7e8800", "rating": 4.0, "text": "Typical scenario with any government unionized job.Part time with min hours, great benefits and supportsManagment are trying but still clueless, supervisor are too busy protecting their jobs to monitoring performance.", "pros": "Benefits", "cons": "Low hours and long seniority list", "date_created": "November 5, 2020"},
{"id": "1eksa0pd3o1eg800", "rating": 5.0, "text": "Diversity is the name of the game at COE. Everybody understand  well the Respect Concept between colleagues and  clients.Technology tools are very good and open for improvement.", "pros": "Work environment, Respect Diversity.", "cons": "Creative spirit need to improve", "date_created": "October 17, 2020"},
{"id": "1ejet9ufgo1i3800", "rating": 1.0, "text": "worked there 13 years and cant go into details but yah definitely a toxic environment with cliques who stick together above less experienced employees ", "pros": "good training, experience", "cons": "long hours, unfair OT distribution, among serval much more serious issues i cant get into", "date_created": "September 30, 2020"},
{"id": "1eipcm1rjolck800", "rating": 1.0, "text": "Major toxic management problems. Their code of conduct doesn't outline how to discipline the managers. The Formal Complaint procedure is the way but the union doesn't tell you that and the City keeps the Guidelines hidden.", "pros": "Wages", "cons": "Management", "date_created": "September 21, 2020"},
{"id": "1ehebcg193dko000", "rating": 4.0, "text": "I really enjoyed working here. The supervisors are accomodating, super nice and supportive. Stress free and a fun workplace to be working with people of diverse nationality.", "pros": "enough time for breaks", "cons": "contractual only", "date_created": "September 5, 2020"},
{"id": "1egl2igkiolmk800", "rating": 3.0, "text": "Management says one thing and does not always follow through with what was said during the hiring process. Shift work goes by seniority and the day shifts always get chosen by the ones that have been there for a long time. The Nightshift is left for the new workers with less seniority and will take a long time to get get a good shift.", "pros": "Some co workers are great", "cons": "Some co workers take advantage of being in the union and are lazy.", "date_created": "August 26, 2020"},
{"id": "1ef54hq4mrcvh800", "rating": 1.0, "text": "You will hurry and wait and only do the minimum work for the day. No moving up you are a button pusher thats it. No incentive. The people are rats and are toxic as covid. If you enjoy highschool you will love this place", "pros": "Money", "cons": "The people", "date_created": "August 7, 2020"},
{"id": "1ef3kddgarcvh800", "rating": 4.0, "text": "A typical day was extremely stressful and very fast paced   The hardest part of the job was maneuvering through rush hour traffic and trying to stay on schedule with all the factors involved (traffic, scheduling, distance, clients, etc) \r The most enjoyable was at the end of every day, I knew I had done well for those that couldn’t help themselves.", "pros": "Happy clients, self gratification", "cons": "10 hour shift with no breaks, extremely stressful and unhealthy", "date_created": "August 6, 2020"},
{"id": "1ecp4pikqrill800", "rating": 4.0, "text": "They are a fantastic career opportunity if you get into the posting you want. They have great benefits and job security in certain areas and try their best to accommodate when possible. But they have questionable people higher up than they should and underqualified over educated people in positions of power that dont understand how to do their job well.", "pros": "Steady, secure work, good benefits", "cons": "Questionable management and inconsistant treatment", "date_created": "July 9, 2020"},
{"id": "1ebhjcraorcor800", "rating": 1.0, "text": "Working for the city sucks they don't care about you. They don't know how to take care of their budget he said they did we'd be working right now and you're in 2020 not being laid off are you planning on being in parks and trying to get full-time don't bother you'll never get it  .you don't get benefits for being provisional and it's only summertime 6 months of the year the only thing good", "pros": "Wage", "cons": "City sucks for giving benefits to the people that have been with them for 20 year s a provisional", "date_created": "June 23, 2020"},
{"id": "1ebhhb2kcrcdg800", "rating": 5.0, "text": "This was only a 4 week schooling CDI College prerequisite in completing my APA. The Supervisor was very nice to me and was very helpful in giving me advice on how to enter the job market at the City of Edmonton.", "pros": null, "cons": null, "date_created": "June 23, 2020"},
{"id": "1eb0dmokq3dol000", "rating": 4.0, "text": "The managers were always there for staff to support them if a member of the public got out of hand. \r Most people were very friendly and welcoming.\r Extensive training and support if you needed help with something.", "pros": "Discount on city events", "cons": "Members of the public can be quite rude", "date_created": "June 17, 2020"},
{"id": "1eavass0bre79800", "rating": 5.0, "text": "Enjoyed my time there! Highly recommended. I learned many new skills and was able to expand my knowledge of the rail industry. Great benefits, pay and perks.", "pros": null, "cons": null, "date_created": "June 16, 2020"},
{"id": "1eatqljdcq32e800", "rating": 5.0, "text": "Great place to work. The team of City of Edmonton is nice and well managed. Their workers are really working hard. The atmosphere is supportive of employees.", "pros": "Nothing free", "cons": "None", "date_created": "June 16, 2020"},
{"id": "1eai05ghsrehq800", "rating": 1.0, "text": "Poor training and lots of pressure to get jobs done , no pride in workmanship and poor atmosphere always being bullied . To much name hiring and favouritism", "pros": "Steady pay cheque", "cons": "To many to list", "date_created": "June 11, 2020"},
{"id": "1eaft2m4rreha800", "rating": 4.0, "text": "This was a very good place to work. I felt safe and comfortable every day and was happy with the security the job offered me. I met some fantastic people, and will never forget my experiences there.", "pros": null, "cons": null, "date_created": "June 10, 2020"},
{"id": "1ea8u9tmcre10800", "rating": 5.0, "text": "I like the hours, it was constant unless they give you ample noticed for changes during the shift. \rthe boss is always friendly and available. he gives you constructive criticism when need it.\rtraining is always offered for any task, you just have to be patient with the order in which people request to be trained for set task.", "pros": null, "cons": null, "date_created": "June 7, 2020"},
{"id": "1e9ojjgn2obul800", "rating": 2.0, "text": "The job itself is pretty good. I can get really busy like to the point of not being able to take your breaks during your shift. But, most of the time it's alright. \r The management is terrible.", "pros": null, "cons": null, "date_created": "June 1, 2020"},
{"id": "1e9bgac6m32mm000", "rating": 4.0, "text": "The City pools are well maintained and if not they have scheduled maintenance to do any repairs and options for instructors to relocate until their home pool is finished construction. The pay is good, and the people you meet are helpful and always looking out for you to improve your own skills.", "pros": null, "cons": null, "date_created": "May 27, 2020"},
{"id": "1e8trio1sq56d800", "rating": 3.0, "text": "Part time casual job,so only on events & games fun work place,easy going ,fast paced still not stressful.supervision helpful & understanding & accommodating", "pros": null, "cons": null, "date_created": "May 22, 2020"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1e8q2u5a4f2kr800", "rating": 4.0, "text": "Felt supported and great communication from leadership. Was given open opportunity to apply for multiple employment opportunities throughout the year and room to grow.", "pros": null, "cons": null, "date_created": "May 20, 2020"},
{"id": "1e7it6i34q59s800", "rating": 2.0, "text": "Employer began a campaign of misrepresenting city sectors roles, breaching confidentiality, hiding documentation allowed access under FOIP bylaws, then laid me off, terminated me for handing in paperwork late, and gave me a positive letter of reference in that order as soon as courts closed due to covid-19.", "pros": "good pay", "cons": "rampant managerial corruption under aquatic strategies", "date_created": "May 5, 2020"},
{"id": "1e6htifdg4tub800", "rating": 4.0, "text": "A major employer with good benefits, pay, and culture.   If you don’t worry about leadership craziness and unneeded red tape, this is a good choice for you.", "pros": "Great work.", "cons": null, "date_created": "April 22, 2020"},
{"id": "1e6fmu74u4rhv800", "rating": 1.0, "text": "Favoritism and 2 sets of rules, for the rats. Management only attends work site for discipline. Racism, bullying and harassment are everywhere. Managers hide behind policies.", "pros": null, "cons": null, "date_created": "April 21, 2020"},
{"id": "1e5avdakson7h802", "rating": 3.0, "text": "The pay and benefits were good, and work hours were also good: 10x4, Tuesday-Friday. Equipment was new and well-maintained, and personal equipment was good quality", "pros": null, "cons": null, "date_created": "April 7, 2020"},
{"id": "1e53lg4u9o933803", "rating": 5.0, "text": "a typical day at work was very relaxed no pressure at all to do get tasks done. the supervisors were all very nice and my coworkers were awesome and just a great work environment", "pros": null, "cons": null, "date_created": "April 4, 2020"},
{"id": "1e4cgh3qroae5802", "rating": 5.0, "text": "It's true; most jobs require a form of experience from 2-5 years but once you have accepted a job offer, they set you up real nice. The workplace culture is amazing and fun; collaborative and stress-free.", "pros": "Benefits, Work-life balance", "cons": null, "date_created": "March 26, 2020"},
{"id": "1e3tirhfvq4it801", "rating": 5.0, "text": "Great environment with nice co-workers\r- well planned\r- Great hours\r- fair pay\r- Great management\r- A good amount of support for all employees to complete tasks", "pros": null, "cons": null, "date_created": "March 20, 2020"},
{"id": "1e3oqilufod31803", "rating": 4.0, "text": "Not much union help if your temp. Reg employees make temps work even do there job because they know you'll do anything to get into union and you have no seniority whatsoever.", "pros": null, "cons": null, "date_created": "March 19, 2020"},
{"id": "1e3nnvngs4scs800", "rating": 4.0, "text": "The city was a fun place to work with the diversity of there hiring. Job was easy and decent paced. Most jobs like I had were full time temporary though. Management was easy to get along with.", "pros": null, "cons": null, "date_created": "March 18, 2020"},
{"id": "1e3mvi0da4opa801", "rating": 5.0, "text": "When I work for transit it was great,made many friends. It did get a little stressful near the end but I really enjoyed meeting people and driving many types of buses. Thank you !", "pros": null, "cons": null, "date_created": "March 18, 2020"},
{"id": "1e35fduscpru0800", "rating": 4.0, "text": "Learned new google sites platform\rNo micro managing, very qualified management\rNice people to work with\rSometimes challenging to get direction\rFairly casual atmosphere\rAlways trying to make group more cohesive and engaged", "pros": null, "cons": null, "date_created": "March 11, 2020"},
{"id": "1e2ov63qq48gq802", "rating": 5.0, "text": "Everything is going well  as city employee \rvery nice and convivial place to work\rI had a good  team leader, who is very professional a safety advisor.", "pros": null, "cons": null, "date_created": "March 6, 2020"},
{"id": "1e2h4us9vq5jp803", "rating": 3.0, "text": "I enjoyed my time with the City of Edmonton. I was always treated with respect and given lots of opportunities. The city offers continuous development and provides their employees a lot of opportunity to advance their career. They are an equal opportunity employer which is also great. Supervisors and Managers are very pleasant and very comfortable to converse with.", "pros": null, "cons": null, "date_created": "March 3, 2020"},
{"id": "1e2f3itj347dd803", "rating": 5.0, "text": "Overall, this was the best job I’ve ever had. I really wish they would stop, however, filling positions with “contracts” and instead retain permanent full-time employees— which would in turn contribute to the knowledge retention ratio. But I still maintain this is a great place to work!", "pros": null, "cons": null, "date_created": "March 2, 2020"},
{"id": "1e2cmsbdkbln8803", "rating": 5.0, "text": "My experience at the City of Edmonton is a positive one.  Management is respectful and my team members are professional and hard working.  While our focus is on getting the job done efficiently, we also enjoy working together.", "pros": null, "cons": null, "date_created": "March 1, 2020"},
{"id": "1e24apfu5q5e6803", "rating": 1.0, "text": "Employees are lazy and Hard work gets you terminated. I was on litter pick up and my crew picked up 28 bags that shift. At end of day when it was time to report, I was asked how many bags my crew picked that day. I said 28. He looked at me as his face turned angry and said “we will just put down 8. You wouldn’t want to raise the standards for everyone else now would you”? Uh....YES I would! There is enough garbage in this city to last a lifetime! Stop being so lazy and pick it up!!!!. I was terminated the next day.", "pros": null, "cons": null, "date_created": "February 27, 2020"},
{"id": "1e1sgoar8o90t801", "rating": 4.0, "text": "I have worked for the City of Edmonton for the past forty six years as of March 4th. I am very pleased with my job, however as I am looking to retire I am hoping to find a more relaxed job, such as an airport run. I would definitely recommend anyone to drive for the city.", "pros": null, "cons": null, "date_created": "February 24, 2020"},
{"id": "1e1i6757h4t8m803", "rating": 1.0, "text": "when you understand how the games are played, then that's when you realize the culture. very sensitive place to work, being out spoken is a very big no, no. you will need to learn a whole new way and language to speak to people.", "pros": "a pay check", "cons": "very sensitive place to work", "date_created": "February 20, 2020"},
{"id": "1e1f3l6k2bm8r803", "rating": 4.0, "text": "Good place to work..good team to work with..upper management was good to work with, the team I worked with was really helpful when I first started..I would recommend it.", "pros": null, "cons": null, "date_created": "February 19, 2020"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1e1a58l9938j7003", "rating": 4.0, "text": "Easy going crew and boss. Always subject to public scrutiny working in a COE vehicles. Limited autonomy; have to work within the framework provided subject to the bureaucracy.", "pros": null, "cons": null, "date_created": "February 17, 2020"},
{"id": "1e12qgumjf39u802", "rating": 3.0, "text": "I learned a lot during my stay at the designated department I was sent to. The workplace atmosphere is fun and enjoyable because the people around me are very helpful.", "pros": null, "cons": null, "date_created": "February 14, 2020"},
{"id": "1e12042l3q5jl802", "rating": 4.0, "text": "Great place to work. You learn alot and management are good. Lots of OT. This place is very heavy into safety. It also runs upgrading courses on new vehicles in fleet. If a problem with vehicle and you don't know how to fix it, you have people you can call.", "pros": null, "cons": null, "date_created": "February 14, 2020"},
{"id": "1e11msiqthcjq803", "rating": 5.0, "text": "I am happy with the city of Edmonton and I will recommend it to a friend. it has great benefits and it has room to grow. great environment to be working at.", "pros": null, "cons": null, "date_created": "February 14, 2020"},
{"id": "1e0ja3jetblr6803", "rating": 3.0, "text": "Always evolving technologies and expectations.\rChallenging but can be rewarding.\rShift work can be a challenge at times, but there are positives.\rYou are working with personnel from throughout the same organization, so there is an overall 'we are all on the same team' perspective.", "pros": null, "cons": null, "date_created": "February 8, 2020"},
{"id": "1e0gjc1m52v47001", "rating": 3.0, "text": "Enjoy working with new people, learning opportunities and the growth of PM skills and abilities. This is excellent as it helps to build confidence in the work place and helps for future placement.", "pros": null, "cons": null, "date_created": "February 7, 2020"},
{"id": "1dvupserrblms802", "rating": 2.0, "text": "The senior management team has set no clear direction and the culture has become toxic. Morale has declined considerably with sick incidents on the increase. Currently going through a downsizing effort to reduce staff.", "pros": null, "cons": null, "date_created": "January 31, 2020"},
{"id": "1dvt3h115hdbq800", "rating": 2.0, "text": "If you're not in the in crowd you're screwed so training and advancement is nonexistent. Nepotism and favoritism at its finest. Salary is ok but no benefits or future for growth. .", "pros": null, "cons": null, "date_created": "January 31, 2020"},
{"id": "1dvb52ohtf23m802", "rating": 4.0, "text": "Working for the city is always a little stressful they ensure that you are aware that at all times of the day (on or off work) you represent the city, so you must act like with that in mind. As long as you are not going out of your way to make the city look bad they are really good employers and understanding if you have personal things you need to take care of for a bit.", "pros": null, "cons": null, "date_created": "January 24, 2020"},
{"id": "1dva3legbf0pf803", "rating": 3.0, "text": "I learned alot working from the city, i did alot of work on a computer with work orders and such. and alot of grunt work. the enviroment at the shop I was located at was great.", "pros": null, "cons": null, "date_created": "January 23, 2020"},
{"id": "1dum3pidlold9803", "rating": 2.0, "text": "If hired on watch your back. Management promotes snitches, so they can get ahead. When your get to shop leave your brain in car. Your a threat if your show senior staff and management up.", "pros": null, "cons": null, "date_created": "January 15, 2020"},
{"id": "1dtmi31dsq3m9802", "rating": 3.0, "text": "The pay was amazing but in my department management wasn’t all to worried about proper safety procedures. Very odd hours so that put a damper on doing anything else in my spare time. Everyone I worked with ON SITE were great but management doesn’t seem to know what they’re doing", "pros": null, "cons": null, "date_created": "January 3, 2020"},
{"id": "1dtm9s47nnh9j803", "rating": 3.0, "text": "Call Center is serving public for ALL municipal services, very fast working environment, changes constantly need to be able to adapt. Very well paid job.", "pros": null, "cons": null, "date_created": "January 3, 2020"},
{"id": "1dtjm9v4rp04r802", "rating": 4.0, "text": "Typical day during my first year with the City was fantastic, the crew was funny, and happy, we all worked together in a safe and respectful manner.  The pay was very good, the work life balance was also good.", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1dtd8lbt7q3ma802", "rating": 4.0, "text": "I Enjoyed the job that i have done. The variety of different jobs you get to do within the job is nice. The management are great. It is sad that work ethic does not have much value in whether you get to stay employed and whether you get laid off. I am sad that there is no job security here.", "pros": null, "cons": null, "date_created": "December 31, 2019"},
{"id": "1dt99u034had1803", "rating": 4.0, "text": "This is one of the best companies I have worked for. My immediate supervisor was very supportive for growth and development. Very respectful place to work with good compensation package.", "pros": "Good benefit package", "cons": null, "date_created": "December 29, 2019"},
{"id": "1dsqpq46lf12j803", "rating": 5.0, "text": "Provide detailed information about the facility, programs, products, and services to patrons and special needs visitors both in person and over the phone \rProcess program registrations and facility bookings using CLASS and RAMS computer software\rPromote health and wellness through the sale of special products, services, and memberships\rCollect facility admission fees, handle cash, and prepare daily deposits\rPerform administrative duties such as word processing, data entry, and generating inventory reports", "pros": null, "cons": null, "date_created": "December 23, 2019"},
{"id": "1dsnlsmntp04r802", "rating": 5.0, "text": "Its been a pleasure to work for the city.\rGreat people and management that I deal with, I look forward to going to work, and feel great when I get home. its nice to have a feeling of accomplishment and safety at the end of the day.", "pros": null, "cons": null, "date_created": "December 22, 2019"},
{"id": "1ds836pre5n9i801", "rating": 3.0, "text": "Management have extremely high expectations of residential  managers for very little to no rewards. Very little training or coaching due to their commitment to their 4 day week, zero support or accountability and ultimately no respect for their Co workers. Challenging results in termination. No room for growth! Full of empty promises.", "pros": null, "cons": null, "date_created": "December 16, 2019"},
{"id": "1ds0mslaqb80j801", "rating": 4.0, "text": "The city is a great place to work. Great people dedicated and willing to make things better for the citizens. Be prepared for slow growth, but surely you can make your career success.", "pros": null, "cons": null, "date_created": "December 13, 2019"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1drkklomj1d0a002", "rating": 4.0, "text": "It's a good job, once you get in. Dont miss too much time, and they work on keeping you. Lots of room for advancement, if you follow the leads. However, it is also a good job to retire from if you get permanent. Most jobs are temporary.", "pros": null, "cons": null, "date_created": "December 9, 2019"},
{"id": "1drcit3l8hben803", "rating": 5.0, "text": "JOB as security guard in Edmonton tower involves directing people to the  right  department and it involves patience, energy and very good interpersonal skills .people from all different background and culture come to the city for different types of problems or services they need .security guard has a important role to ensure a very peaceful environment in and around the city offices  .\rI did my part to the best of my abilities and performed pretty well .", "pros": null, "cons": null, "date_created": "December 5, 2019"},
{"id": "1dr6bh5l91d02003", "rating": 3.0, "text": "The work was not complicated and our lead trusted us to get our assigned work done so no micro-management. The interviewer did lie and say there were benefits for us contract workers which was totally false which made took the shine of the ok pay. Don't expect more than 5 to 6 months of work even if the posting and interviewer says more. Don't believe for a second that the City cares about you or that you're going above an beyond. Seems like most positions are now Temporary Up To 39 hours so they can cut hours, pay and benefits. Morale is garbage.", "pros": null, "cons": null, "date_created": "December 3, 2019"},
{"id": "1dr40m3v60mci000", "rating": 1.0, "text": "Was hired as an Animal Control Officer. They extended my contract for up to a year and a half, during which time the requirements for a permanent position changed and they did not provide adequate time to prepare and obtain the new requirements and I was laid off when my contract ended. They tried to end my contract early. There was extreme bullying and favoritism by management. A year and a half and no vacation leave or health benefits because I was considered a temp employee. I put in my time and was treated like I was nothing. Was even asked to train my replacement before my time was up. Was given senior level responsibilities. Not allowed to join committees due to temp status. Lost my parking area due to temp status. If I hadn't gotten laid off, I probably would ave had to go on stress leave. I loved my job and put my heart and soul into it, had exemplary performance, but still no support and was shown the door. Very traumatic experience. Beware of Edmonton Animal Control.", "pros": null, "cons": null, "date_created": "December 2, 2019"},
{"id": "1dq88s66tb87s803", "rating": 5.0, "text": "It was an amazing environment and staff. Everybody was very helpful so the workload wasn't ever too stressful or overwhelming. I gained lots of experience and exposure to different career fields.", "pros": null, "cons": null, "date_created": "November 21, 2019"},
{"id": "1dq0b4ib8brf1801", "rating": 3.0, "text": "Very stressful with high quotas and critical time constraints. Varying climate conditions with lots of driving in tight quarters and varying production loads.", "pros": null, "cons": null, "date_created": "November 18, 2019"},
{"id": "1dpo4u2qpb8ba800", "rating": 3.0, "text": "working there i realized quickly there were quotas and output levels that were guarded by the staff and it works good for them. The available OT was a big catch", "pros": null, "cons": null, "date_created": "November 15, 2019"},
{"id": "1dplo91rn5ndh802", "rating": 2.0, "text": "Loved working there 4+ years ! No permanent positions though! Meaning no Pension vacation or benefits. Yet they hire a manager every week and they all start with it all.", "pros": null, "cons": null, "date_created": "November 14, 2019"},
{"id": "1dpge602db8b7802", "rating": 2.0, "text": "Surprised how sensitive the City administration caters to paranoid, poor work ethic employees. \rManagers can't get a full day's effort due to smoke breaks outside the coffee breaks and too much socializing. When being asked to focus on work, employees threaten that you are harassing them, and threaten a grievance. \rEmployees who suck up to their bosses are rewarded when they gossip about others \r Personnel ( HR)  provides poor support to supervisors and managers, as they worry about grievances, rather than helping managers coach employees toward success and better work culture.\r Good workers are not rewarded. We just shake our heads and roll our eyes and look for an opportunity elsewhere.\r The City Clerk's area was the worst area, and the Regulatory Boards under the City Clerk area.", "pros": null, "cons": null, "date_created": "November 12, 2019"},
{"id": "1dpc5om495nd3802", "rating": 5.0, "text": "I like working at The City of Edmonton. If you want to work in The City, You need to keep applying there.\r------------------------------------------------------------", "pros": null, "cons": null, "date_created": "November 10, 2019"},
{"id": "1dp0m6jk3b838802", "rating": 2.0, "text": "it sad just how much tax payer money is wasted with the way the city hires for certain positions.ive built roads my whole life and i was put in turf. i can run any piece of equiptment and they put a weed wacker in my hands.", "pros": null, "cons": null, "date_created": "November 6, 2019"},
{"id": "1doupnithb832801", "rating": 4.0, "text": "Had a couple of fun work partners you get alot of benefits working for city of edmonton , the management is the best ever , and work hours are as convenient as ever", "pros": null, "cons": null, "date_created": "November 5, 2019"},
{"id": "1doeimiaebre0802", "rating": 5.0, "text": "Corporate workplace but everyone works as a team, co-operative and friendly workplace. Management levels are always looking for their employees. Have fun, celebration, training, toastmaster, etc. happen in the City of Edmonton workplace. I love this place and very glad to get an opportunity as a Co-op employee.", "pros": null, "cons": null, "date_created": "October 30, 2019"},
{"id": "1doa1satf5nci802", "rating": 5.0, "text": "Great place to work.... I actually miss it. I didn’t think I could do split shifts for the next 10 years. Depending on seniority,(badge number) equates the shift you can sign. 🤷‍♂️", "pros": null, "cons": null, "date_created": "October 28, 2019"},
{"id": "1do7o727v0mcn002", "rating": 5.0, "text": "Enjoyed working with the people on my team, we all got along and it made the job and time go by quickly.  Going to work at a place where you have nice people to work with made it easy.", "pros": null, "cons": null, "date_created": "October 27, 2019"},
{"id": "1do7ingeibrdt802", "rating": 4.0, "text": "Good place to work, hard to get a permanent spot though. If you don't know how to network, you won't get very far. I have nothing else to add but this box wants 150 words minimum.", "pros": "Good coworkers", "cons": "Advancement is tough", "date_created": "October 27, 2019"},
{"id": "1dnnufkm8b89r800", "rating": 4.0, "text": "Loved the hard work, and the people I worked with. Lots of hard hours but very rewarding work. Not much room to advance until you're provisional (1944 hours).. but for seasonal work its fantastic.", "pros": null, "cons": null, "date_created": "October 21, 2019"},
{"id": "1dng2ftlcb82b802", "rating": 3.0, "text": "Supervisor and crew in my yard were fantastic. Great Moral and attitudes. Very much enjoyed working with them all. I encourage young people to apply as it takes a while to move up.", "pros": null, "cons": null, "date_created": "October 18, 2019"},
{"id": "1dmto1od1b85v806", "rating": 1.0, "text": "I imagine the city is much like any other very large bureaucracy.  It's all about politics and appearances.  If that means that someone needs to be a scapegoat; so be it.  Most of the rules are from the 70's so they are incredibly out of touch and only enforced if they want to persecute someone.", "pros": "Good pay", "cons": "Terrible company", "date_created": "October 11, 2019"},
{"id": "1dmke6lkcb89m802", "rating": 5.0, "text": "COE is a great place to work IF you're placed in the right department. Most of the staff are friendly and nice BUT if you're easily offended be prepared for some mild bullying. The pay could be better but it will be if you land a permanent job. Overall one of the better jobs I have had and WAY better than EPCOR who just lie to you and use you.", "pros": null, "cons": null, "date_created": "October 7, 2019"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1dmh909v15n9r800", "rating": 4.0, "text": "good place to work ..flexible hours..decent pay..no benefit for seasonal..i will recommend city ..good place to work.......................................", "pros": null, "cons": null, "date_created": "October 6, 2019"},
{"id": "1dm2d0v9qb89e800", "rating": 2.0, "text": "was ok lots of data entry and paper information some were hard to read lots of entries for pay roll but was an enjoyable job it was not really fast paced lots of down time", "pros": null, "cons": null, "date_created": "September 30, 2019"},
{"id": "1dm2abjmr5n9n800", "rating": 5.0, "text": "I really enjoyed working here. The supervisors are accommodating, super nice, and patient with you. I enjoyed playing with the children at Green shack, and being active everyday. Great environment and company to work for", "pros": null, "cons": null, "date_created": "September 30, 2019"},
{"id": "1dlvkstp1b80l802", "rating": 1.0, "text": "1in 5 city employees claim to have been harassed.  3.5 managers for every employee.  Poisonous work atmosphere. Good wages and benefits. The entire management team is a old boys club made up of retired military personnel.", "pros": null, "cons": null, "date_created": "September 29, 2019"},
{"id": "1dlfir9n3b84i800", "rating": 5.0, "text": "I have only volunteered with the City of Edmonton, but all the people who work there are nice and collaborative. My volunteering was only for special events.", "pros": null, "cons": null, "date_created": "September 23, 2019"},
{"id": "1dl5s6nh91fdo002", "rating": 4.0, "text": "I got to work with little children as a volunteer, and build special relationships with them as I got to organize activities for them as it was really enjoyable for me to volunteer there every day.", "pros": null, "cons": null, "date_created": "September 19, 2019"},
{"id": "1dkkdljq10mt1000", "rating": 5.0, "text": "signed on as a rap student and I never felt mistreated. excellent management. they are understanding the harder part of my job was dealing with calcium chloride trucks during the winter months", "pros": "enjoyable work", "cons": "no cons", "date_created": "September 12, 2019"},
{"id": "1dkjkr7i31fdi002", "rating": 5.0, "text": "In Canada you are innocent till proven guilty. In transit you are guilty until you prove yourself innocent. A lot of stress in position. But can sign work to meet your lifestyle.", "pros": null, "cons": null, "date_created": "September 12, 2019"},
{"id": "1dk3mt537bre4802", "rating": 5.0, "text": "Working for the city of Edmonton was great, I was always kept busy and learned new skills while on the job. This is why I stayed for 10 years, highly recommend working for the city.", "pros": null, "cons": null, "date_created": "September 6, 2019"},
{"id": "1djf3oh4qbrdd800", "rating": 1.0, "text": "no full time anymore. wouldnt recommend if you want a full time career. at least in parks/roads department.if you want part time or seasonal work fine go for it. have  have lots of schooling if you think u have a chance to go anywhere with the city. no benifits or paid vacition unless your permanent full time.and the union does nothing except take your money ever two weeks.", "pros": null, "cons": null, "date_created": "August 29, 2019"},
{"id": "1dj8h2pcqbrcm801", "rating": 1.0, "text": "Experienced severe Harrassment along with several other co workers\rand quit in an email after 30 years.  The others filed grievances with the Union but after seeing how bad that went I chose to leave. The problem is always the same people but for some reason they don't seem to care. There are serious bullies in sustainable development and staff are leaving because of them.", "pros": null, "cons": "Harassment is allowed here", "date_created": "August 26, 2019"},
{"id": "1dintegs31d0b002", "rating": 1.0, "text": "very lazy workers and management, if your a lazy person will be good however if you find the day goes by faster if you work through it you will find the day drags on. When i say lazy i mean no one does anything for the majority of the day, so you really get to know your coworkers and it can be fun if thats what your looking for. Also impossible to get fired or reprimanded aafter you work there two years, one guy would come in an hour late every single day and never got fired.", "pros": "fun, work security", "cons": "not much money, boring", "date_created": "August 20, 2019"},
{"id": "1di86uqd652ta800", "rating": 1.0, "text": "Decades of poor management and poor financial accountability has created this unique mess of a city. It is bloated with over 16000 employees. That's an absurd number for the population. \r Deputy city managers run little fiefdoms and don't work together. This costs the tax payer money and results in poor service. In fighting is the common practice with everyone afraid of being challenged in terms of how and what they do.\r Management stab each other in the back in order to safeguard themselves. People don't want to change things even though things are abysmal when it comes to wasted processes and resources.\r Favorites are picked based on how well they put on a show!  It's all about appearance... you don't have to actually deliver anything!  In fact, make something, even videos that amuse senior management and you've got it made. \r Staff contributions are ignored and credit is taken by managers. The CAO has no clue what is going on other than whether or not her contract will be renewed so that she can buy things for her retirement.", "pros": "You can do nothing; if that's your game", "cons": "Zero satisfaction and growth for your career", "date_created": "August 14, 2019"},
{"id": "1dh8c36bhbreq800", "rating": 2.0, "text": "Worked for city for 6 years. If you are friends with your manager great if not then dont plan on being advanced cause they already have that planned.\rHours and future are myth they change and anything happens. Its like highschool all over again with the culture at work.", "pros": null, "cons": null, "date_created": "August 2, 2019"},
{"id": "1dgnvit9ub85o801", "rating": 4.0, "text": "A secure and growing employer, becoming more aware of Diversity, and to practice it.  Diverse areas of interest for someone looking to stay and grow with an organization.", "pros": null, "cons": null, "date_created": "July 26, 2019"},
{"id": "1dgbo6pslb88j800", "rating": 5.0, "text": "City of Edmonton is the best workplace I ever worked for. There is a positive environment all around and people are very supportive. I love the company and always be glad for the knowledge I gained there.", "pros": null, "cons": null, "date_created": "July 21, 2019"},
{"id": "1dg7snhj3b88j802", "rating": 3.0, "text": "High work volume with huge responsibility allowing little time for regular breaks which can affect ones health.  Regular unexpected terminations of middle management resulting in regular chaos, miscommunication and actual \"fist fighting\" among business units as they are trying to do their jobs without proper direction.  Bullying, harassment is common place and lack of supports prohibit one from doing a professional, stand up job (if this is what you desire)!  Favoritism is also common place which may prohibit one from advancing internally despite possessing quals, just a toxic place to work in general if you \"care\" about your own personal performance! Lots of staff off work for stress so be prepared to pick up the pace! Senseless IT programs without value and the \"We are One City\" is a joke as you won't know what your own business unit is doing and those are always changing resulting in way too many little departments with lots of middle and upper management to run these department (ie.10 upper/middle managers, to run a little department of 10???) Top heavy in management all lacking leadership!", "pros": "Salary and benefits", "cons": "Leadership, direction", "date_created": "July 20, 2019"},
{"id": "1dfdfeh7i1d0h000", "rating": 4.0, "text": "A typical day at work involves inspecting the entire job site. Addressing issues withe form work, reviewing construction materials, reviewing grades and elevations, meeting with the construction crew.  Meeting with Planning PM to discuss updates.", "pros": null, "cons": null, "date_created": "July 10, 2019"},
{"id": "1dfbmcjdlb84q800", "rating": 1.0, "text": "A good place to work for gaining experience but too political, you need to have a good relationship with management in order to be permanent or to move up your level. Unionized yet you can only get help if you are permanent employee, if you are temp no chance to get support. Too many favouritism, invisible discrimination. The saying is really correct, it is not what you know but who you know.", "pros": null, "cons": null, "date_created": "July 9, 2019"},
{"id": "1debbpn435j4t800", "rating": 4.0, "text": "Finish work at 3. Friendly and fun employees. BBQ provided in the summers. Foremans are great, respectful and acknowledge hard working labourers. Over time is nice, as its double-time", "pros": "Fun, friendly and double overtime", "cons": "None", "date_created": "June 26, 2019"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1de4u4io61d0o000", "rating": 3.0, "text": "Lots of pressure.  If you don't have multiple projects on the go, they act like your not working hard enough.  Never had to work from home but it was often hard to shake off the stress after each work day.", "pros": "Earned day off (EDO) program- every third Friday", "cons": "Management has had no raise in 3 years", "date_created": "June 24, 2019"},
{"id": "1dac3rkomb85g800", "rating": 5.0, "text": "I enjoyed going to work everyday.  There is plenty of training. I learned alot of different skills and brushed up on some of my skills I already had.  It is a wonderful working environment.", "pros": "Lots of training", "cons": "Long hours", "date_created": "May 8, 2019"},
{"id": "1da811g96b89b800", "rating": 5.0, "text": "An amazing job for students in the summer. Only last till September. Not very hard work and get to plant flowers and take care of them. Some gross parts when cleaning parks/litter up.", "pros": null, "cons": null, "date_created": "May 6, 2019"},
{"id": "1da4p2cjcb85g800", "rating": 2.0, "text": "Working here was an exercise in futility. Management is completely cut off from the work done by front-line staff. Advancement opportunities were few and far between. I had numerous toxic managers who were moved to other areas instead of being dismissed.", "pros": null, "cons": null, "date_created": "May 5, 2019"},
{"id": "1d9sie19lbrdf800", "rating": 3.0, "text": "enjoyed my time there. some people made the work enjoyable others did not. good leadership and good chances for advancement. hours weren't the best but they were acceptable.", "pros": null, "cons": null, "date_created": "May 2, 2019"},
{"id": "1d8c96rdjb84q800", "rating": 4.0, "text": "Very good work culture and team leader, the pay is low and advancement opportunity is not too great. The job is  part time basis so shifts are not always guaranteed.", "pros": null, "cons": null, "date_created": "April 13, 2019"},
{"id": "1d82iodvib84k800", "rating": 4.0, "text": "This is a City owned facility and it's rolenis vital to the recreation provides for locals and tourists. The food is overpriced but there is plenty to see and enjoy. As an Indigenous Interpreter I wear a costume and help the visitor to back in time to imagine what lives people had in previous generations. Everyone has a family and Fort Edmonton does a great job in bringing some value to Canadian history.", "pros": "Bannock, animals on site, artifacts.", "cons": "Overpriced admission, overpriced food, should no longer have wagon rides with horses and have no pigs or sheep.", "date_created": "April 9, 2019"},
{"id": "1d7gfudks5j51800", "rating": 5.0, "text": "was always a very easy going place to work at. Pay was very good for a student who needed to save money during the summer months and couldn't work in the winter.", "pros": null, "cons": null, "date_created": "April 2, 2019"},
{"id": "1d6jjqbd25ncs800", "rating": 4.0, "text": "My day at work involved working on the phones to help provide the citizens with various information. While it was a fast-paced job, my co-workers and managers always made sure the environment was stress-free as possible.\r The compensation was more than adequate and allowed me to manage my expenses comfortably", "pros": null, "cons": null, "date_created": "March 22, 2019"},
{"id": "1d6ja36ou1d13000", "rating": 3.0, "text": "I worked for the Greenshack program this summer during the INTENSE smoke outside. Levels were in the high 8's and 9's all day and only until it hit a 10 would the management let us go home. 8 hours in a level 9 is just as harmful as an hour in 10. Not just for me, but my kids as well. I should not have to hide in my car if working at my jo is making it hard to breathe or I feel sick.", "pros": "Good pay", "cons": "Poor care for workers", "date_created": "March 22, 2019"},
{"id": "1d6e07h1rb894800", "rating": 2.0, "text": "Work is work. My co-workers are great. I have not learned much, I provide a benefit to the City for a salary. That's about it. Upper management and the City Manager are a complete joke. My direct managers are fine, although no one has the balls to do anything about any problems that may arise. The hardest part of the job is dealing with old farts that should retire or get with the future in the fact that not everyone has to be in an office from 9-5 now.  There are opportunities to work remotely and save the City of Edmonton a ton of money.  The City has become extremely cheap lately as well. Management hasn't received raises in 4 years and the Union is looking like it might be following suit.  With the cost of inflation, not receiving a raise is actually a demotion or pay cut.  The most enjoyable part of the job is the co-workers and the fact that we all hate working for the City and can agree on that.  Advancement is near impossible unless you know the right people.", "pros": "I get paid well", "cons": "Work is not in any way fulfilling", "date_created": "March 20, 2019"},
{"id": "1d6boljpo5j4k801", "rating": 1.0, "text": "Worse place to work. To much politics an favoritism. Supervisors are idiots and disrespectful also dont care about there employees!\rDont waste time there unless you wanna be fired afer 11 months contract. Stay away", "pros": "None!", "cons": "Everything!", "date_created": "March 19, 2019"},
{"id": "1d5so765f5n8j800", "rating": 5.0, "text": "This has been such a fun job, and I will be sad when I have to leave. The children's experience team is awesome, and so friendly. Supervisors are very encouraging and supportive and offer advice when needed.", "pros": null, "cons": null, "date_created": "March 13, 2019"},
{"id": "1d5dil3ni0mct000", "rating": 1.0, "text": "I worked for the city of edmonton for four years, no chance of being made permanent , would have layoffs the moment it snowed, very racist, my co-workers smoked pot then got into equipment and vehicles and operated them also they stole everything in sight, would recommend you never work there.", "pros": "nothing", "cons": "racist, druggies, thieves and liars", "date_created": "March 7, 2019"},
{"id": "1d4j27u67b80u800", "rating": 2.0, "text": "ALOT of politics. Having to kiss up to management, friends of managers get precedence and special treatment. All in all, they are more focussed on money than employees.", "pros": null, "cons": null, "date_created": "February 25, 2019"},
{"id": "1d4999h6hb84q800", "rating": 4.0, "text": "Currently the face of the company. Enjoy being around people. Scanning and assisting various customers. Multi tasking and the ability to speak in different languages.", "pros": null, "cons": null, "date_created": "February 21, 2019"},
{"id": "1d44c58djb80n800", "rating": 1.0, "text": "have to work basically 2 whole years part time to get a raise so it takes a long time. Also the shifts you get you’re completely stuck with. Bad management", "pros": "Paid on site breaks", "cons": "Horrible working hours", "date_created": "February 19, 2019"},
{"id": "1d43n01nlas0v800", "rating": 4.0, "text": "Being outside everyday was a huge highlight.  I do like being in charge of enforcing bylaws.  I took pride in my job.\r Wasn't paid that much as we were contracted out of a security company and not law enforcement.", "pros": "Health benefits, working outside, made great friends", "cons": "Not enough pay, physically demanding", "date_created": "February 19, 2019"},
{"id": "1d3fgv6421d0t000", "rating": 4.0, "text": "I loved working for the city .Just a few things that bug me and that was the drive to work from Camrose all my money was going to fuel . and shift work . I thought i only be on shift through the winter for a couple of years its not going on 5 yrs and it doesn't help that i have a little family to take care of. Once your in a postion with the city its hard to move up or down on the ladder . So your basically stuck in the middle and managment won't do much about it. I love driving truck  its can be enjoying at times and exhusting at other time cause it just you in the truck and your mind will start to wonder .", "pros": null, "cons": null, "date_created": "February 11, 2019"},
{"id": "1d39l14pnak8i800", "rating": 5.0, "text": "Great workers and a great work environment. Easy and to the point instructions and a good idea if what jobs needed to be completed per day. Would highly recommend for a summer job.", "pros": null, "cons": null, "date_created": "February 9, 2019"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1d38n94ks0mte000", "rating": 4.0, "text": "Its a good job, management needs work.  Lots of discrimination within the city. I thought it would be a job i would have till i retired.  i worked for 5 years and still didn't get a perminate postion, due to a hiring freeze mandated from the mayor.", "pros": null, "cons": null, "date_created": "February 9, 2019"},
{"id": "1d1tpvvfvb85o802", "rating": 4.0, "text": "Great for anyone wanting to work with a group of people as a summer job.  Mainly involved doing minor horticulture and driving around getting to different positions", "pros": null, "cons": null, "date_created": "January 23, 2019"},
{"id": "1d1gp1jk3akh1800", "rating": 2.0, "text": "The City has a lot of perks, don’t get me wrong. Such as good pay for easy work, good crews, appreciation brunches and dinners, etc. But at the same time, there are lots of negatives. They do not hire permanent employees often so I know people who have been with the city 10yrs and have no benefits or job security. It is very cliquey - one of the upper hiring managers told me TO MY FACE that they only rehire if the person got along with their crew, was punctual and adhered to all policies. One of the policies is that temporary workers (which most of us are) only get 2 sick days per 11 month period and if you go over that you are no longer considered a “recommended rehire” and you are bumped to “conditional rehire”. Managers and team leaders play favorites, and if you aren’t one of them you are pretty much doomed if you hoped your career would lie within the city. They don’t care about work ethic, just if you suck up to management.", "pros": "Good pay, easy work", "cons": "Extremely cliquey, unfair management", "date_created": "January 18, 2019"},
{"id": "1d14grrjr5j4s800", "rating": 2.0, "text": "My experience at The City was long-lived and very boring. Everything I went to school for and learnt, I used about 2% of my knowledge. There was hardly any work and no training or instruction on how to do the tasks given. However it was a special experience and not all businesses are run the same.", "pros": null, "cons": null, "date_created": "January 13, 2019"},
{"id": "1d11j1dd7brdb800", "rating": 5.0, "text": "Excellent company to work for. If you're looking for a job in the Edmonton are area you wont find a better job. If you want competitive wages, excellent benefits and a good work/home life they are the employer you're looking for", "pros": null, "cons": null, "date_created": "January 12, 2019"},
{"id": "1cun65kam1d17000", "rating": 4.0, "text": "A great job for students over the summer. There is absolutely potential for individuals to move be promoted if they choose to stay on after they graduate.", "pros": null, "cons": null, "date_created": "December 14, 2018"},
{"id": "1cuem18c30mtn000", "rating": 5.0, "text": "Good management and good coworkers. Fair and reasonable place to work. Good work space and good corporate culture. Love the pot luck lunches and food by staff", "pros": "Good diversity", "cons": null, "date_created": "December 11, 2018"},
{"id": "1ctqqpl9c1d0s000", "rating": 1.0, "text": "I have not experienced the amount of disrespect from management  & coworkers ever in my life until becoming a city employee , it use to be a great place to work. It has turned in to a very stressed filled environment . there is no  communication, only dictatorship & A very  demeaning culture  . This is no localized, it is wide spread though out the city of Edmonton  from general labours to upper management , it is very disappointing .", "pros": "benefits", "cons": "most management is unrealistic", "date_created": "December 3, 2018"},
{"id": "1cso251btb8bf800", "rating": 5.0, "text": "Working with City of Edmonton was a excellent experience of my career. \r-wonderful multicultural environment at workplace\r-Cooperative and helping senior management staff\r-Lots of growth opportunities", "pros": "good salary", "cons": "More work load", "date_created": "November 20, 2018"},
{"id": "1csfe9bplb87q800", "rating": 1.0, "text": "-Misogynistic Culture of fear, humiliation and harassment fostered by and supported by upper management.-Confusion and poor planning-Nepotism and cronyism is the norm.-Management treats temporary workers like pawns, whose schedules, place of work, and job descriptions can be changed without asking or any notification-Temporary labourers are often given less than one day for notification of layoff -The culture of gossip is extremely toxic. Especially amongst management.  Both Direct and upper management-Gives very little; almost no training on how to do the actual job you were hired for", "pros": "Co workers", "cons": "just about everything", "date_created": "November 16, 2018"},
{"id": "1cs7rdlu65j73800", "rating": 3.0, "text": "I was working through randstad agency.\rbut job atmosphere was excellent.\r i was not on permanent position.so they were  treating as a helping hand guest. They were happy with my service.", "pros": "free lunch during over time.", "cons": "some time", "date_created": "November 13, 2018"},
{"id": "1crsn86vdbrf5800", "rating": 4.0, "text": "I have worked at the COE for 7 years and it offers great job security and decent pay and benefits. While there are opportunities for growth they don't always seem to available.", "pros": null, "cons": null, "date_created": "November 9, 2018"},
{"id": "1crdgsrjnb8as800", "rating": 4.0, "text": "It felt like the City's motto should have been what more can we take from our employees. There was a lot of hard work with little benefits and good luck if you are in a position that deals with the public. They feel like they own you because \"they pay your salary\". I have never been treated worse at a job by the clients.", "pros": null, "cons": null, "date_created": "November 3, 2018"},
{"id": "1cr0bja7obrem800", "rating": 2.0, "text": "If you enjoy feeling like you accomplished something in a day I wouldn't recommend CoE. If you want to punch a clock and float, great place. \r Everything needs multiple approvals, union workers are invulnerable where management has nothing to review poor business practices. Change is rampant so you have to constantly navigate new procedures that no one knows, if someone doesn't want to do something they just pass the buck to another department and send you on a goose chase. Very frustrating and hard to stay motivated.", "pros": "Many good people that try, slightly less hrs/week", "cons": "Constant change and shuffling, many bad people who dont try, super process heavy", "date_created": "October 29, 2018"},
{"id": "1cqol5fdab8an800", "rating": 4.0, "text": "good to work for\rlearned lots and had some really good supervisors \rlearned lots of interesting things and the pay was very well\rlots of opportunities to grow and better yourself\rlots of courses offered", "pros": null, "cons": null, "date_created": "October 26, 2018"},
{"id": "1cqeh5njbbrec800", "rating": 5.0, "text": "I found working for the City was a great experience, working out side meeting new people the hours are great, wages were good, I look forward to returning next year", "pros": null, "cons": null, "date_created": "October 22, 2018"},
{"id": "1cqabma0lbrec800", "rating": 5.0, "text": "Meet new people most of the time during work days.\rLike talking to people\rVery overwhelming while talking to those people and their stories.\rAnd how they are happy to be alive.\rThere is too much to learn how they cope with their daily activities", "pros": "See new people and see the whole cioty driving", "cons": "Work in cold weather conditions", "date_created": "October 20, 2018"},
{"id": "1cq10ugj352uh800", "rating": 5.0, "text": "I worked  there as a teenager during highschool. \rWas a great experience.\rWas a sales clerk and cashier. \rStaff incentives for higher sales\rLoved the sales atmosphere and dealing with customers\rCapable of fast past environment", "pros": "Flexible hours", "cons": null, "date_created": "October 17, 2018"},
{"id": "1cps9l714b82f800", "rating": 1.0, "text": "The city of Edmonton was a waste of time. they waste tax payer money sitting and doing nothing. they fix stuff only so they break again. the city of Edmonton is full of losers. and the transit CEO is an idiot i could do a better job drunk", "pros": null, "cons": null, "date_created": "October 15, 2018"},
{"id": "1cpn7hb1e5nab800", "rating": 5.0, "text": "trouble shooting, drawing up blue prints, always something new, being a drainage leader.\rdrainage systems and how it all worked\rmanagement was good and bad\rdiverse employees\rsome sewer problems\ralways kept busy and always learnt something new", "pros": null, "cons": null, "date_created": "October 13, 2018"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1cpiqslq3b82f800", "rating": 3.0, "text": "Not the best place to work.  If you want to work in a poorly lead, mundane organization then this is the place.  Once permanent your job is secure.  But ask yourself if it's where you really want to make a career.", "pros": "job security, average wage.", "cons": "leadership", "date_created": "October 11, 2018"},
{"id": "1cof3m9gkb863800", "rating": 3.0, "text": "The job security and benefits are good, but the companies culture has taken a nose dive in recent years. So it depends what you value in your work life.", "pros": "Security, benefits, hours of work.", "cons": "Culture, work life balance, communication between management and staff", "date_created": "September 27, 2018"},
{"id": "1cob4ifnhb820800", "rating": 5.0, "text": "Staff able to deal with emerging issues in a very professional manner. Amazing opportunity to feel you are truly serving the citizens in this public facing organization.", "pros": null, "cons": null, "date_created": "September 26, 2018"},
{"id": "1co6tt53p5ndr800", "rating": 2.0, "text": "Management doesn't have a clear vision.  They are very top down in management style.  Little honesty or transparency as to policies or direction filter down to workers or supervisors.", "pros": "Good pay", "cons": "Long hours, poor job security", "date_created": "September 24, 2018"},
{"id": "1cn1ojblq5ndf9if", "rating": 5.0, "text": "I get to communicate with the public.  I get to work with my partner and the same location each year.  I enjoy my co-workers.  I get to work all the concerts that are held at the Stadium", "pros": "Concerts, Grey Cup when held in Edmonton", "cons": "Weather as I work outside", "date_created": "September 10, 2018"},
{"id": "1cmojpd6fbrddd41", "rating": 1.0, "text": "when I worked for this employer, I worked there for 12 years - I was overworked, underpaid, and underappreciated.  The management was horrible, and I was pigeon-holed into a position regardless of all the hard work that I did.  I will never encourage anyone to work for the City of Edmonton", "pros": "Career stability", "cons": "bad, rotating management, underappreciated", "date_created": "September 6, 2018"},
{"id": "1cm0fecpr5nd3f79", "rating": 4.0, "text": "Great place to work for. Would welcome opportunity to go back. Met a lot of great people. I would recommend this company to anyone who meets there qualifications.", "pros": null, "cons": null, "date_created": "August 28, 2018"},
{"id": "1cluvvadm5j4tbcn", "rating": 4.0, "text": "Some bosses are great, some aren't \rSome coworkers are great, some aren't\rPay is good, hours are good, union is great\rWould return and work with them again", "pros": null, "cons": null, "date_created": "August 27, 2018"},
{"id": "1clps22115nd0f1m", "rating": 5.0, "text": "I had the opportunity of working with friendly employees in a great and fun working atmosphere. I felt mutual respect among co-workers as well as upper management.", "pros": null, "cons": null, "date_created": "August 25, 2018"},
{"id": "1cldqdd0ob812cr5", "rating": 4.0, "text": "Only job I could have at the time so i think it was good i really dont know why i have to do this review so yeah i really hope i can work at the REC room", "pros": null, "cons": null, "date_created": "August 21, 2018"},
{"id": "1cl486bmrb80k9ir", "rating": 2.0, "text": "The culture and management absolutely suck. Expect long work days, harassment and abuse by managers and supervisors. They will create and maintain fake social media profiles about you and use that against you if they can't find any other means to fire you. Then they get the Mayor involved to launch fake investigations on you.", "pros": "End of shift", "cons": "Everything else", "date_created": "August 17, 2018"},
{"id": "1ck088bss1d033fd", "rating": 4.0, "text": "At the start of every day, we communicate through Google Hangout and we let everyone know where are we going, where we are, jobs that's outstanding, jobs completed, safety issues yada yada. Working here, I learned to appreciate more and value my coworkers as they are really helpful in times I need them and even if I don't, they still offer their help. We look after each other that what makes it a great team to be in it. A management that cares for the well being of their subordinates is number one in my book. Jobs hard but it get easier when everybody tries to pitch in to help. The part that I enjoy the most is my supervisor is always there to help, listen, appreciate, joke around and just a down-to-earth person  who's really selfless no matter who he's dealing with.", "pros": "Great team and work environment", "cons": "Can't think of anything yet", "date_created": "August 3, 2018"},
{"id": "1ciuqf070b8949vd", "rating": 1.0, "text": "There was minimal support from Supervisors, they expected a lot for very little pay. Management never took ownership of their mistakes just threw their staff under the bus. \rIt was the most disorganized place I ever worked", "pros": null, "cons": null, "date_created": "July 21, 2018"},
{"id": "1cikh21lkb852buv", "rating": 4.0, "text": "The management is very helpful and kind and understanding. Things are a bit of a mess but that it due to changes from higher up the ladder\r I basically come in in the evenings and on weekends, grab a truck, a water plants alone. it is nice to work alone, and also a bit lonely at times. My manager always says she is available if i need help or have questions. \r I have learned how to drive a big truck! pretty exciting.", "pros": null, "cons": null, "date_created": "July 17, 2018"},
{"id": "1ciiu3jlgb88vbd0", "rating": 1.0, "text": "Complete lack of respect for management staff. No effective, reliable or truly independent resources for complaint reporting. Lots of political backstabbing. Promotion based on favouritism, gender & incompetence is rampant.", "pros": "Variety of available work", "cons": "culture, work life balance is non-existent, only lip service paid to policies, incompetence & favouritism due to yes-man attitude is promoted rather than honesty, integrity & truthfulness", "date_created": "July 16, 2018"},
{"id": "1cibdt4fd5j4q98u", "rating": 2.0, "text": "If you care about the job and or try to do a good job management will just keep adding tasks onto you until you snap.\r The culture is really really really bad! They will cut the jobs that actually do the real work and put the money into a photo shoot.", "pros": "Wage is ok, when they need you", "cons": "Too many to list.", "date_created": "July 13, 2018"},
{"id": "1ci7vbq6bb813c48", "rating": 5.0, "text": "i loved the professionalism, the people and the work environment. the management was nice and worked well with me. i enjoyed the jobs and tasks that were asked of me.", "pros": null, "cons": null, "date_created": "July 12, 2018"},
{"id": "1ci3kpcreb84v886", "rating": 4.0, "text": "good hours, \rbest with 4 days a week 10 hour shifts.\rhard work but get enough breaks to make the days go by quickly\rhard to get permeant work but lots of opportunities within the city to apply for", "pros": null, "cons": null, "date_created": "July 10, 2018"},
{"id": "1chr4so7fb88octm", "rating": 5.0, "text": "A regular day at work involved being out in the warm summer weather, and engaging with the fun youth of the community. There was never a boring day at work when kids would come to hang out at the parks!", "pros": "fun, engaging", "cons": "work hours", "date_created": "July 7, 2018"},
{"id": "1ch6tnd97b84hb1o", "rating": 2.0, "text": "It's been over a year since the city was in the media for having toxic culture and bad management and I can honestly say it has only gotten worse in my department. The morale is so bad people are consistently calling in sick or going on stress leave which I am considering doing myself. Management is horrible and cares nothing for you as a person. Has a \"accept it or leave\" attitude. The union is just as useless. Decisions are made and enforced upon us without consultation greatly reducing the quality of our life. Even when concerns about quality of life reduction are brought to senior management still get the same \"accept it or leave\" response.", "pros": "Benefits", "cons": "Managment and culture", "date_created": "June 29, 2018"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1cgvcrgnlb80iclo", "rating": 4.0, "text": "As a bus operator it is solid work but I have the feeling of being just a number in the employee pool. As a Peace Officer with the city of Edmonton it is well managed and going in the right direction.", "pros": "Solid work", "cons": "Odd hours", "date_created": "June 26, 2018"},
{"id": "1cgpo2m3i1d0a3s2", "rating": 4.0, "text": "I was given plenty of time to complete tasks, and hours were consistent. They always provided everything I needed to get the job done. There were good benefits.", "pros": null, "cons": null, "date_created": "June 24, 2018"},
{"id": "1cg27tajbb80leii", "rating": 5.0, "text": "Was a great way to stay active in the summertime and work with diverse communities. I would arrive around 0830 then leave typically around 1730 until the last child had gone home.", "pros": null, "cons": null, "date_created": "June 15, 2018"},
{"id": "1cfo14srs1d0h2tc", "rating": 3.0, "text": "With the Leaders in Training program it gave me a lot of experience and skills on how to be a leader for my everyday life. The hardest part of the job is not being listen to when given an opinion and the manager just brush it off.", "pros": "gain experience", "cons": "poor training skills", "date_created": "June 11, 2018"},
{"id": "1ceunuvav52t59ot", "rating": 3.0, "text": "The job itself was never the issue, it was always the management.  They're pretty sticky about regulations, and often, because of their monolithic policy, penalize unfairly for what would be a nonissue in most other places.", "pros": null, "cons": null, "date_created": "June 1, 2018"},
{"id": "1cepr8uu8b818drd", "rating": 4.0, "text": "the green shack and flying eagle program taught me how to be a leader and how to talk different ages of people to get to know them and learn what they enjoy", "pros": "educational aswell as informative and helpful", "cons": "hot days 6 hour times in the hot sun", "date_created": "May 30, 2018"},
{"id": "1ce9ma50gb892b4f", "rating": 4.0, "text": "I have worked at Grand Trunk Leisure Centre for the past 3 and half years and it has been an overall enjoyable working experience. I have kind and friendly co-workers that makes this facility a nice place to work.", "pros": "Free Facility Access Card", "cons": "Certain tasks must be completed outside of work", "date_created": "May 24, 2018"},
{"id": "1ce2oqt0vbrcmc4a", "rating": 5.0, "text": "Great place to work. As a Traffic Signals Tech your day was busy and when a detour came in, you had to work fast to get it out the door. And documentation was very important to maintain.", "pros": null, "cons": null, "date_created": "May 21, 2018"},
{"id": "1cbnvpms45ncqe8p", "rating": 4.0, "text": "COE is a great workplace. They offer countless opporunities and also provide you with great benefits and great pay. Their is plenty of room to move up the ladder.", "pros": null, "cons": null, "date_created": "April 22, 2018"},
{"id": "1cbe3veoobrcq8sd", "rating": 4.0, "text": "there was a lot of work to do and that way i can learn some of the Technics and how to fix a problem. Really awesome foreman's to work with even though they were old the treat me on their level and thought me on their level. There was not a single day that i was not on handwork duty, step by step they run me through procedure of how engine works.The workplace environment was amazing, every one jokes around and that gave me motivation to wake up early 6 in the morning.", "pros": null, "cons": null, "date_created": "April 18, 2018"},
{"id": "1catp63svb8529d4", "rating": 2.0, "text": "late hours hard work why are you asking me for this i really just need to find a job this is annoying and very rude. i need a job. this is not making me happy stop asking people for this this is very misleading.", "pros": "no", "cons": "yes", "date_created": "April 12, 2018"},
{"id": "1catnj12j5j4jbqt", "rating": 5.0, "text": "the city of edmonton allowed me to learn and understand the reality of the work force. i loved and learned to many new things and carried them through to now as i work for in patient care", "pros": null, "cons": null, "date_created": "April 12, 2018"},
{"id": "1caohccbdbrclfab", "rating": 3.0, "text": "Need to understand the other sectors. Changes in management with immediate changes approaches to process without review creates chaos in the system. There is need to makes changes in a systematic flow", "pros": null, "cons": null, "date_created": "April 10, 2018"},
{"id": "1cae2ld6b52si9bu", "rating": 3.0, "text": "not a heavy workload\ras with any bureaucracy, work and change is very slow\rworkplace culture is decent, some employees are there for the free ride, and others are frustrated at the apparent slow pace of progress", "pros": "slow pace", "cons": "very rigid", "date_created": "April 6, 2018"},
{"id": "1ca4spb0jb84maed", "rating": 4.0, "text": "Starting every morning with a group activity to connected with the people your with. Then activitys till lunch with the kids I worked with at summer camps.", "pros": null, "cons": null, "date_created": "April 2, 2018"},
{"id": "1c9n30sacb88ndlt", "rating": 5.0, "text": "Good job good place to work good starting wage great starting vacation and benefits lots of room to learn grow and advancements would go back to work for them asap", "pros": null, "cons": null, "date_created": "March 28, 2018"},
{"id": "1c9aleongb88kbnh", "rating": 4.0, "text": "The City of Edmonton has been working on making their facilities amazing for all to participate in including those who can not afford much. To work for them, they are fair with wage and supervisors can be helpful.", "pros": null, "cons": null, "date_created": "March 23, 2018"},
{"id": "1c938uc251d0s14t", "rating": 4.0, "text": "It was very fun and intriguing to participate in many activities in my volunteering program and look forward to attending in the future. The leaders were excellent and the programs were fun-filled and interactive.", "pros": "Play in Zoo", "cons": "Kids are wild", "date_created": "March 20, 2018"},
{"id": "1c8ll52lf1d0s6j4", "rating": 1.0, "text": "It was a good place for job security good place.  \r With the exception of my immediate supervisor.   I found him very disrespectful and very hard to work for especially found him to be a bully.", "pros": null, "cons": null, "date_created": "March 15, 2018"},
{"id": "1c87e7irf1d091uh", "rating": 1.0, "text": "Worst place I have ever worked\rSupervisors are asshloes\rThey think they are Gods\rHave no respect for anyone but themselves\rPeople there are ok\rJust the bosses are bad", "pros": null, "cons": null, "date_created": "March 10, 2018"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1c83k7jo41d0j0gg", "rating": 5.0, "text": "Being partnered up with City of Edmonton is a great experience. I had the opportunity to know what it's like to be part of the business world. It was a great experience for me, the atmosphere was happy, active. I've learned quite a lot. Taking minutes for meetings. My supervisors has showed me how to professional be an administrative assistant.", "pros": null, "cons": null, "date_created": "March 8, 2018"},
{"id": "1c7uk0uldb87v814", "rating": 4.0, "text": "Good place to work. Good people. Respectful. definately reccomended to summer students as a good source of income in the summer.  Flexible start/hire dates, reasonable wage for the work.", "pros": null, "cons": null, "date_created": "March 6, 2018"},
{"id": "1c7d2s3rdb8bedj1", "rating": 5.0, "text": "Loved working with the city. Was able to learn my job quickly and management was very friendly in assisting with any questions. At times I felt I was overwhelmed but I would easily find ways to manage my work effectively.", "pros": null, "cons": null, "date_created": "February 27, 2018"},
{"id": "1c7cfmbfib8bea7a", "rating": 3.0, "text": "This was years ago and management has changed and improved. The work was awesome and so were the people I worked with. But there we definite culture issues.", "pros": null, "cons": null, "date_created": "February 27, 2018"},
{"id": "1c7cfic0tbrfbfje", "rating": 3.0, "text": "I work with great people and great clients.  Like any communications job, it is extremely busy and high stress. \r It is great to know that I am helping build a better Edmonton. There are definite issues with culture, but they are trying to improve them.\r For the most part I enjoy the people and the work is exciting.", "pros": null, "cons": null, "date_created": "February 27, 2018"},
{"id": "1c65vphg2b82uea0", "rating": 2.0, "text": "providing garage & transportation duties,field work\r none of the work is hard or particularily difficult\r lots of meetings and useless emails\r Supervisor was appointed after others retired or quit\r management is continuously concerned with their own image and very concerned with complaints of any kind\r workplace culture does tend to be a stifling environment where workers are thrown under the bus when things don't go well\r poor communication from management to workers", "pros": "pay and benefits, government, field work", "cons": "supervisors, micro management, email", "date_created": "February 12, 2018"},
{"id": "1c5g2oa48b8ab84r", "rating": 5.0, "text": "The City of Edmonton is an awesome place to work. There are many opportunities for growth and advancement. The work atmosphere and culture makes it a great place to come work everyday. The benefits are outstanding and job security is assuring,", "pros": "Work life balance", "cons": "None", "date_created": "February 4, 2018"},
{"id": "1c55374sv52u7fiu", "rating": 4.0, "text": "Worked with many people on statistics of information on Traffic Safety in Edmonton. Monitored the street cameras, to see what kind of traffic flow there was, accidents, weather, etc.", "pros": "Regular hours from 8-5 and from M-F", "cons": "Was only a practicum position through Grant MacEwan University.", "date_created": "January 30, 2018"},
{"id": "1c51l6e395n9l9sa", "rating": 5.0, "text": "Great place to meet new people and try new things. Fun and safe environment with amazing and professional instructors. Great and convenient locations through out the city.", "pros": null, "cons": null, "date_created": "January 29, 2018"},
{"id": "1c4ub9s8l5ndk8tb", "rating": 5.0, "text": "My coworkers were very helpful, warm and friendly. I learned the processes the City has in place for public transits. I greatly appreciated this opportunity. i have a new found respect for municipal workers that keep the city moving, behind the scenes.", "pros": null, "cons": null, "date_created": "January 28, 2018"},
{"id": "1c4na32t1b85tbbu", "rating": 5.0, "text": "If you can overcome the culture which has developed over the past 5 years you will like the city of edmonton\r It was my job that kept me there for 32 years.  I LOVED my job.", "pros": "Great pay and benefits", "cons": "poor management", "date_created": "January 25, 2018"},
{"id": "1c4gge7k3brdidbr", "rating": 3.0, "text": "It was a great place  when I started. I enjoyed the challenges of the job . Everyone woke together to  get a task finished. I worked for years with little or no supervision. Now the job has become management heavy and they want to tell us what to do all the time. Not like the old days.", "pros": "Great benefits work indoors", "cons": "Shiftwork", "date_created": "January 22, 2018"},
{"id": "1c45c2ho0b89lcvt", "rating": 5.0, "text": "I enjoyed working with the City of Edmonton as it was a comfortable and respectable working environment. There are many benefits along with work life balance.", "pros": null, "cons": null, "date_created": "January 18, 2018"},
{"id": "1c458ah3eb85madp", "rating": 5.0, "text": "Excellent Company to work for.\rI never left the company, but the company has undergone new management to EPCOR. I had to transition to EPCOR. Work culture is great.", "pros": null, "cons": null, "date_created": "January 18, 2018"},
{"id": "1c3ocm41jbrdde96", "rating": 5.0, "text": "I love working here. Staff is friendly and very helpful. You are always busy but it’s fun. Working with kids and Genral public is the best. Lots of fun!", "pros": "Great place to work", "cons": "None", "date_created": "January 13, 2018"},
{"id": "1c1k7lku71fdv4it", "rating": 4.0, "text": "My time there was good. Friendly and helpful team ready to support you. The project turned out slightly different than was advertised but a great experience.", "pros": null, "cons": null, "date_created": "December 18, 2017"},
{"id": "1c1b1uu6m1fdp4mm", "rating": 4.0, "text": "The City of Edmonton was a nice place to work, the management was great for the most part, aside from most of the middle management suffering from terrible power complexes", "pros": null, "cons": null, "date_created": "December 14, 2017"},
{"id": "1c0rnuqs25na0ab0", "rating": 4.0, "text": "I really appreciate the job I have with the City of Edmonton, they treat their employees very well and I just hope to get a permanent job with them soon...", "pros": null, "cons": null, "date_created": "December 8, 2017"},
{"id": "1c05mqm5sb8129jb", "rating": 4.0, "text": "Everyday in CPIC is different. It is a fast paced, busy, multitasking requiring job that keeps your mind occupied.\r CPIC runs on teams and each team has their own ways of doing things and completing tasks but each team is like a mini work family and generally get along with each other. Some teams also do team building activities outside of work, which has been a lot of fun. \r Management I do not find it be very good, in my opinion there is lots of favoring and bullying.  \r Hardest part of the job is the shiftwork and 12 hour shifts, they are long and draining, however the work and being a vital part of the policing in Edmonton is a huge benefit!!.", "pros": null, "cons": null, "date_created": "November 29, 2017"},
{"id": "1bvatdnc5b88gatf", "rating": 5.0, "text": "Working for the City was a very rewarding and fun experience. As a summer student you are tasked with multiple responsibilities and are expected to adequately follow through on every one. Excellent job experience and fun people. 10/10 recommend", "pros": null, "cons": null, "date_created": "November 19, 2017"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1buu5mba21d071vd", "rating": 4.0, "text": "Working as a refuse collector for the city of Edmonton was A job different from any other. The amount of energy needed for this job was amazing! I enjoyed the workout every day. Teamwork at this job was crucial or the day turns out hard. The hardest part of this job is working overtime and fewer breaks. After throwing 40,000 lbs garbage gets tiring.", "pros": "Good Workout", "cons": "Easy to be injured", "date_created": "November 14, 2017"},
{"id": "1btvfqrv41d1766n", "rating": 2.0, "text": "political and management is discriminatory. for a city operation there is a lot of favoritism. work hard and under valued as employee. men rule woman work even harder.", "pros": null, "cons": null, "date_created": "November 2, 2017"},
{"id": "1btv1pevdb80mb5h", "rating": 5.0, "text": "Was employed only for the election and enjoyed working it and meeting new people.  It was very well organized and would definitely work it again.  City of Edmonton is a company I would really enjoy working with.", "pros": null, "cons": null, "date_created": "November 2, 2017"},
{"id": "1bts5f2jeb80mdco", "rating": 4.0, "text": "Busy work environment. I learned to deal with all types of people.\rSupervisors were great.\rLearning to deal with difficult people\rExcellent co-workers.", "pros": "Great benefits, over all great place to work", "cons": "Management could be more involved.", "date_created": "November 1, 2017"},
{"id": "1btr3rb6qbrfrb47", "rating": 3.0, "text": "The culture behind the job is fine, the city promotes safe work. Management can be very unorganized and patrons can get abusive, which is the hardest part of the job. The city does pay way better than anyone else in the industry.", "pros": null, "cons": null, "date_created": "November 1, 2017"},
{"id": "1btb3s35h1d0841e", "rating": 5.0, "text": "very friendly and accommodating staff that perform fantastic on the job training. As a supply chain major, I learned a lot about the warehousing/logistics industry.", "pros": null, "cons": null, "date_created": "October 25, 2017"},
{"id": "1bstve805b87k9bf", "rating": 5.0, "text": "Flexible hours, supervisors are understanding and great support from the team.\r There is equality in the workplace, lots of learning and training to maximize your customer service .", "pros": null, "cons": null, "date_created": "October 20, 2017"},
{"id": "1bqvmgcq6b86lbkv", "rating": 3.0, "text": "The City of Edmonton provides amazing benefits and salary but doesn't have much work for its student employees. It can be difficult to find enough work to get through the day at times depending on who your supervisor is", "pros": null, "cons": null, "date_created": "September 26, 2017"},
{"id": "1bqdt7072aka0am8", "rating": 1.0, "text": "A very laid back and easy job to do. I personally did not enjoy working there at all. The work in itself was not bad, the people i worked with were not good at all. There is so much drama and behind the back secrets, it felt like i was in high school again. I think they need to fix how they do their hiring and fix upper managements decisions. a lot of times we were wondering why we were doing something when there is either more important things to do or a better way of doing it. \r ex. we were picking/cutting and spraying herbicide on already dead weeds that have already seeded out for the next season.-- to do so is absolutely pointless, we should be preparing residual herbicide to kill weeds before they germinate next year!", "pros": null, "cons": "only 8 hour days with no overtime", "date_created": "September 19, 2017"},
{"id": "1bqaodt4v5j5ifb3", "rating": 4.0, "text": "if you work hard and honest, people will notice. although the union spoils the atmosphere with feeding the workers egos it is a fun place to work and if you are related to someone in the city of Edmonton you have a way better chance of working there.", "pros": "you can sit around for 45 minutes and get paid for it at the end of your shift", "cons": "none", "date_created": "September 18, 2017"},
{"id": "1bpp9bt6mb865era", "rating": 4.0, "text": "good work balance\rbetter benefits\rnice people to work with.\rvery accessible\rrelax environment\rlearning a lot of things\rroom for growth\rvery transparent", "pros": null, "cons": null, "date_created": "September 11, 2017"},
{"id": "1bpp3raiqb826a4c", "rating": 4.0, "text": "I just started but everyone is very nice and accommodating. They support your decisions made on the job and there are lots of opportunities to ask questions", "pros": null, "cons": null, "date_created": "September 11, 2017"},
{"id": "1bpcr6gk95n9fcbg", "rating": 3.0, "text": "There really isn't much I can add here as the title this is under does not quite match what it should. None the less the City would be a fun place to work I'm sure.", "pros": null, "cons": null, "date_created": "September 6, 2017"},
{"id": "1bpcp623mb85r8e6", "rating": 4.0, "text": "The work load for the city of Edmonton, is a hard a tough day on the mind and body. What I have learnt from working from the city is, how I can better cooperate with everyone in the work environment, and how I can become a better leader in a work place environment. The most enjoyable part of the job is being about to enjoy the wonderfuk weather or being able to work with a group with people. The hardest part of the job is going to be the long laboring work you have to do.", "pros": "you get to drive brand new cars", "cons": "cons the long hour shifts", "date_created": "September 6, 2017"},
{"id": "1bo2v0hmfb80q8qa", "rating": 1.0, "text": "Good place to work if you are looking for a stable job, people are come and go. Work life balance is good as well. Lots get togethers every once in a while", "pros": null, "cons": null, "date_created": "August 21, 2017"},
{"id": "1bmg2jva9b88rat2", "rating": 4.0, "text": "I was only a temp so I can not provide much on how things would have been if I had been there longer.\rIt was a nice place to work, and I made a lot of nice friends.", "pros": "nice people", "cons": "low pay", "date_created": "August 1, 2017"},
{"id": "1blgi6jag5j4idie", "rating": 5.0, "text": "I worked for the City of Edmonton in 2016 and I can say it was the best experience ever. Not only is everyone so easy going but the training and education they provide and ongoing learned made it even better. Getting every second friday off or every second monday made my family balance manageable. Everyone was easily approachable and there is so much room for advancement. If you are able to get on with the city stay with them.", "pros": "Awesome Wages, Free Classes", "cons": "Parking Downtown is expensive", "date_created": "July 20, 2017"},
{"id": "1blgck320b80j8s3", "rating": 4.0, "text": "Great place to work. Low key and laid back. Be prepared to do a lot of paper work just to use the washroom. They have a very documented system. Welcome to municipal work!", "pros": null, "cons": null, "date_created": "July 20, 2017"},
{"id": "1ble55a9a1d0d0p3", "rating": 5.0, "text": "very accommodating environment, pay is great and work is easy. most people are good and managers do listen. You may run into the odd ones who are protected by the union", "pros": "pay work", "cons": "union", "date_created": "July 19, 2017"},
{"id": "1bksa355haqho8o0", "rating": 2.0, "text": "Hauling waste from the transfer facility to a land fill was fine.  Its a fairly dirty, smelly job which is what should be expected.  Interesting to a point but not much for excitement.  Management was led by an awful person that probably had to pay people to be his friend.  Zero people skills.", "pros": "Decent pay, steady hours", "cons": "no chance at permanent hire. unionized", "date_created": "July 12, 2017"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1bk8ekf3fbrd78r9", "rating": 5.0, "text": "- Customer service\r- Patience\r- Conflicts resolution\r- Multitasking\r- Flexibility \r- Great work culture\r- Respect\r- Appreciation \r It`s a very enjoyable work place. Co-workers are very respectful.", "pros": "Flexibility", "cons": "Difficult customers sometimes", "date_created": "July 4, 2017"},
{"id": "1bjpndn1f5n8vbjo", "rating": 5.0, "text": "City of Edmonton is a good place to work with job security and work life balance\rgood equipment , health and safety is #1 in regards to worker safety, with continued training and education to further educate the workers", "pros": "job security", "cons": "management", "date_created": "June 29, 2017"},
{"id": "1bj48b6ffb82fcvg", "rating": 5.0, "text": "It is a place for growth, i've met some of my closest friends through the city of edmonton. The people who work there are kind,funny,caring and most of all respectufl,", "pros": "free lunches", "cons": "it can be to long", "date_created": "June 20, 2017"},
{"id": "1biu02hqtb84jbs5", "rating": 2.0, "text": "The facility i am in is in serious need of better quality leadership roles. There is no accountability for staff, where people can literaly come into the zoo do nothing for 8 hours and this is acceptable to management. The rules of the collective bargaining agreement are only followed when it suits the management team.\rIve grown to the point where I realize I am powerless to change the problem and the only thing I can do is change my involvement in the problem.\rI do enjoy the atmosphere and my co workers are great I just want a change of scenery.", "pros": "Work around the animals", "cons": "Lack of leadership/accountability", "date_created": "June 18, 2017"},
{"id": "1biq67hh252spal7", "rating": 5.0, "text": "During the summer job at the City of Edmonton, I was working directly under the professional mechanics. My supervisor taught me a lot about the equipment such as how to make repairs on the hydraulic systems and diesel engines. In the meantime, I was working with my supervisors and colleges closely to learn quickly and welcome the chance to work under other experienced mechanics that I know can help teach me the things that cannot be learned in a classroom. I have some understanding of what this entails and eager to learn more.", "pros": null, "cons": null, "date_created": "June 16, 2017"},
{"id": "1bimqr6frb89jftd", "rating": 2.0, "text": "this place is a good work place that has lots and lots and lots of fun. and it is also really fun because they hire people with good skills and good personalities", "pros": null, "cons": null, "date_created": "June 15, 2017"},
{"id": "1biekequbbre8cof", "rating": 4.0, "text": "The City of Edmonton is a great place to work where it is very diverse and lots of opportunities for growth. They provide most positions to allow for a great work to life balance. \r because of the size of the company, you can get that I'm just a number on a piece of paper feeling, but the supervisors for each department are very involved with their staff.", "pros": "Flexibility", "cons": "voice doesn't get heard", "date_created": "June 12, 2017"},
{"id": "1bi5agv1lb8149gh", "rating": 5.0, "text": "This is an awesome job. You spend the whole summer outside impacting and learning from the children who visit your green shack. Each child has something special to learn from them. You will be challenged daily to grow and be better. The supervisors are always ready to assist you in your need to make your summer programming successful. There is an awesome training program in place to aid each staff member.", "pros": null, "cons": null, "date_created": "June 8, 2017"},
{"id": "1bh28tqef5j5bab5", "rating": 4.0, "text": "10 to 13 hours a day Tue to Fri.\rSafety meeting every week. \rGood for new drivers to learn commercial driver industry.\rGood pay Good benefit\rPhysical work with drive.\rIf you work with partner, usually switch every hour drive and load.\rIf you do not like to drive all day, this is decent job.", "pros": "unionized", "cons": "politics", "date_created": "May 26, 2017"},
{"id": "1bgoo0em0b8b7b25", "rating": 3.0, "text": "The people I work with are awesome, however, the hours are extremely inconsistent (3 hours some weeks and 25-40 other weeks), there is no seniority (you get the same treatment and hours as someone who has been there a week or 5 years), no benefits or paid vacation.", "pros": null, "cons": null, "date_created": "May 22, 2017"},
{"id": "1beo6d9iqb83k87p", "rating": 3.0, "text": "There was no good old days there. You were always on guard to keep out of site. People spent there time trying to advance there own carers. Was not a good place to work.", "pros": null, "cons": null, "date_created": "April 27, 2017"},
{"id": "1bdf5d9uq5n9mdpk", "rating": 5.0, "text": "It was a truly amazing time working with the city. Incredible people to work with within your division but there is a bit of animosity between sections (i.e. The lifeguards and the Rec Techs didn't get along). Overall a very positive experience.", "pros": "Positive environment and free food", "cons": "Full day shift", "date_created": "April 11, 2017"},
{"id": "1bcvh7sbeb821b70", "rating": 4.0, "text": "My position was challenging, I had a great team of interesting and like-minded colleagues. \rI enjoyed the work-life balance, the benefit plan and the pension plan contributions. \rThe hardest part of the job was trying to take direction from multiple stakeholders, City Council, internal management as well as citizen concerns, developers etc. It was hard to balance many different opinions.", "pros": null, "cons": null, "date_created": "April 5, 2017"},
{"id": "1bc8dv078b85fc80", "rating": 3.0, "text": "If your supervisor likes you personally, your career advancement options are endless. If not, you will be transferred endlessly around your departments and prevented from advancing, regardless of relevant skills and experiences.", "pros": null, "cons": null, "date_created": "March 27, 2017"},
{"id": "1bc46mm145nd0es0", "rating": 2.0, "text": "I've been all over in various city departments. Has the potential to be a great work place however politics come into play when looking to advance. It's all about who you know so network network network. Some coworkers from some departments were great. Felt like people only saw negative and really missed out on the positive and lots of really great valuable employee's are leaving due to management in various area's again because all the who you know stuff that comes to play", "pros": null, "cons": null, "date_created": "March 25, 2017"},
{"id": "1bbu97b1cbrd8dp8", "rating": 5.0, "text": "the people that work there are amazing. the job can be stressful but its amazing a great place to work. the only hard part is no matter how long you have been their there is no set work times. it changes day to day even. not for everyone but i loved it.", "pros": null, "cons": null, "date_created": "March 23, 2017"},
{"id": "1bbf3inpaak50892", "rating": 5.0, "text": "CoE IT process are solid, everyone treats you as if you are a part of the big family.\rEveryone is willing to help and provide the information that you need.  Although there are politics this is not a prevalent as other government agencies.", "pros": null, "cons": null, "date_created": "March 17, 2017"},
{"id": "1bb4okkgqbrch840", "rating": 5.0, "text": "i enjoyed my job but i have no kids at home and i would love to return back to highway driving i have always wanted to return back to the highway driving as it was always my wish.", "pros": null, "cons": null, "date_created": "March 13, 2017"},
{"id": "1bb34ft0l1fdt5rl", "rating": 5.0, "text": "This was a volunteer job i did for three summers in a row it was pretty awesome gaining all of the experience that i was able to working with the children", "pros": null, "cons": null, "date_created": "March 13, 2017"},
{"id": "1baqa7c5i1d0c2p3", "rating": 4.0, "text": "Dealing with the public can good and bad depending on every bodies attitude. All in all its a pretty good place to work, the staff are easy to get along with.", "pros": null, "cons": null, "date_created": "March 9, 2017"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1b9or8hl5ak5fcoe", "rating": 5.0, "text": "Worked with persons who were looking for affordable housing. Some days were challenging as we also housed the \"hard to house\" but on the average it was a very positive job and the staff worked together to make a relaxed working environment", "pros": "Satisfaction in seeing people housed that were struggling", "cons": "Long hours", "date_created": "February 24, 2017"},
{"id": "1b8neluk7brdqaid", "rating": 3.0, "text": "The city is a good place to start out with a job while in school, the hours are usually manageable and the pay suffices. Fun and the other employees usually are good to work with unless they are too young.", "pros": null, "cons": null, "date_created": "February 11, 2017"},
{"id": "1b8kej32v5j63ehj", "rating": 5.0, "text": "I worked in a security and driver role for just over 3 years. The City of Edmonton is an excellent employer. They were committed to making the job safe.", "pros": null, "cons": null, "date_created": "February 10, 2017"},
{"id": "1b8cqgtsjbrdq99p", "rating": 5.0, "text": "Working with the public through the City of Edmonton has been truly rewarding. I enjoy my shifts which require me to interact with participants in the city events. My work is rather simple and the communication is superb between employees.", "pros": null, "cons": null, "date_created": "February 7, 2017"},
{"id": "1b87hv57vb88kcqk", "rating": 5.0, "text": "Strong commitment to work life balance with services to citizens and customers as the priority.  \rProvide great training and personal advancement.  \rLots of programs and community involvement opportunities", "pros": "Committed to quality service delivery and work life balance", "cons": "N?A", "date_created": "February 5, 2017"},
{"id": "1b7svloaeb80qfs7", "rating": 4.0, "text": "I have enjoyed my time at ACSA, I gained so much knowledge of the construction industry and how important their job is in the community. The association has a strong safety oriented environment.", "pros": "Great hours, benefits, positive environment", "cons": null, "date_created": "February 1, 2017"},
{"id": "1b7r7p9nbb871a4l", "rating": 4.0, "text": "A bit unorganized in the labour departments. Each department is silo'd and communication doesn't take place across departments. Easy going work that is outside and high wages.", "pros": null, "cons": null, "date_created": "January 31, 2017"},
{"id": "1b7c84ss31d00331", "rating": 3.0, "text": "Good atmosphere , people are nice and welcoming. My only concern is not having much job security, no benefits, very minimum chance of advancing.", "pros": "Free membership to City Recreation Facilities", "cons": "No job security, no benefits & few hours", "date_created": "January 25, 2017"},
{"id": "1b7bc6rqjb86fdpb", "rating": 5.0, "text": "Great pay, good management, and great work/life balance. I've been there as a temp, but people treat you nicely and there's a sense of team when solving problems, good place to work for", "pros": "Great management, work life balance", "cons": "things might be slow sometimes", "date_created": "January 25, 2017"},
{"id": "1b6nk3t8ub85te2n", "rating": 5.0, "text": "Every day brought new challenges. Worked with an awesome crew and management. I learned so much about different types of building and site maintenance. Had a fantastic time engaging and talking with the people of Edmonton.", "pros": "Easy going people to work with. New challenges every day.", "cons": "Was only able to put in 8 hours per day. Longer hours would have been nice.", "date_created": "January 17, 2017"},
{"id": "1b68lmvee52src9u", "rating": 5.0, "text": "Must meet City standards for job times!\rShift work bottom employees generally work nights and afternoons for at least 7-8 years!", "pros": "job security", "cons": "Shift work", "date_created": "January 12, 2017"},
{"id": "1b62bbtj9akd3ets", "rating": 4.0, "text": "I loved working with the Animals and the people in the city. However being a peace officer job and a temporary competition for a permiment position, there was little team work between the new recruits, and a large clique established. This made it difficult for the less extroverted, \"popular\" people to be hired.", "pros": "Great wage, working with animals.", "cons": "competitive environment, clique present.", "date_created": "January 9, 2017"},
{"id": "1b58e297eb8aibfq", "rating": 5.0, "text": "The City of Edmonton offers many opportunities to learn new skills with the School of Business program.  The typical work day is very busy multi-tasking a large variety of duties.  Working with co-workers from the management team and the administration team makes some days very challenging and most days very rewarding.", "pros": "Opportunities to learn new skills, benefits, pension", "cons": "None", "date_created": "December 30, 2016"},
{"id": "1b44q0vnraqhqcfp", "rating": 5.0, "text": "great place for a career with job security and affinity for proven workable solutions that will improve customer services and make a better staff personnel.", "pros": "work life balance", "cons": "none", "date_created": "December 16, 2016"},
{"id": "1b3vfunqrb85mdab", "rating": 5.0, "text": "Management was extremely competent. I liked working in the office space where everybody was friendly and interesting. It was an intellectually stimulating office.", "pros": "Nice lunch room", "cons": "only th downtown location", "date_created": "December 14, 2016"},
{"id": "1b3l7ag7q5na791h", "rating": 4.0, "text": "Good Experience, people are nice and welcoming.  unfortunately without seniority there is not much room for advancement so must build up seniority as jobs go to internal candidates first", "pros": null, "cons": null, "date_created": "December 10, 2016"},
{"id": "1b3domm3ub8578ph", "rating": 3.0, "text": "We do the daily tasks usually in partners or in groups. Its not typically too busy and the work atmosphere is good. The hardest part is that its physically demanding sometimes.", "pros": "3 days off a week", "cons": "not structured", "date_created": "December 7, 2016"},
{"id": "1b312hv95aqgqb4h", "rating": 3.0, "text": "Great benefits, decent pay and awesome job securty. The ETS inspectors and the passengers drove me away from this job.\rI worked here for 5 years", "pros": "Split shifts, great con workers", "cons": "Management", "date_created": "December 2, 2016"},
{"id": "1b2sd5qr2ak9udir", "rating": 4.0, "text": "A variety of different work tasks was available which helped mix up the weeks. Great place to work for a university student.", "pros": null, "cons": null, "date_created": "November 30, 2016"},
{"id": "1b2rjub1n1d0i6dm", "rating": 5.0, "text": "-Allows you to keep learning\r-Learned patience and to work with difficult people and situations\r-Early and late hours allowed for determination to excel", "pros": null, "cons": null, "date_created": "November 30, 2016"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1b26cf1sjas2b9rl", "rating": 5.0, "text": "City of Edmonton is a fast paced goal oriented environment. I learned how to work within a team environment. Co-works are very considerate and helpful", "pros": null, "cons": null, "date_created": "November 22, 2016"},
{"id": "1b255557kas2b9u9", "rating": 5.0, "text": "The work atmosphere is amazing. Everyone gets along and the office dynamics are laid back yet professional.  All upper management are eager to help you succeed and make the time to speak to you and understand that you are a person, not a number.", "pros": null, "cons": null, "date_created": "November 21, 2016"},
{"id": "1b24hsm1vbvtgdn0", "rating": 5.0, "text": "worked as a Census Worker 2016, it was my first census worker job in Canada. Helped me a lot to understand a lot of things. Helped to grow my professional experience and met with so many people, under 1 job.", "pros": "helped to gain experience.", "cons": "less pay & in end nobody ask, how to improve for next time", "date_created": "November 21, 2016"},
{"id": "1b0m7v3aaas0ucb1", "rating": 5.0, "text": "duties included turf grass trimming & pruning, with 3 other employer's to ensure proper maintenance of city and how to maintain them\r i learned about all the equipment and the proper way to use them and being safe and how to maintain them\r management was amazing\r my co-workers were amazing\r turf grass trimming and pruning\r everything was enjoyable i loved it", "pros": "great people and fun environment", "cons": "there was none", "date_created": "November 3, 2016"},
{"id": "1b01cfm4pak62bc9", "rating": 5.0, "text": "Wonderful place to work. I was treated with respect, and given the opportunity to increase my skills and knowledge while at work.", "pros": "Excellent benefits / pension plan", "cons": "None", "date_created": "October 26, 2016"},
{"id": "1av1sl14mb868ar5", "rating": 5.0, "text": "They are very supportive \rlots of learning \rI like the attitude towards work\rI like the schedule \rthe benefits are good\rall my co workers are professional", "pros": "good salary", "cons": "no free parking", "date_created": "October 14, 2016"},
{"id": "1au8p4aknaqh0dem", "rating": 2.0, "text": "Workers are unionized under some kind of controversial Union, collecting premiums from workers/members from every pay check, however there is no any indication that Union cares about workers paying premiums.\rMost people are hired on temporary basis, no any pension or benefits, and this temporary employment may last 5 years before you qualify to apply for permanent job with benefits.\rHardly ever temporary workers have a chance to say what they think, they may end up behind the gate the same day if someone doesn't like what was said.", "pros": null, "cons": null, "date_created": "October 4, 2016"},
{"id": "1au6rm1elb851ba9", "rating": 1.0, "text": "Very busy typical work day, Learned team work, Managed 16 employees and trained them. I have very nice co-workers, The hardest part of the job is very little time and too many things to do.", "pros": "Accurate and best search engine", "cons": "None", "date_created": "October 3, 2016"},
{"id": "1arjgqcnib81mdm5", "rating": 4.0, "text": "I excelled in my first aid training and became more confident in dealing with public disputes, recognizing hazards and managing my time.", "pros": "Great environment, provided with many first aid courses", "cons": "Higher levels of stress, long hours", "date_created": "September 1, 2016"},
{"id": "1ar67gh5iaqisfnq", "rating": 3.0, "text": "There is no typical day at the City of Edmonton. Each day we have the opportunity to try something new and continue to master the multiple duties a Laborer 1 has. If there is a co-worker unfamiliar to performing certain duties it is my understanding to show and demonstrate the correct and safe way in doing so. I'm adaptable and easy to approach. I keep a positive and happy attitude which shows in my work or puts a smile on your face.", "pros": null, "cons": null, "date_created": "August 27, 2016"},
{"id": "1ar1sgtr5b817d8m", "rating": 5.0, "text": "The Leaders in Training program is a great way to develop the social skills required by many employers. It helps you communicate effectively with all age groups.", "pros": "great people, good hours", "cons": "own transport required", "date_created": "August 25, 2016"},
{"id": "1aq21aelnak56a4q", "rating": 1.0, "text": "They hire their kids and friends. Most qualified applicants aren't given interviews. I am an engineer and couldn't get a call back for engineering, maintenance or basic labour jobs.", "pros": "None.", "cons": "Too many to name", "date_created": "August 13, 2016"},
{"id": "1aon3tfs6aqhqepa", "rating": 5.0, "text": "Each day was different, the job kept me on my toes and it gave me room to grow as an individual. The team was amazing, they continually look out for you to support your growth. I felt important working at the Emergency Systems side of the Fire Rescue Services.", "pros": "amazing team and mentors", "cons": "no benefits for temporary full-time employee", "date_created": "July 27, 2016"},
{"id": "1aoc7l5s7ak4pek3", "rating": 5.0, "text": "Working with the kids at the park green shacks made everyday new and interesting. Listening to all the stories they had to tell was very enjoyable. I got to meet and get to know new children everyday.\rWhen I would teach a child something new or give them helpful advice on a problem, seeing the smiles on their faces afterwards was the most rewarding part of the job.\rThe staff and management team were always happy and willing to exchange tips and advice to any issues or concerns that happened on site. We all worked very well together, and nobody felt excluding in any aspect of the job.", "pros": "Amazing staff and management", "cons": "Only a summer job", "date_created": "July 23, 2016"},
{"id": "1ao28sok1b85v99e", "rating": 2.0, "text": "I worked for DATS for about 6 months. The job itself was great. Hard work, challenging, rewarding. Received several client commendations on my work.  There was a lot of bullying, harassment and racism at the scheduling/operations level however. Supervisory staff were incompetent and arrogant. Management blindly followed supervisory staffs lead. I was assaulted by a client on video and called the police after defending myself. I was completely cleared of ANY wrongdoing by the Edmonton Police Service. However, I was told by Senior management (before police or DATS had completed their investigation) that it would have never happened if I had acted appropriately (victim blaming) and my probationary period was extended. Senior management also encouraged me to look at other employment options within the City of Edmonton at this time. This resulted in complete loss of trust and faith in the management and a downward spiral in my work and all aspects of my life. Supervisors who now had decided to micromanage my work (because I refused to meet with them without union representation after earlier harassment) made my job much more difficult. Eventually my stress and the pressure I was under to perform caused me to make poor decisions such as getting a photo radar ticket in an empty bus late at night in my now extended probationary period. I was let go. If I wasn't in extended probation I would have gotten a one day suspension and had to pay the fine. As many DATS operators have had to do. Everyone makes mistakes. My mistake was thinking that the Union I was a part of could do anything - more...", "pros": null, "cons": null, "date_created": "July 19, 2016"},
{"id": "1anueidf5ak97frm", "rating": 1.0, "text": "Where to begin. The shop is a mess, you spend a lot of time looking for shop tools and equipment. No time is provided to clean up the shop so you constantly work in other peoples messes. The parts department is useless and you frequently get wrong parts even when providing the old parts as samples. Don't bother asking foremans for technical assistance because they have no experience and they're not even heavy duty techs. Knowledge and hard work gets you no where. You must know people in managment to move up. The less experience you have and the less you know about your job the better the chance of being promoted. All of the paperwork gets completed by the technicians so not sure what the foremans do. They frequently use works like \"efficiency\" and \"productivity\" yet nobody seems to know what it means. The rotation schedule is insane giving you 8 nights in a row with no overtime in the winter. There's little to no overtime unless you manage to work on stats. I think of it as opposite land since all the wrong people get promoted,   and nobody cares about anything and 6 months technical experience is good enough to be foreman because your buddy is in a higher position. Don't bother applying for the internal job postings because they already know who they want and create a posting to avoid suspicions. You pay for the benifits and they're useless and expensive. There are way too many deductions on pay checks, benefits, union dues, pension and charitable donations that nobody knows what it's for but it's mandatory. Once you take the pension your benefits get cut off. You have to pay - more...", "pros": "Paychecks don't bounce", "cons": "Bad rotation schedule, disorganized, too many pay deductions, inexperienced management", "date_created": "July 18, 2016"},
{"id": "1alvi4vklak93beg", "rating": 5.0, "text": "I learned life skills and life lessons that will benefit me in the fute.  Being still in high school it allowed me to see how the career of a fire fighter really is and if I want to persue it.", "pros": null, "cons": null, "date_created": "June 23, 2016"},
{"id": "1alvaamct5n9qfn3", "rating": 2.0, "text": "I worked there for one summer. All it was,was problem after problem. Management thinks there all that and more same with some of the techs and things that get brought up by the workers hardly get looked at again because they dont think we know what we are talking about. I was one of the first to be laid off becasue i had a grievance in and was not rehire do to having family work there. I have not been able to get rehire in any area of the city due to this which is bias in a way. \rThe people you actually work out in the field with are good though.", "pros": "co workers", "cons": "no life, management isnt good", "date_created": "June 23, 2016"},
{"id": "1alnbege7b85ablc", "rating": 4.0, "text": "Salary is low to private sector... Next to no negotiation on hiring. \r Workload is good, management is very good. Everyone here is here to better the City and are very helpful. Safety is very important.\r As you can imagine there is lots of red tape and approvals for everything. \r Benefits are pretty standard...", "pros": "Helpful people, friendly and accomidating", "cons": "Red tape, slow approvals, low salary, very few additional perks", "date_created": "June 20, 2016"},
{"id": "1alhrjvtmak5tar5", "rating": 4.0, "text": "Great opportunity for someone young starting out in their career. Not a lot of opportunities to advance depending on what area you are working in.", "pros": "Job security", "cons": "Too much corporate involvement, always changing things because they feel it would be better but most", "date_created": "June 18, 2016"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1ald5q0b2b80re2a", "rating": 5.0, "text": "I enjoyed working at The City of Edmonton for three main reasons. One is that everyone is extremely friendly and helpful towards each other and everyone take safety seriously. Second is the nice working condition in the shops. Third is the great work schedule.", "pros": null, "cons": null, "date_created": "June 16, 2016"},
{"id": "1ald22a20ak8hckk", "rating": 5.0, "text": "I was on my own. I made daily contact with my supervisor to report daily progress. It helped me to talk to people to help gain the information I needed.", "pros": "At my own pace", "cons": "Only temporary until end of census", "date_created": "June 16, 2016"},
{"id": "1ala1md05ak5jbqm", "rating": 5.0, "text": "Always making the day a productive day, but also interact with customer or clients to make a better atmosphere, hard work pays off. interact with co workers to socialize more and to interact to improve. there not hard part in any job, as long you put your mind to it. and most enjoyable part of any job is just doing what your suppose to do and work as hard as you can", "pros": null, "cons": null, "date_created": "June 15, 2016"},
{"id": "1al098dlhas0q9tu", "rating": 5.0, "text": "Learned so much on the job and was welcomed at the job. There was lots to learn and everyone was well respected. It was a fun place to work", "pros": null, "cons": null, "date_created": "June 11, 2016"},
{"id": "1aj2fdn47b85fb7l", "rating": 5.0, "text": "Very skilled staff always willing to help you learn and show you the secrets of the trade strongly recommend it to anyone looking to work in a unionized job", "pros": null, "cons": null, "date_created": "May 18, 2016"},
{"id": "1ai9149mfak94bbk", "rating": 5.0, "text": "I worked with brilliant people at the City of Edmonton. Leadership and management are great. Also, there is great work culture. I was lucky enough to have some freedom to pursue issues that I thought were important.", "pros": "flexible hours, great coworkers", "cons": "political gridlock to good ideas", "date_created": "May 8, 2016"},
{"id": "1ai3cpuf81d025qv", "rating": 5.0, "text": "Everyone at the City of Edmonton is very friendly and very supportive. They value your talent and help you to build more for your future employer. Everyone here works as a team and anyone who has some trouble or issue with something can easily go to the Manager or Architects for help and they do it on the spot without even thinking of anything else. For me this is the wonderful place to work at and for. Knowledge is the key in the City of Edmonton as everyone here has an experience of over 15 years or over which is a very good thing for any intern as we can learn a lot from this experience.", "pros": null, "cons": null, "date_created": "May 6, 2016"},
{"id": "1ahesb9851d0v1m3", "rating": 4.0, "text": "This project affected all areas of the City of Edmonton. The project was very challenging. All areas of the City were excited to upgrage their web portal.", "pros": "People, Process", "cons": "n/a", "date_created": "April 28, 2016"},
{"id": "1ago9o9os5naufn7", "rating": 4.0, "text": "Working for a corporation, an employee of the city is an art form.\rOne must be able to balance, emotions and personality with the understanding you are not only an employee but also a steward.", "pros": null, "cons": null, "date_created": "April 19, 2016"},
{"id": "1agm2np4aas14e82", "rating": 1.0, "text": "job was easy and i didnt learn anything i didnt already know. was basic labor tasks. most co-workers were great but some were annoying. management was the reason i left.", "pros": null, "cons": null, "date_created": "April 18, 2016"},
{"id": "1ag3622h7as3ccvs", "rating": 5.0, "text": "nice to be able to provide a service to help people who do not drive, to get to and from work and wherever else they need to go", "pros": null, "cons": null, "date_created": "April 11, 2016"},
{"id": "1af6p69bnb82aagq", "rating": 5.0, "text": "Offers big  career opportunities and stable and secure work.  You work with mature and professional people. You will always look forward to coming to work everyday!", "pros": null, "cons": null, "date_created": "March 31, 2016"},
{"id": "1aeo3c2q6ak9ta2n", "rating": 5.0, "text": "Meeting in the morning to discuss various conditions of parks, or safety talks.Going to next location, then assess what is needed.I always enjoy the social gathering like Bar-B-Q for a job well done.", "pros": "social gathering once a year during the summer", "cons": "Weather conditions", "date_created": "March 25, 2016"},
{"id": "1ae0jdfnib85fdbq", "rating": 4.0, "text": "its a great gig when it snows lots otherwise no work at all, the city of Edmonton demands at least 4 to 6 centimeter's b4 they can call workers for graders.", "pros": null, "cons": null, "date_created": "March 16, 2016"},
{"id": "1ae0bdsjg1ags0o4", "rating": 4.0, "text": "A great place to work. Attention to training and safety is top notch. All employees seem to take great pride in maintaining the beauty of the facilities they have been assigned to.", "pros": "Public Appreciation", "cons": "Short Season", "date_created": "March 16, 2016"},
{"id": "1adetj132b81iamu", "rating": 3.0, "text": "I have been teaching yoga with the City of Edmonton since 2007. I am happy teaching with the City. The Program Coordinators are very accommodating and share information as they receive it.", "pros": null, "cons": null, "date_created": "March 9, 2016"},
{"id": "1ad9g4h7ab855c9m", "rating": 4.0, "text": "It was nice to enter a work force, full of such accepting people. The 'family' that has been created there was amazingly helpful and fun. There was never a time where someone was not willing to assist with either answering a question, or lending a helping hand. It was a great place to learn new and helpful tips for an everyday life.", "pros": null, "cons": null, "date_created": "March 7, 2016"},
{"id": "1aa3cs4ujakbk846", "rating": 5.0, "text": "Easy going pace of work and in the heart of the city. Great IT Team, top management thinks about everyone.\rTypical day is 9-5 M-F with bi-weekly EDO - day offs\rlearned a lot\rManagement is great\rco-workers can be tough to deal with some times but very few places are immune to that", "pros": "Slow paced", "cons": "group politics", "date_created": "January 27, 2016"},
{"id": "1a9t3rm8qas3ham0", "rating": 4.0, "text": "Definitely some very good people to work with.  Positive, mentoring environment.  I was only employed in a temp capacity. Very rewarding.", "pros": null, "cons": null, "date_created": "January 25, 2016"},
{"id": "1a6n4038lakacecg", "rating": 5.0, "text": "My time working with  the City of Edmonton i felt welcomed and the staffing were quick to help when help was needed. Amazing working environment which made coming to work very enjoyable.", "pros": "Great Hours", "cons": "No Parking", "date_created": "December 16, 2015"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "1a5cpk566b84larc", "rating": 3.0, "text": "this Job was not very well run in a sense that they aren't the most organized with what the tasks for the day are. the benefits are great and same with the pay the only downside is that you don't know who you are going to be working with because the city uses the buddy system.", "pros": null, "cons": null, "date_created": "November 30, 2015"},
{"id": "1a50ra1bdak958ds", "rating": 5.0, "text": "My thirty (30) year career with The Edmonton Fire Department, provided me with personal challenges, beginning as a Recruit Firefighter, and concluding my career as a senior officer of the Department. I was very fortunate to not only enjoy and respect the people and officers that I worked with but to thoroughly enjoy the nature of the work that we complected as a team.\rCUSTOMER SERVICE  was paramount to the success of the Department, an objective that I took very serious personally.\r Whether assisting people at emergency or non emergency scenes or by representing the department at various educational opportunities or committee associations,  representing the Edmonton Fire Department was always a pleasure and my personal responsibility..\rAs a member of the Department there was every opportunity to learn at least one new thing every shift.\rI felt I was able to demonstrate the following attributes which aided me being successful as both a fire fighter and fire officer;\rMental - I had the mental capability to perform the job\rPhysical- I had the necessary physical capabilities for the position\rMoral - I have a good sense of community and public service. \rThe hardest part of my job was my decision to retire as my career was like working with a family for all those years.", "pros": "Professional Fire Fighter", "cons": null, "date_created": "November 25, 2015"},
{"id": "1a4vmnu9ab80l8d8", "rating": 5.0, "text": "Great work life balance, always very grateful being in the union and having great salary/benefits negotiated for on our behalf.", "pros": null, "cons": null, "date_created": "November 25, 2015"},
{"id": "1a3pa0a1l1agv4ba", "rating": 5.0, "text": "I have been with the Community Service Department for over 20 years, one of the reasons is it is a great place to work, excellent salary and great benefits.", "pros": null, "cons": null, "date_created": "November 10, 2015"},
{"id": "1a1c91p2dak7me50", "rating": 4.0, "text": "My job provided me with new tasks each day which were not only monotonous but were also challenging. I found the job stability was there. It provided me with a decent income and benefit. Although I worked mainly on my own I still felt a sense of teamwork.", "pros": null, "cons": null, "date_created": "October 11, 2015"},
{"id": "1a1bu0k1nakbg8gs", "rating": 5.0, "text": "Fun workplace with supportive management. Tons of growth opportunities. New initiatives are well received by the management. Excellent work/life balance.", "pros": null, "cons": null, "date_created": "October 11, 2015"},
{"id": "1a0sgedsdb8668gb", "rating": 5.0, "text": "Planning week by week is beneficial, you plan what you would like to do with the kids. Children keep you on your toes and you'll never have a dull moment. Regular hours is always great, and a great way to spend your summers if looking for a summer position. Friday in-services are great to gain new ideas and talk with co-workers and supervisors.", "pros": "the kids, co-wokers", "cons": null, "date_created": "October 5, 2015"},
{"id": "1a0b3m92mb85nc0r", "rating": 4.0, "text": "Great job, unfortunately for someone with a family it is not recommended unless you get on permanent.  No benefits otherwise.", "pros": null, "cons": null, "date_created": "September 28, 2015"},
{"id": "1a038r6ruakanb6j", "rating": 1.0, "text": "Avoid it if you like working for good people. I was treated poorly and if you want to move up or go anywhere hard work isn't noticed, but kissing up certainly is.", "pros": null, "cons": null, "date_created": "September 25, 2015"},
{"id": "1a00jjri3b85nala", "rating": 5.0, "text": "Great learning experience. I got to have different experiences but I feel as though they need certain new staff in order for the morale to go up .", "pros": null, "cons": null, "date_created": "September 24, 2015"},
{"id": "19voe7e4uas2rdn8", "rating": 4.0, "text": "Loved working here and being able to help reunite pets with their owners. People are very nice. 4 days on and 3 days off which is nice!!!", "pros": "animals!", "cons": "long days", "date_created": "September 21, 2015"},
{"id": "19uvgh2335ndpb73", "rating": 3.0, "text": "I liked working there and it gave me some great experiences needed for future jobs. I enjoyed working with all the employees.", "pros": null, "cons": null, "date_created": "September 11, 2015"},
{"id": "19u3a42be5nd8df3", "rating": 5.0, "text": "The City of Edmonton has very good people and it is very fun to work for. It is very structured and enjoyable. It is good to know that i could be involved in working for the City of Edmonton.", "pros": null, "cons": null, "date_created": "August 31, 2015"},
{"id": "19t690uss5n96egf", "rating": 4.0, "text": "Good work place benefits could be better, good equipment and fair security, General public on a bus can be a problem, but you have to be patient with them. Good job for someone who likes to drive and deal with the general public.", "pros": "pick your own shift", "cons": "Long hours", "date_created": "August 20, 2015"},
{"id": "19rnibbmnakbide7", "rating": 4.0, "text": "Same as the other city job, good pay, good people, the city has been good to me, trained me and gives me responsibilities i have been able to handle. For parks i inspect and repair playgrounds, drive a city issued truck and have all the required certificates.", "pros": null, "cons": null, "date_created": "August 2, 2015"},
{"id": "19q6o5760ak65c6q", "rating": 5.0, "text": "Wish I was able to stay around and continue to work into the winter. They said they were going to look for a position in a different department but I never heard anything from them.", "pros": "Great environment and managers", "cons": null, "date_created": "July 14, 2015"},
{"id": "19oek2ko71ahf4g5", "rating": 5.0, "text": "Great municipality, job security, and work life balance. Would recommend to work for the City of Edmonton to anyone. A bit of bureaucracy that is to be expected", "pros": null, "cons": null, "date_created": "June 22, 2015"},
{"id": "19nadk7j252vqfps", "rating": 5.0, "text": "Answering phones, data entry and document preparation, meeting booking and catering ordering.  Management was friendly as were co-workers. I learned many new things.", "pros": "Great pay and longer lunches.", "cons": "Difficult to get a permanent position.", "date_created": "June 8, 2015"},
{"id": "19m4ejcldak6jdog", "rating": 5.0, "text": "I love working for the city of YEG. It is faced paced, friendly environment that pays very well. As a part time employee I can almost make ends meet.", "pros": null, "cons": null, "date_created": "May 24, 2015"},
{"id": "19k8e65ftas1ecv7", "rating": 4.0, "text": "I didn't do an actual paid job with the city of edmonton but volunteered with them many times. It was an amazing work experience.", "pros": null, "cons": null, "date_created": "May 1, 2015"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "19jmjfu90b80qag9", "rating": 5.0, "text": "Worked on a knowledge management tool for the employees of the city to use. We consolidated information from different sources and inputed the information to the tool. Had to ensure that the information was accurate and concise. The most enjoyable part of the job was the opportunity to work with experienced marketing managers.", "pros": null, "cons": null, "date_created": "April 24, 2015"},
{"id": "19ikg3pdl1ah11ck", "rating": 4.0, "text": "One of the finest places I've ever worked. My work day typically involved a split shift where I was responsible for the transportation of 1 to 80 persons at a time. I worked alone but was never alone. My co-workers were positive people and were VERY supportive. The hardest part of the job was the bouncing involved while driving. It's the reason I had to go on LTD. \r The most enjoyable part of the job was the comradeship between all the drivers.", "pros": "Pay and benefits were great.", "cons": "Driving in poor weather and road conditions.", "date_created": "April 11, 2015"},
{"id": "19ics5n4vb80gf99", "rating": 4.0, "text": "Very thorough with the training highly recommend if your looking for a Lifeguard job, tonnes of room for advancement. Great place to work. Great co-workers,", "pros": null, "cons": null, "date_created": "April 8, 2015"},
{"id": "19i9119f7as0gb4b", "rating": 3.0, "text": "job was okay was merchandising new products for make-up and stuff. Would be fine with the job if it was more merchandising things other than care products.", "pros": null, "cons": null, "date_created": "April 6, 2015"},
{"id": "19hk77gus52sgdq8", "rating": 4.0, "text": "Landscape Inspections are always different, usually with lots of nice people and you get to work outside. The weather can be variable so you must dress accordingly.", "pros": "Challenging, rewarding, and fun", "cons": "Seasonal has its drawbacks", "date_created": "March 29, 2015"},
{"id": "19gnd65ovas0g8ap", "rating": 5.0, "text": "-8 hours per day minus lunch\r-land development\r-review drawings\r-adhere to any requests or tend to any inquiries\r-draft servicing agreements", "pros": "free lunches, good hours", "cons": "Office bound", "date_created": "March 18, 2015"},
{"id": "19gb0a9kqak8gdd2", "rating": 1.0, "text": "I worked underground for sometime with the city this position aint worth $35 hr its worth $50 per hr.  If you take the job you'll see what I mean.", "pros": "Benifits/ double time after 8", "cons": "youll see when you get the job", "date_created": "March 13, 2015"},
{"id": "19fgf6r6kak8gcek", "rating": 4.0, "text": "I have met a lot of great people working at the City of Edmonton.  Team work is valued there and mentoring is becoming high on the priority list and I respect that.", "pros": null, "cons": null, "date_created": "March 3, 2015"},
{"id": "19f0smg6oak4gbtk", "rating": 4.0, "text": "City of Edmonton DATS is a wonderful place to work with a great opportunity to learn, full training, great employees, and great benefits.", "pros": "Incentives for a job well done", "cons": null, "date_created": "February 25, 2015"},
{"id": "19ejobpgvas0gdf7", "rating": 4.0, "text": "Core group of dedicated upbeat employees with a strong team work culture.\rBeing able to multi task is a definite requirement for this position.\r All levels of management will be present at one time or another in a positive and supportive role.\r Never the same day twice.", "pros": "Provide quality customer service.", "cons": "Location", "date_created": "February 20, 2015"},
{"id": "19edd1o3qb84gb8m", "rating": 3.0, "text": "Good place to work, but terrible employees,lazy employees, and drama lots of drama. Also management doesnt hire enough extra people when people move... making work stressful.", "pros": null, "cons": null, "date_created": "February 17, 2015"},
{"id": "19darss3cas0g8vk", "rating": 5.0, "text": "The City of Edmonton is a great place to work.  There are great people and the work/life balance is excellent.  There's an excellent benefits package as well.", "pros": null, "cons": null, "date_created": "February 4, 2015"},
{"id": "19ctcg85u5ncgfeu", "rating": 5.0, "text": "Outstanding! Anyone with the drive to advance, were all given ample opportunities to do so. Management was supportive and eager to nurture and guide those with ambition. An incredible source of knowledge and wisdom to draw from. Many thanks to their recourses and willingness to help to educate their employees. Respect!", "pros": "many", "cons": "few", "date_created": "January 30, 2015"},
{"id": "19cc6oams5ncgbj4", "rating": 3.0, "text": "once at work your foreman will assign jobs according to condition outside. Learned lots of different types of equipment ranging from snow plows, tack truck, skid steers, sanders, tandem truck driving and other types of heavy equipment. Great group of employees to work with. Hardest part of the job is shift work during the winter season. Can enjoy things such as paid vacations, great benefits and always long weekends off.", "pros": null, "cons": null, "date_created": "January 23, 2015"},
{"id": "19b439djtak4gdt5", "rating": 3.0, "text": "Good place to work if your already set for life or looking to retire its not for young guys trying to buy a house and whatever else, There was not a lot of overtime so it was time for me to move on", "pros": "every second monday off paid vacation", "cons": "not enough money", "date_created": "January 8, 2015"},
{"id": "197p3a6t9ak8gci6", "rating": 3.0, "text": "I look forward to meeting new challenges and enjoy moving forward. Learned how to be a coach, confidante and counsellor. I enjoyed meeting new people and listening to their stories. As this was first experience with Unions, I learned a lot about seniority and shift selecting. The City is a large organization and I was able to contribute to the lager picture for the citizens of Edmonton. It was an experience.", "pros": null, "cons": null, "date_created": "November 27, 2014"},
{"id": "196gk4g5c5ncg8ab", "rating": 4.0, "text": "As a supervisor it was a stressful place, but working with a great group of Peers got me through the issues, In Management did not have Union protection, so when company reorganized I was let go, very dissapointed, as a person on the floor I enjoyed a long career doing the things I enjoyed", "pros": "Good people at my level", "cons": "No protection from uppermanagement", "date_created": "November 11, 2014"},
{"id": "1963h7fjdak8g96j", "rating": 4.0, "text": "I enjoyed the atmosphere \rLoved the job itself , but management was poor", "pros": null, "cons": null, "date_created": "November 6, 2014"},
{"id": "195rljl84ak8gfka", "rating": 4.0, "text": "Steady work and challenging.Rewarding being a part of a productive team", "pros": null, "cons": null, "date_created": "November 3, 2014"},
{"id": "193ra6vsu5ncg9ta", "rating": 3.0, "text": "While working at the city i learnt how to work in an agile organization, that undergoes constant reorganization.  I acquired the skills on how to integrate and collaborate and adapt with different tiers of the management.", "pros": "Earned day off program", "cons": "Too much bureaucracy", "date_created": "October 9, 2014"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "192s2c5lmak8g8bs", "rating": 5.0, "text": "Awesome place to work. Great people and managers.Great opportunities to learn new things. Lots of Career advancement opportunities.", "pros": "Career Growth", "cons": "24 hours", "date_created": "September 27, 2014"},
{"id": "1925fm0oqak8g9fr", "rating": 4.0, "text": "A typical day at work is very busy and never dull. learn new things all the time. I learned how to work a lot of the City of Edmonton's in- house programs and expanded my knowledge of the Microsoft office suite program.\r For the most management was great.  Sometimes it was hard to meet with management when i had a question to ask and would have to wait for them quite awhile.  I would ask as many of my co-workers the question that I had to ask my boss, and they were very helpful.  I would only go to my boss if none of my co-workers knew the answer to my question about certain projects etc.\r Sometimes clients/customers wanted certain things done immediately.  Due to some procedures, sometimes we  couldn't always do things as immediate as the customer would have liked, but i would always do my best to meet the customers expectations.\r Most enjoyable part of the job for me was dealing with the customers, I thoroughly enjoy working with the public.", "pros": "Wage is good", "cons": "Not being able to meet the customers expectations as fast as they wanted, but due to rules and regulations, things were out of my control.", "date_created": "September 18, 2014"},
{"id": "191tmqvf8ak4g8s4", "rating": 4.0, "text": "I enjoyed the people that I worked with.  Was a fun atmosphere.", "pros": "Free Lunch", "cons": "Long hrs", "date_created": "September 15, 2014"},
{"id": "190lben1rak4gdeh", "rating": 5.0, "text": "My days are long, but rewarding.  Building strong relationship is the/my key to success.  Accountability shouldn't be expected unless paired with authority.  Daily goal is helping my co-workers succeed in their work/job/life.  Managing scope creep is the hardest part of my job.  The most enjoyable part of my job is the satisfaction I feel when a project plan has been adopted, because I know it is a solid plan due to my strong understanding of the connectivities and dependencies within the organization.", "pros": "Working with all departments.", "cons": "Long hours and political influences", "date_created": "August 31, 2014"},
{"id": "18vnj2ijlak4g9pb", "rating": 3.0, "text": "It's a good place to balance you work and life, especially for staff need to take care of little kids or other family members.", "pros": "Extra day offs", "cons": "limited job advancement", "date_created": "August 19, 2014"},
{"id": "18vlbroe9ak4gde9", "rating": 4.0, "text": "Worked with some great people who I am still friends with today.", "pros": null, "cons": null, "date_created": "August 18, 2014"},
{"id": "18vj8t7igak4gcre", "rating": 4.0, "text": "People are so friendly and helpful. Lots of resources to learn new things and Opportunity to show you skills.", "pros": null, "cons": null, "date_created": "August 17, 2014"},
{"id": "18vafnmb05ncgdjq", "rating": 5.0, "text": "Great work environment, excellent managment, multicultural team.", "pros": null, "cons": null, "date_created": "August 14, 2014"},
{"id": "18undbc8vak4g9ls", "rating": 4.0, "text": "Amazing team spirit, uncapped potential for career and personal growth.", "pros": "Wealth of shared knowledge", "cons": "Hard to get your foot in the door.", "date_created": "August 6, 2014"},
{"id": "18u46shtcak8geqc", "rating": 1.0, "text": "If they did not pay as well as they do I'm sure they'd have a hard time finding employees. Upper management makes you jump through so many hoops. Definitely would not make it a career. Hours are terrible, and they don't provide any benefits.", "pros": "Some very awesome customers, easy job, air conditioning.", "cons": "Management has no idea what's going on, no communication or trust, no benefits, being taken advantage of", "date_created": "July 30, 2014"},
{"id": "18tushg635n8g9c6", "rating": 4.0, "text": "Worked with fantastic people, learned lots from great bosses and co-workers.", "pros": null, "cons": null, "date_created": "July 28, 2014"},
{"id": "18s7g4mq0ak4gcpp", "rating": 5.0, "text": "busy in morning with running repairs\rco workers are awesome", "pros": "paid after noon lunch", "cons": "shift work", "date_created": "July 6, 2014"},
{"id": "18rpn56ktak4gbnv", "rating": 5.0, "text": "Was only consulting on a short-term basis so unable to provide an in-depth review.", "pros": null, "cons": null, "date_created": "July 1, 2014"},
{"id": "18rcd0nnkak4gac4", "rating": 5.0, "text": "A pleasant place to work serving the community in a Recreational setting.  Co-workers quickly become friends and making the front desk a friendly approachable atmosphere.  Registering patrons in community programs and camps as well as collecting daily and monthly admissions for facility access. Most enjoyable part of my job is the public.", "pros": null, "cons": null, "date_created": "June 26, 2014"},
{"id": "18olvidgmak8gfgg", "rating": 4.0, "text": "We did the following work on a regular basis\r Assist with creating and updating technical and project documents\rParticipate in training and provide support to internal clients migrated to Google Accounts, Groups or PST\rAssist with testing of business application changes\rAssist with providing technical support to internal customers\rPrepare, submit and present reports and develop e-learning training documents using Uperform regarding -   SAP(FICO, MM, PM), POSSE, SIRE and TACS.", "pros": null, "cons": null, "date_created": "May 23, 2014"},
{"id": "18olbtvmpak8ga9m", "rating": 5.0, "text": "Fun place to work, great benefits and amazing management. Great co-workers willing to help in order to get the job done right.", "pros": null, "cons": null, "date_created": "May 23, 2014"},
{"id": "18n9a1op9ak4g9rj", "rating": 4.0, "text": "This Job was busy.  Cash handling, admissions, single, Selling Monthly and Annual passes, Registered patrons into various classes and lessons.\rPublic Swims admissions for over 500 people.\rCash handling, deposits, balancing my float.\rClosing the cash area for the evening", "pros": "time went buy fast, met new people", "cons": "lots of standing", "date_created": "May 6, 2014"},
{"id": "18lkhbritak4gbof", "rating": 3.0, "text": "boring work place, not much work to do and people are not always around. always on holidays", "pros": "with option of extra day-off", "cons": "boring place to work, no challenge", "date_created": "April 16, 2014"},
{"id": "18lka4ojqak4gf4k", "rating": 1.0, "text": "If you are from hr look into the director that was in the position in 2012\rAnd the manager. Also look into supervisors in coronation yard same time. Do a audit you will be surprised what you find", "pros": "Pay check won't bounce", "cons": "Nepotism", "date_created": "April 15, 2014"},
{"id": "18l3ksq12ak4gdoa", "rating": 4.0, "text": "Direct work with clients  who need help to prevent being a victim of violence in the future, lots of phone calls, interviews, documentation etc.  Good support from Branch Management, great co- workers.\rHardest part is clients going back to a violent relationship.\rMost enjoyable is independent nature of the job and when a client is very responsive to my intervention and very appreciative, makes positive steps forward etc.", "pros": "independent work", "cons": "the documentation system, long work day", "date_created": "April 9, 2014"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "18kf96ut3ak4g803", "rating": 3.0, "text": "Poorly managed. Things often done twice because they weren't done right the first time.", "pros": null, "cons": null, "date_created": "April 1, 2014"},
{"id": "18jrcfi0dak8gf07", "rating": 2.0, "text": "A typical day at work would be digging underground by hand for the cities drainage system, with the use of a jackhammer and shovel. We learn how to deal with different ground conditions as well as how to manage time so we finish proper footage in a day. One of the main reason I am looking to further my career else where is  because of management. This department in my opinion is poorly disorganized, does not value young driven employees and shows no interest or gives opportunities to advance a career within the department. My co-workers are usually great to work with, hard workers with drive for towards an honest days work. one of the hardest parts of my job would be operating a jackhammer for upwards to twelve hours a day 5-7 days a week, and the most enjoyable part of my job is working with a great crew and learning new ways to make the job and day go a little easier.", "pros": "benefits medical and dental, and vaction pay", "cons": "very labour intensive work, low opportunites for advancment in a career", "date_created": "March 24, 2014"},
{"id": "18j6gvvfrak8gfg1", "rating": 5.0, "text": "Agency is a leader within it's field.\rStrong accountability.\rGood leadership.", "pros": null, "cons": null, "date_created": "March 16, 2014"},
{"id": "18i75l0mmak4garl", "rating": 3.0, "text": "overall a pretty good place to work the money isn't that great for the  job you do but the people make it a much better environment to work so that's the bounus cool things to work on and get to use .", "pros": "bbqs", "cons": "pay kinda sucks", "date_created": "March 4, 2014"},
{"id": "18hgfdp419r4geh9", "rating": 5.0, "text": "An excellent employer focused on improving urban biodiversity and engaging members of the public for long-term environmental improvement.", "pros": null, "cons": null, "date_created": "February 23, 2014"},
{"id": "18h84m9vi5ncgcvn", "rating": 4.0, "text": "-Informed customers of new sales and merchandise arrival; accuracy and knowledge were essential for this position.\r-Handled customer complaints with professionalism\r-Handled store shipping and receiving with accuracy\r-Responsible for store and deposit keys", "pros": null, "cons": null, "date_created": "February 20, 2014"},
{"id": "18h5qbpl25ncgfhi", "rating": 4.0, "text": "Over all employees were great but at the time management wasn't so great.  Enjoyed working with the City", "pros": null, "cons": null, "date_created": "February 19, 2014"},
{"id": "18gfdvtvbb84g8lo", "rating": 4.0, "text": "if you can get a city of edmonton job then take it! it was a great place to work and the p[ay is also really great: )", "pros": null, "cons": null, "date_created": "February 10, 2014"},
{"id": "18fst9sb3b84gecj", "rating": 5.0, "text": "Ever football game I would arrive at the stadium, we would have an employee meeting then off to the designated gate. over the course of the game hundreds of people came through each gate. we were responsible to scanning tickets, if there were issues with the tickets we had to direct people to ticket booths. we were also responsible for directing to seats, consignment, transportation and other such places. we also had to make sure that no alcohol left the premises. the hardest part was being exposed to the elements, but the other employees were a joy to works with.", "pros": "A free hot dog and beverage", "cons": "Exposed to the elements", "date_created": "February 3, 2014"},
{"id": "18fehvs4pb84ge3i", "rating": 3.0, "text": "I have enjoyed working for the City of Edmonton for nearly 5 years.\r Over this time I have moved from a swimming instructor, to a lifeguard and over the past 2 years I have now been working as a pool service person nearly half the time I am at work. I have always been mechanically inclined and my supervisors have seen this and used me to their advantage. I am often in charge of heading back washes as well as completing pump and filtration system maintenance. If my supervisors are not around. I am always the one that my fellow co workers call upon if there is a mechanical or water chemistry related issue. \r I enjoy the problem solving aspect of it dealing with our complex filtration systems and find a sense of satisfaction when I can get things running smoothly.", "pros": "Excellent management and job security, a great feeling of belonging.", "cons": "Hours can some times be unreliable, some weeks I'll work 50 hours a week and other's 30 hours per week.", "date_created": "January 29, 2014"},
{"id": "18f8jijd4b84gbm7", "rating": 3.0, "text": "If a low skill level requirement, and little to achieve at work interest you, this is your place!", "pros": null, "cons": null, "date_created": "January 26, 2014"},
{"id": "18f165jfdb80g82p", "rating": 5.0, "text": "very good company, they reward hard work. education and job promotion is always offered.", "pros": null, "cons": null, "date_created": "January 23, 2014"},
{"id": "18e2evginb80gfal", "rating": 5.0, "text": "I am very happy with how the city treats its workers. Management is great. Great group of co-workers. The hardest part of the job is dealing with difficult customers. The most enjoyable part of the job is interacting with the public.", "pros": "Friendly environment", "cons": null, "date_created": "January 11, 2014"},
{"id": "18ddok46mb84gbsd", "rating": 5.0, "text": "Very physical but love it, keeps you in shape and gives you a great experience.", "pros": null, "cons": null, "date_created": "January 3, 2014"},
{"id": "18d4uag3cak4gdff", "rating": 5.0, "text": "Trained for two days and volunteered for two weeks. It was very fun but tiring at the same time, starting from early morning hours to evening hours. Met a lot of new people and entertained many young children, volunteering at a playground green shack program is an awesome experience.", "pros": "I can work there if I wanted to", "cons": "Boiling hot days in a metal green shack", "date_created": "December 31, 2013"},
{"id": "18ctpbv1lb84gamq", "rating": 5.0, "text": "A wonderful place to work. Everyday is a new experience. Meeting new people everyday is an unique experience. Surrounded by a wonderful group of coworkers make the place our second home.", "pros": null, "cons": null, "date_created": "December 28, 2013"},
{"id": "18bpjbuk4b80gbv5", "rating": 3.0, "text": "1st of all the pay is not great. So if you need to make a great deal of money, apply elsewhere. \r The City is big on covering its butt legally so you'll be taking courses and going to safety meetings etc none of which has made much difference in the 30 years that I have worked there.\r  Summers are very busy at Parks. Winters get busier with snowfall. It is difficult to get good employees because so many are very young and don't really want to earn their pay.\r The City is over managed. There are far more bosses than workers and many of the bosses have zero experience on the ground yet make all the decisions, usually without asking the people who know- the Crew leaders. \r If you have a degree, even in Baking, you could be immediately bumped up the ladder. Actual work experience is not necessary.\r You will rarely see a boss with a tool in their hands\r If a well run organization is important to you-FLEE!\r The answer to every problem in the City of Edmonton is more administration! Never more boots on the ground. Chaos rules.\r The hardest part of the job is doing it in a fashion that I know is not efficient but orders from above require me to do it that way anyway.\r  The most enjoyable part of the job is camaraderie among staff and the 4 ten hour/day shifts. 3 day weekends and all stat holidays off.", "pros": "4 day shift", "cons": "Extremely poor management and patronage postings for brown nosers common.", "date_created": "December 14, 2013"},
{"id": "188058ecrak4g8a1", "rating": 4.0, "text": "Great support if you get a good group of people to work with. Otherwise can be straining.", "pros": "Work outdoors!", "cons": null, "date_created": "October 28, 2013"},
{"id": "186jr4goib84gccd", "rating": 3.0, "text": "I enjoy being a City Employee.  However, the field in which I work has no job security, no benefits, no chance to advance or move up, and the pay is only good if you sacrafice your entire schedule to working insane and sporadic hours.  The co workers and employers are amazing people that love what they do.  They are driven and passionate about the health industry.  However, this career path does not mesh well with my goals in life.", "pros": "Free membership to City Recreation Facilities", "cons": "Sporadic hours, no job security, no benefits, medicore pay", "date_created": "October 11, 2013"},
{"id": "186au4vosb84gaba", "rating": 1.0, "text": "move and screen compost xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx", "pros": null, "cons": null, "date_created": "October 7, 2013"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "185t12c9mb80gfbj", "rating": 4.0, "text": "Edos are great. Pay is average. Hours are great. Some management issues.", "pros": null, "cons": null, "date_created": "October 2, 2013"},
{"id": "185k3f1jub80g8gl", "rating": 5.0, "text": "This is a fun position where you meet new and interesting people.  The wage is great, but the deductions are high.\rA good career for the right person", "pros": null, "cons": null, "date_created": "September 29, 2013"},
{"id": "1853r9nbmb84g95f", "rating": 5.0, "text": "Worked nights and days for a variety of labour intensive tasks. I used a sub pump to pump city drainage and maintained manholes and road condition near manholes. Management was organized and friendly, a typical day was enjoyable. Co-workers were friendly and enjoyable to work with, offered rides home and occasionally bought lunches. Very Generous. The company offered BBQ's to co-workers and provided work and life balance. When the season ended and a full time/permanent position was offered, I didnt have the transportation at the time and had to turn the offer down.", "pros": "free lunches, rides homes, friendly co-workers and supervisors, accepting, and well organized", "cons": "Seasonal and inconvenient hours for non-vehicle owners", "date_created": "September 22, 2013"},
{"id": "182uu4curb84gfd9", "rating": 4.0, "text": "- 8 hour day\r - I learned to have good listening skills, be empathetic as well as to have a good relationship with customers.\r- I was a front store supervisor as well as a postal manager\r- I had great co-workers, we worked as a team and helped each other and had fun as well.\r- The hardest part of the job was having to talk with a co-worker about a problem.\r- The most enjoyable part of the job was talking with internal and external customers and helping them with there needs.", "pros": "Getting positive feedback", "cons": "On your feet for hours", "date_created": "August 26, 2013"},
{"id": "182tp69q6ak8gb0h", "rating": 5.0, "text": "Start at 10 P.M. and Work Til 6 A.M. Learned how to clean using various products and tools to maintain the pool facility.  Management had good policy to follow in all aspects of job.  Although, I worked alone, help was available from team for training and support.  Night work was the hardest part of the job. The most enjoyable was free swimming and workouts.", "pros": "Compressed work day off and many other benifits", "cons": "Difficult standards to follow and maintain.", "date_created": "August 26, 2013"},
{"id": "181tk0i1vb84gftr", "rating": 4.0, "text": "I only worked in a very small section of the City of Edmonton's expansive labour force. My experience was a good one, Unions meant I was always taken care of and well payed. Lots of hourly premiums for working holidays, weekends, and evenings. There was always plenty of opportunity for advancement. I worked a 6 to 2 shift but as I mentioned before the City runs its employment like a large company so there is tons of variety and different positions.", "pros": "good wages, I always felt taken care of, flexible", "cons": "not a lot of opportunity for holidays", "date_created": "August 14, 2013"},
{"id": "181pnpff0b80gfru", "rating": 5.0, "text": "Co-workers and team function are great. \r Positive Moral\r Management of WCB, Short term and long term disability files", "pros": null, "cons": null, "date_created": "August 12, 2013"},
{"id": "180bk5i8cak8gcml", "rating": 4.0, "text": "Great corporate culture, good pay and benefits. Unionized except management. Non discriminate employer.", "pros": "Great pay and benefits, work hours", "cons": null, "date_created": "July 25, 2013"},
{"id": "17vht3hppae0g840", "rating": 5.0, "text": "Very slow pace. Technology is way behind. Hardest part of job is working with archaic software.", "pros": "Good employer", "cons": "Technology", "date_created": "July 15, 2013"},
{"id": "17u402c7mb80gbn5", "rating": 4.0, "text": "Very enjoyable place to work.  The attitude of management and supervisors so far has been wonderful.  ", "pros": null, "cons": null, "date_created": "June 27, 2013"},
{"id": "17t83r38vb80gfn0", "rating": 4.0, "text": "There were no typical days in my position, every day was different, unpredictable. What starts as a quiet day can easily erupt into a flurry of public complaints, inquiries from the Mayor or City Councillors. Working with 30+ union staff was also a challenge especially when things go sideways. Interesting work but stressful at times.  \r My duties as the Vegetation Management Supervisor and Integrated Pest Management Coordinator included the following: \r • Provided leadership in developing, implementing and managing annual work plans including recruiting required seasonal staff to implement annual work plans and capital projects\r• Built effective teams by providing coaching and counselling, organized staff orientation, safety training, attendance management, performance reviews and educational development.\r The most enjoyable part of the job was my accomplishments,\r • Led the Parks Vegetation Management Team in the continuous reduction of pesticide use from 1999 to 2012 leading to the Charles Labatiuk Award for Environmental Excellence\r• Instrumental in the development and implementation of the City’s Good Growing Neighbours public education pesticide reduction program\r• Forged partnerships with the County of Strathcona, City of St. Albert and City of Leduc in joining and contributing to the Good Growing Neighbours program \r• Represented the Vegetation Management section and the Good Growing Neighbours public education campaign as media spokesperson conducting television, radio and print media interviews\r• Worked with the Edmonton Naturalization Group (ENG), various - more...", "pros": "Opportunities to advance", "cons": "Constant reorganizations, no continuity.", "date_created": "June 16, 2013"},
{"id": "17sgunsi3b80gagh", "rating": 1.0, "text": "i work in the waste management dept the moral is pretty close to the worst I've ever seen. Your day to day job will destroy your body over time and when you are used up you are told it's time to find another job. Wage is good but take home pay is way to low for what you do. Needle pokes, wasp attacks rolled ankles 15,000 to 20,000 kg BY HAND a day in the summer every day. Expected to pick up the slack for poor workers on top of your own work. This is one of the few cities left that still hand collects with no sign of it ever changing all the leaders and management only care about their own jobs and not their workers. The only way to get ahead is to kiss but and have no opinions to make changes they want everything to stay the same. ", "pros": "3day weekends", "cons": "heavy volumes lack of respect", "date_created": "June 7, 2013"},
{"id": "17rpcsjqkb84gcke", "rating": 4.0, "text": "Municipal governments are a great place to work. You are provided a high level of job security, pension and benefits. However, the wages are just not comparable with the private sector. Couple that with the reduced working hours and the wage rate really starts to suffer. Lots of levels of management as well that one has to deal with which can be frustrating.", "pros": "Earned Days Off", "cons": "37.5 hour work week.", "date_created": "May 29, 2013"},
{"id": "17r4roe9qb84gbbc", "rating": 5.0, "text": "My typical day at work is getting prepared for the day with morning meetings ie; safety talks and concerns. I have gained a great knowledge of the city and the parking By-Laws and I have a great team of people to work with. The hardest part is dealing with the aggressive people and the threats of bodily harm to myself and other co-workers,but for the most part dealing with the public has been very enjoyable. The most enjoyable part is helping people.", "pros": "Company B.B.Q's, staff with good Sense of humor.", "cons": "there are none except maybe a better pay ;)", "date_created": "May 21, 2013"},
{"id": "17q2s5g7ub84gffr", "rating": 4.0, "text": "Learned to have a high level of accuracy and confidentiality", "pros": null, "cons": null, "date_created": "May 8, 2013"},
{"id": "17krkem42b80gba9", "rating": 4.0, "text": "Great place to work, a typical day at work comprises of meetings, work at your station, responding to requests and interacting with stakeholdersLearned new things for my workManagement knows what they are doing, have a vision of where they want to goThe hardest part of the job was getting to understand the organization-too bigMost enjoyable part is the life work balance and the great colleagues", "pros": "compressed week", "cons": null, "date_created": "March 4, 2013"},
{"id": "17js1v1g9b84ge04", "rating": 2.0, "text": "Excellent workplace. Enjoy the people. Hardest part of the job is maintaining the equipment.", "pros": null, "cons": null, "date_created": "February 20, 2013"},
{"id": "17jcp7vovb84gelb", "rating": 3.0, "text": "I work hard everyday and finish project on time. But I still can not get a permenent position in it. Realy upset!!!!!!!!!!!!!", "pros": null, "cons": null, "date_created": "February 14, 2013"},
{"id": "17irefbu6b80ga8u", "rating": 1.0, "text": "I am currently employed as a hd mechanic on the fleet services side have worked there for more then five years. Have on many occasions experienced intimidation and been threatened by foreman. Management isnt concerned with this as it has been an ongoing problem for years. Supervisors are yes men for upper management and will smile and look into anything you suggest to your face but behind closed doors there is a different attitude.there are some good supervisors as well but they have little ability it seems to act on problems either due to a high level of work they need to accomplish or tired of dealing with the same problem and seeing no results. They do have some excellent mechanics working for them but do not give them the opportunity to advance unless they learn to do favors for there superiors in management. Your more valuable as a mechanic then in a leadership role if you are a knowledgeable mechanic. Almost all in management are there due to either belonging to a small group of people that know someone or are willing to become yes men and will do whatever they can to get a shot at belonging to this group including doing personal favors after hrs for there superiors. Or have been injured working on the shop floor and taken the city foremanship training. Your not promoted due to being a highly qualified mechanic. There is poor communication skills with mechanics and workers but excellent with management when referring to foreman. Shift work is required and the shift differential is $1.10/ hr as compared to more then $5 with other employers. Wages are average so no compliant - more...", "pros": "average pay, pension plan, three weeks holidays after eleven month temp, if a permanent position is posted", "cons": "shiftwork, including having to cover shifts, due to not enough mechanics to cover shifts this is partially due to high turnover rate, little to no information on equipment, such as service manuals, as well as tooling they say they supply, poor management skills at foreman level, very disorganized, and have experienced and witnessed foreman using intimidation tactics on serviceman", "date_created": "February 7, 2013"},
{"id": "17ir0l39sb80g93m", "rating": 3.0, "text": "At the City, you know you're never going to be emotionally babysat. There are always many levels of management above you, which ensures that your ego is likely to never get out of control.That being said, people at the section level tend to form close-knit teams and support each other. If you can find a spot like that, you're golden.", "pros": "decent salaries, mostly guaranteed raises", "cons": "frustration with the system, stress", "date_created": "February 7, 2013"},
{"id": "1g14hbe1imsai800", "rating": 3.0, "text": "Management is really bad, Pay is alight, good work life balance, very old school, management is not progressive minded, fails to value good employee, lots of unnecessary politics", "pros": "Avg pay, Easy job", "cons": "Poor leadership", "date_created": "April 20, 2022"},
{"id": "17ghba94fb84gdli", "rating": 4.0, "text": "A typical day at work involves a lot of interaction with customers and coworkers, which I particularly enjoy.I've learned how to deal and serve all different types of customers in a respectful and enjoyable manner.There is a lot of respect and diversity amongst my coworkers, which makes going to work the more enjoyable.The hardest part of the job is having to deal with unreasonable customers from time to time.On the other hand, the overall customer service component of the job is the most enjoyable part of the job for me. I enjoy the personal interaction and the knowledge that a customer is happy because of my expertise and know-how of my job.", "pros": "barbeques, incentives", "cons": "lay off every year for temporary positions.", "date_created": "January 9, 2013"},
{"id": "17g67cmr09e8gf6o", "rating": 4.0, "text": "Having worked for the City for a number of years I can say that morale is very good which is a big key for a good working environment.Like most local governments the IT is well behind the times but the willingness to innovate is a very positive aspect.The benefits are very nice and as you are in a union position the pay has been on par or better than a private employer.", "pros": "decent break time, web policies and great work environment", "cons": "can be either too busy or dead both of which can be bad.", "date_created": "January 5, 2013"},
{"id": "17furov2uae0g9gs", "rating": 2.0, "text": "I've worked for this company for many years its a deadend job the morale, is very low the company seems to think that they can ignor everyone's issues. but provideing us with gross lunch in's is a way to redeem themselves. unless your in good with management or have a friend or family member who is high up, the you will be promoted I was not intrested in taking certain training in the beging it was sopoorly run and had such of lack of support from the foremen I felt as though I would be at a loss to pursue it and from that moment on I was black listed from any promotions though I do get the interview but they always choose everyone else but me, the foremen are provided no training on how to treat there employes with respect, they can dog you or bully you all day everyday will no ill effects ofmanagement stepping in to reslove the issue, and the supervisor will say you are at fault for being treated that way, you will get the worst of the worst jobs to do while the butt kissers get to do as they please, the foremen just want to send rude jokes to there friends go to mcdonalds and watch movies on youtube the union is under the arm of management not willing to stand up for your rights but very happy to take your $50 union duies every paycheck the benifits are ok but the due's are very high halfyour paycheck will go towards it, leaving you with nothing the other employes are rude and strange most of them will try to get you in troubble by tateling to the boss about you not doing your work, when they are not doing there work, outside smoking very few employees will lend you - more...", "pros": "vacation time", "cons": "most thing's", "date_created": "January 2, 2013"},
{"id": "17eo74283b84gavi", "rating": 3.0, "text": "Working for the City of Edmonton used to be fun and challenging but unfortunately lacks the excitement or fun that used to make it all worthwhile.", "pros": "not bad wage", "cons": "absalutely no benefits or trust amongst the employees", "date_created": "December 18, 2012"},
{"id": "17a4tsv754e0g900", "rating": 3.0, "text": "was not pleased,some jobs i did not mind butsome i did not like , jumping in and out of traffic was not my best days.", "pros": null, "cons": null, "date_created": "October 22, 2012"},
{"id": "1796j1ofoadsgdt2", "rating": 4.0, "text": "Very busy environment during the days, not so busy during the nights. It is a good environment for building employee relationships, most employees get along very well. Everyone is encouraged to do work when there is work to be done, and for the most part everyone contributes.", "pros": "good work environment", "cons": "shift work", "date_created": "October 10, 2012"},
{"id": "177vb3mhl4e0gfa0", "rating": 5.0, "text": "I only had a temporary summer position over a couple summers so I cannot really speak to advancement but otherwise it was a wonderful place to work.", "pros": "decent wage, low stress", "cons": "monotonous at times, often deal with angry customers", "date_created": "September 25, 2012"},
{"id": "177tfci5l4dsgccl", "rating": 5.0, "text": "I had a great experience working for the City of Edmonton at the Green Shack Program. Each day was different, depending on which kids came but there were also some regulars whom I got to know very well over the summer. Best of all, it was so nice to work outside and enjoy the beautiful summer weather.", "pros": null, "cons": null, "date_created": "September 24, 2012"},
{"id": "177jbmb374e0gf40", "rating": 4.0, "text": "Very professional management core. Excellent benefits, and excellent pay.", "pros": null, "cons": null, "date_created": "September 20, 2012"},
{"id": "1768mmdp24e0g95d", "rating": 2.0, "text": "horrible place to work at the time, staff had worked together for many years and were inflexible to any change or new person, staff coming to work intoxicated or not all, staff doing personal business on work time, poor management, another staff had a mental illness, interpersonal conflict, clients were nasty and mean. staff were supposed to be promoted to education position which never happened", "pros": "i learned the legislation, facilitated courses in the community", "cons": "terrible work conditions, awful staff", "date_created": "September 4, 2012"},
{"id": "174n1odms4e0gf5m", "rating": 1.0, "text": "and too much back staving from team leads when ask for more training to be able to advance their prejudice got the best of them and instead of lifting they put down I would not go back to work for them", "pros": "nice one hour lunch, and compress week", "cons": "no vacation, and no chance to advance", "date_created": "August 16, 2012"},
{"id": "1749403pj4e0g8ns", "rating": 4.0, "text": "Great people to work with, and management is above and beyond good. some customer issues, but of course there always is. great environment and helpful staff make it easy to work around your schedule and aid you in finding replacements if need be.", "pros": null, "cons": null, "date_created": "August 10, 2012"},
{"id": "171seci904dsg9ag", "rating": 5.0, "text": "Working for the city you get to experience many different types of construction techniques", "pros": "wage, free time, holidays", "cons": "long hours", "date_created": "July 11, 2012"},
{"id": "16ucqq26g4dsg92b", "rating": 4.0, "text": "A great experience! I was very happy to have this experience. It was hard work but I was able to enlist the help of very experienced volunteers. We put together a really good team. I would do this type of thing again in a heartbeat! The City of Edmonton were nice people to work for.", "pros": "i could work my own hours, just get it done. meet deadlines.", "cons": "the job ended when the games were done.", "date_created": "May 29, 2012"}
]