[
{"id": "1e2eg0s0uolrc803", "rating": 4.0, "text": "There is alot of work to do at any given time. However, it isn't that bad since if you aren't doing anything you get very bored. when u are on break time they used to allow the employees to go into the hot tub and sauna.", "pros": "lots to do", "cons": "keeps you very busy", "date_created": "March 2, 2020"},
{"id": "1dsjn9uh333nu000", "rating": 5.0, "text": "Great workplace- beautiful facility and tons of room for advancement. Often low on staff, meaning that plenty of hours are available to work, but there aren't always enough staff members to run at full capacity. We are always improving and looking for people to join our great team. Benefits are great for permanent and term staff.", "pros": null, "cons": null, "date_created": "December 21, 2019"},
{"id": "1dr7lp0kc24f2002", "rating": 4.0, "text": "There is no typical day in Iqaluit. Everyday new challenges arise to ensure the aging infrastructure continues to function properly. Iqaluit is building a new MBBR wastewater treatment facility  to be operational February 2020.\rManagement promotes a safe workplace culture, supportive of Indigenous staff\rHardest part of the job is realizing / discovering many concerns exist from previous years\rMost enjoyable part of the job is the personal gratification in seeing staff take ownership of the required works, both existing and new and to see their confidence levels rise with every task they complete.", "pros": null, "cons": null, "date_created": "December 3, 2019"},
{"id": "1aohid0pe5na3df9", "rating": 5.0, "text": "A day at work always involved us employees to plan and schedule before coaching. Involves a lot of good leadership and positive attitude to get through a workday.", "pros": "Teaching children", "cons": "short hours", "date_created": "July 25, 2016"},
{"id": "1af9p17tvak55bj7", "rating": 5.0, "text": "Welcome patrons and employees,  signing in employees coming in and going out, Answer phones leave messages or voicemail if the right person isn't available.\rstamping , weighing, Sorting all outgoing and incoming mail, processing  checks to finance administration department, recording accounts recievable and accounts payable on MSSpreadsheets.\rGood management , friendly environment", "pros": null, "cons": null, "date_created": "April 1, 2016"},
{"id": "1a0p3jr14as3oc99", "rating": 4.0, "text": "Worked for City of Iqaluit for 5 plus years, enjoyed my time there. Worked in several positions over the years there, pay and benefits were very good. There is room for advancement and training if you are willing to work hard.", "pros": null, "cons": null, "date_created": "October 4, 2015"},
{"id": "192pj1usr5n8gbl6", "rating": 5.0, "text": "service the truck logging house numbers making sure my helper works driving on fresh ice finishing the route for the end of the day", "pros": null, "cons": null, "date_created": "September 26, 2014"},
{"id": "173hr3gfsadsgdte", "rating": 4.0, "text": "Working Daycamp was really fun, we got to switch groups bi weekly so we got to know all 200 kids. we went on a lot of excursions and learnt a lot of new things about inuit culture.", "pros": "free lunches, awesome co-workers, and bouncy castle.", "cons": "no 15 minute breaks", "date_created": "August 1, 2012"}
]