[
{"id": "1g3s2tiop2oqb002", "rating": 3.0, "text": "If you're looking for a company as a family person, City is for you. Job security and work to life is pretty good. Let's to do most of the time. I like working with city.", "pros": null, "cons": null, "date_created": "May 24, 2022"},
{"id": "1g2bmv685g2dv802", "rating": 1.0, "text": "Service Regina is a toxic place to work and very stressful. Micromanaged by managers and employees are disrespectful and highly competitive. The pay is good", "pros": "good pay", "cons": "toxicity, micromanaging, competitive, disrespectful workplace, heavy workload", "date_created": "May 5, 2022"},
{"id": "1g0oqofkvg2f3801", "rating": 5.0, "text": "This employer provides security in an economy that doesn’t take care of an employees finances. No, they are not perfect but better than most I would say.", "pros": null, "cons": null, "date_created": "April 16, 2022"},
{"id": "1fs5khp46u21i801", "rating": 2.0, "text": "The city does not care about it's employees. Once you have a medical issue, you're done, you are now responsible for paying for your benefits. They are awful to work for.", "pros": null, "cons": null, "date_created": "February 17, 2022"},
{"id": "1fs01jvf82qni001", "rating": 3.0, "text": "Seniority based company with little room  for advancement, good work life balance, EDO’s and sick pay. Poorly managed and under appreciated, small pay increases. Wouldn’t recommend long term ", "pros": "Vacation pay/ Holidays EDO’s Sick Pay", "cons": "Not much room for advancement Poorly managed", "date_created": "February 15, 2022"},
{"id": "1ebu334c3pc6g800", "rating": 5.0, "text": "Excellent work environment and team. The management of my department was awesome. Always planning with you to help you grow and fulfil your career goal while accomplishing the goal of the organization. Great coaching and mentorship.", "pros": "Great management and team", "cons": "Can be on contract for long", "date_created": "June 28, 2020"},
{"id": "1e67eooishcrp800", "rating": 4.0, "text": "Got to learn about the engineering process, and the crew were very helpful and enjoyable to work. The management was very concerned about safety which is good.", "pros": null, "cons": null, "date_created": "April 18, 2020"},
{"id": "1e23odgoop434803", "rating": 4.0, "text": "work in Fleet, good place to get hands on experience after a Dealership SA position. Great feeling you don't have to compete for a pay cheque.\r My Managers treat you with the greatest amount of respect and open to new idea and way of doing things.", "pros": null, "cons": null, "date_created": "February 27, 2020"},
{"id": "1e1hrc4ljhd6k802", "rating": 5.0, "text": "The city of Regina is a great place to work. You can have several carriers at the same employer because there is such diversity in the work that they do. You also get a sense of pride from providing services to the community that you live in. I highly recommend it as a place to work!", "pros": null, "cons": null, "date_created": "February 20, 2020"},
{"id": "1e0nl6ck7hctt802", "rating": 1.0, "text": "Sit on your butt and then get in trouble when manager is in a bad mood. There is always to many people doing the same job. Noone wants to do hard work!", "pros": null, "cons": null, "date_created": "February 10, 2020"},
{"id": "1dv9ekukpb68v800", "rating": 4.0, "text": "decent, depending on your manager. it is very hit or miss if youll have a great term or debate on quitting. but also do worry about getting fired #union", "pros": null, "cons": null, "date_created": "January 23, 2020"},
{"id": "1dtjve9nqhc33803", "rating": 5.0, "text": "A great place to work outside in the summers that paid for my entire university career the management was incredible I would highly recommend this place if anyone to work", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1drtj1f40hakq803", "rating": 5.0, "text": "Excellent place to work! I have had no problems what so ever in the last 3 seasons working with the City of Regina. The managers and staff are the best people I have ever worked for! I always look forward to working in the summer!", "pros": null, "cons": null, "date_created": "December 12, 2019"},
{"id": "1drej0i811d0s003", "rating": 2.0, "text": "Terrible culture, everyone is out for themselves and you have to belong to a union.  They take a ridiculous amount off your paycheque and theres no room for advancement because it is all based on seniortiy, not skills", "pros": null, "cons": null, "date_created": "December 6, 2019"},
{"id": "1dpo0e8sah3mg802", "rating": 3.0, "text": "Split shifts were tough\rLack of drivers made for long hours and days\rFriendly and helpful co workers\rpay was decent, benefits and pension\rstressful at times", "pros": null, "cons": null, "date_created": "November 15, 2019"},
{"id": "1doehvssvh3ll802", "rating": 2.0, "text": "There are worse places to work, there are better places to work.  The work culture is very different from what the corporation would like to convery - inclusive and safe and respectful - this is not the case on the front line with the lower level supervisors.  If you can put up with it, then you will do fine.  It wears on a person though........", "pros": null, "cons": null, "date_created": "October 30, 2019"},
{"id": "1doda418ch41a802", "rating": 3.0, "text": "Pick shifts once every 4 months or sub and pick-up shifts. Great for working around other jobs or school. \r Lots of variety for shifts: set up events, kids programs, office positions, cashiering etc. \r Management is absolutely horrendous.", "pros": "Flexibility", "cons": "Management", "date_created": "October 29, 2019"},
{"id": "1do04f4jdh3t6802", "rating": 4.0, "text": "I very much enjoy workig at the City of Regina, it has a very good work environment where I learned plenty of usefull skills . Lots of overtime as well as great people.", "pros": null, "cons": null, "date_created": "October 24, 2019"},
{"id": "1dmol7ge0h44u806", "rating": 5.0, "text": "Working for the City of Regina has helped me develop my skills and encourages you to receive the proper education and training to excel in the specific areas in which you work.", "pros": null, "cons": null, "date_created": "October 9, 2019"},
{"id": "1dkgukau0h3oh801", "rating": 5.0, "text": "good employer to work for\remployer was a very fair and understanding company to work for.I enjoyed working with this company and the people made the work days positive and productive", "pros": null, "cons": null, "date_created": "September 11, 2019"},
{"id": "1digsjp30h3qs802", "rating": 3.0, "text": "I was a seasonal worker for the City for 5 years. Its a good job during the summer while you are going to school and it pays decent once you work there for a few years. However, many employees lack motivation.", "pros": "Being outside, good summer job", "cons": "Lack of motivation from others", "date_created": "August 17, 2019"},
{"id": "1g3s2tiop2oqb002", "rating": 3.0, "text": "If you're looking for a company as a family person, City is for you. Job security and work to life is pretty good. Let's to do most of the time. I like working with city.", "pros": null, "cons": null, "date_created": "May 24, 2022"},
{"id": "1dielji8nb8b4800", "rating": 4.0, "text": "inclusive workplace\rfair wage\rgood benefits \runion\rstability \rextensive training and the opportunity to excel \r always a fun day, staying active and engaging with the community", "pros": null, "cons": null, "date_created": "August 16, 2019"},
{"id": "1di6m4nekh3ub800", "rating": 4.0, "text": "An environment conducive to learning about municipal government.  Simply a lot of great people.  Keeping up with innovation and change was constant.  Part of a super culture.", "pros": null, "cons": null, "date_created": "August 13, 2019"},
{"id": "1di3l4afoh3js803", "rating": 1.0, "text": "City does not care for employees. Hr is useless for helping you and supervisors have to many favorites. I would not recommend working here. It's a waist of time", "pros": null, "cons": null, "date_created": "August 12, 2019"},
{"id": "1dh7b6hc1b82g803", "rating": 4.0, "text": "I wasn't at City of Regina too long, but in the time i was, i learned lots while working there. Kept busy with learning the system and problem solving. There is no parking unless willing to walk 5 blocks.", "pros": null, "cons": null, "date_created": "August 1, 2019"},
{"id": "1dgtnak2ah3t1800", "rating": 5.0, "text": "Pays well for what is expected of you. A lot of the staff is friendly and helpful. You are protected and feel safe with the union. Breaks are always given and generous.", "pros": null, "cons": null, "date_created": "July 28, 2019"},
{"id": "1dept08hrh3lr800", "rating": 5.0, "text": "Had a great experience with them.  Always had a great time in the shop. Things couldn't be better to be honest. I shouldn't of ever left.  But life throws curve balls.", "pros": "Great bosses", "cons": "None", "date_created": "July 2, 2019"},
{"id": "1de81t1dm1d0o000", "rating": 3.0, "text": "the mornings changed but the afternoons stayed the same, good place to work for if you like working outdoors, lots of walking and interactions with the public", "pros": null, "cons": null, "date_created": "June 25, 2019"},
{"id": "1db0si88f24g2000", "rating": 1.0, "text": "Would stay away, my experience was bullying favoritism, just a horrible place in general. Some of the worst attitudes I’ve ever seen in the workplace.  I would be ashamed to say I work for the city of Regina…", "pros": "Nothing", "cons": "Harassment, bullying etc.", "date_created": "May 16, 2019"},
{"id": "1daflfa7nh3ld800", "rating": 2.0, "text": "Several people have quit due to bullying and harassment.  The director knew but just kept hiring bullies and her friends.  Those who spoke out were eventually fired or treated even worse.  A few people have way too much work while others do very little.  High turnover and sick leave is a problem.  \rWould not recommend it.", "pros": "Interesting work, good coworkers", "cons": "Favouritism beyond the norm, toxic people stay while good ones leave", "date_created": "May 9, 2019"},
{"id": "1da9os6gt5j4j800", "rating": 5.0, "text": "I have enjoyed my 15 year career with the city of Regina. Serving my time in various departments throughout the years. Parks and Recreation, Social Inclusive, Waterworks, Information Technology Department and the A.C.E _ Aboriginal City Employee Network! I love the people that work there! I just needed a change!", "pros": null, "cons": null, "date_created": "May 7, 2019"},
{"id": "1d9ttv1eah453800", "rating": 1.0, "text": "would not recommend working here as a career , poor management and a lot of favoritism within the workplace . good opportunity to learn several different machines", "pros": "learn to operate several machines", "cons": "low wage, not enough hours, poor management", "date_created": "May 2, 2019"},
{"id": "1d9kt76t8h453800", "rating": 3.0, "text": "Management at all levels is always in a state of flux, either through re-org's, attrition and/or terminations. The operational departments are stable and manage to get things done, but the culture at City Hall is one of exclusivity and turmoil. The pay and benefits are very good, but unless you fit in with a particular \"clique\", and can endure endless red tape (committee meetings, review processes, bureaucracy, etc.), you will find this a frustrating place to work.", "pros": "Good pay and work/life balance.", "cons": "Like filing paper in a wind storm.", "date_created": "April 29, 2019"},
{"id": "1cue973ld1d0u000", "rating": 5.0, "text": "Good work life balance, nice supervisor, not a fan of management policies though. Many scopes for skill development. Salary not up to the mark. As a municipal govt should look into that", "pros": null, "cons": null, "date_created": "December 11, 2018"},
{"id": "1cuc5scvf1agl000", "rating": 4.0, "text": "Super friendly staff, become friends rather than just co-workers very quickly. Easy commute to work from anywhere in the City which goes a long way to offsetting the lower salary.", "pros": "Easy commute, friendly coworkers", "cons": "Lower than average salaries", "date_created": "December 10, 2018"},
{"id": "1cs718maeakba800", "rating": 3.0, "text": "Worked there for 14 years great co-workers to work with. Inclusive work environment. Good health benefits and pension plan. Management was supportive to work with.", "pros": "Free Lunches", "cons": "Working in cold environments", "date_created": "November 13, 2018"},
{"id": "1cr07ukg4akam800", "rating": 5.0, "text": "I work there  for 7 months a year depending on weather...the people are great ,you have ample opportunities to get training ,which is all free and you can take it with you when or if you go elsewhere...", "pros": "training", "cons": "Management", "date_created": "October 29, 2018"},
{"id": "1cqtjjvivak6v800", "rating": 2.0, "text": "Personal bias, management and leadership has preference to local Canadians, different treatments to immigrants.\r If you are highly talented, the supervisors and managers will try to undermine", "pros": "None", "cons": "Many", "date_created": "October 28, 2018"},
{"id": "1cj44ccpqaqgu823", "rating": 4.0, "text": "to much infighting and nepotism .... i personally retired early from the city.enjoyed the kids and in general the shifts. some (most) of the management i couldnt stand", "pros": "the kids, and working out door during most of the year", "cons": "most of the people i worked with", "date_created": "July 23, 2018"},
{"id": "1ch19qlae1ahu767", "rating": 5.0, "text": "Getting to meet new people and getting them to destination they need. Driving safely.   Getting along with people , and co-workers.  Getting  along with the management team. Dealing with difficult  people & not losing my cool. Making my customers happy and enjoying the day's end. Looking forward to the next day.", "pros": "Enjoying the job", "cons": "Having rude customers.", "date_created": "June 27, 2018"},
{"id": "1cgf15f991ahi4ec", "rating": 4.0, "text": "I enjoyed working there lots learn and many wonderful people. I would recommend that if you have the opportunity you should work for the City of Regina.", "pros": null, "cons": null, "date_created": "June 20, 2018"},
{"id": "1g3s2tiop2oqb002", "rating": 3.0, "text": "If you're looking for a company as a family person, City is for you. Job security and work to life is pretty good. Let's to do most of the time. I like working with city.", "pros": null, "cons": null, "date_created": "May 24, 2022"},
{"id": "1cbpn54ptas0mbli", "rating": 5.0, "text": "Working in Account Receivable department was very busy. There were heavy amount of customer to deal with on a daily basis. The co-worers at City of Regina were very nice and always willing to help out.", "pros": null, "cons": null, "date_created": "April 23, 2018"},
{"id": "1c7fl3i4iaqj8e0c", "rating": 2.0, "text": "I love my job. I do not like management. \rThe workplace culture is toxic. It's very difficult to go into the workplace knowing that my employer has Respectful Workplace and Harassment Free Workplace policies and they do not follow them.", "pros": "Flexibility, choose own hours", "cons": "toxic work environment", "date_created": "February 28, 2018"},
{"id": "1c6e8oiukakirfue", "rating": 5.0, "text": "The Human Resources department is an excellent place that supports, encourages and empowers employees to develop into trusted advisors who operate with integrity", "pros": null, "cons": null, "date_created": "February 15, 2018"},
{"id": "1c4ftdotlb85macs", "rating": 4.0, "text": "I worked at the indoor pools and worked 4 12 hour shifts then off for 4 days.\r2days (6am-6pm)\r2nights (6pm-6am)\rWork alone most of the time , very good training.", "pros": "Free swimming", "cons": "Long hours", "date_created": "January 22, 2018"},
{"id": "1c0ad4f8lbrd49hp", "rating": 3.0, "text": "Safe place to work, good place to learn, great entry level employer. Management leaves a lot to be desired. Good if youre more concerned about living life then making a living.", "pros": null, "cons": null, "date_created": "December 1, 2017"},
{"id": "1bvig88q2b80pami", "rating": 3.0, "text": "As with most civic employers, there is significant bureacratic issues to deal with such as cultural change and workplace bullying.\r The salary for full time positions is acceptable but working conditions for Part time and casual staff is pretty dismal. \r The CUPE Local 21 Union is in some turmoil so union support is limited.\r Overall a decent employer", "pros": "Usually Good Coworkers", "cons": "Bureaucratic nightmare", "date_created": "November 22, 2017"},
{"id": "1bs9isn25akicbfr", "rating": 3.0, "text": "Best work / life balance I've ever experienced. Reasonable salary and great benefits package. Would recommend a career with the City to anyone without hesitation.", "pros": null, "cons": null, "date_created": "October 12, 2017"},
{"id": "1bqtuloqiaqi49lb", "rating": 5.0, "text": "A typical day starts with a tale gate meeting to bring up any safety issues the crews may have and how they can be resolved. Afterwards the work for the day is passed out to each crew, unless they already have work on the go.", "pros": null, "cons": null, "date_created": "September 25, 2017"},
{"id": "1bjop8cpfak5bcc1", "rating": 4.0, "text": "I have enjoyed my time at the City of Regina and am thankful for to learn a trade but would like to move to a new city. I hope i can land a concrete job in Calgary with my experience.", "pros": null, "cons": null, "date_created": "June 28, 2017"},
{"id": "1bj71g8f0ak8odrk", "rating": 3.0, "text": "On my average day i would do three things at city of regina\r1) Diagnose issues staff was having with internal systems and try to walk them through it via training or diagnosing bugs\r2) Update and create new reporting forms for our ticket and records management system\r3) Maintain and update SQL database with records\r Overall i found this job to be a great place to work in the 6 months i was there and i learned a lot in terms of customer service and the upper level it staff helped me along in areas i was shaky in.", "pros": null, "cons": null, "date_created": "June 21, 2017"},
{"id": "1bhqvcbc3ak8lfot", "rating": 4.0, "text": "its enjoyable place to work lots of laughs and smiles good people and outside in the sun is good for lots of people...best part is working independently driving", "pros": null, "cons": null, "date_created": "June 4, 2017"},
{"id": "1bgu0ktbv52t7fm4", "rating": 5.0, "text": "- Perfect working environment.\r- perfect learning opportunity\r- First in Canada to implement O365, cloud services environment.\r- Very cold weather in regina.", "pros": null, "cons": null, "date_created": "May 24, 2017"},
{"id": "1bfo3oa5lak4rckm", "rating": 5.0, "text": "I can honestly say that the City of Regina is the best employer I've ever had. My team has a great manager, senior consultants, and operational team, an incredible team atmosphere, interesting work, great work-life balance, and a solid compensation package. If you get a chance to join the team, don't hesitate.", "pros": null, "cons": null, "date_created": "May 9, 2017"},
{"id": "1bfmt72mv1d0p21f", "rating": 3.0, "text": "I worked with the City on contract for several assignments.  Each department I worked was educational and I enjoyed working with some amazing co-workers.  I would definitely work there again.", "pros": null, "cons": null, "date_created": "May 9, 2017"},
{"id": "1bf3o0aajaqgh9nj", "rating": 3.0, "text": "Mopping floors and cleaning rec centers before customers come is nice and quiet work. There's usually enough work to last the whole day but other times it's pretty quiet all day.", "pros": null, "cons": null, "date_created": "May 1, 2017"},
{"id": "1ba456ggmas1lfum", "rating": 5.0, "text": "The most enjoyable part of the job was to meet a lot of people that have the same interests than me. I had healthy activities and also I participated in tournaments.", "pros": "Good work enviorement", "cons": "Na", "date_created": "February 28, 2017"},
{"id": "1b92bfq3pb89c80g", "rating": 5.0, "text": "cleaning up the area that needed to be cleaned up.\ryou can't really ask for much more.\rboss was friendly.\rworking in the sun.the satisfaction of knowing i did a good job", "pros": null, "cons": null, "date_created": "February 15, 2017"},
{"id": "1b5q3emmqaqgmfil", "rating": 5.0, "text": "Awesome work environment. People are very professional, cooperative and love to help each other.\r I would recommend this to everyone.", "pros": null, "cons": null, "date_created": "January 6, 2017"},
{"id": "1b4d4bnbqakavbkg", "rating": 4.0, "text": "Learned lots of landscaping methods. \rMajority of co-workers were fairly easily to get along with.\rhardest part of job is hard to say because I found that job fairly easy. \rmost enjoyable thing about working with the city was working outside.", "pros": null, "cons": null, "date_created": "December 19, 2016"},
{"id": "1b22in7tfas2b9q3", "rating": 5.0, "text": "Very professional environment where they encourage you to learn and improve. However, it really does depend on your team and your leader.", "pros": null, "cons": null, "date_created": "November 20, 2016"},
{"id": "1g3s2tiop2oqb002", "rating": 3.0, "text": "If you're looking for a company as a family person, City is for you. Job security and work to life is pretty good. Let's to do most of the time. I like working with city.", "pros": null, "cons": null, "date_created": "May 24, 2022"},
{"id": "1apqm9msiaka4c3l", "rating": 4.0, "text": "it taught me  responsibility, how to complete task on my own. how to manage my time efficiently. great place to enjoy the outside while making money. built friendships and business relationships", "pros": "great learning experience", "cons": "no room to grow", "date_created": "August 10, 2016"},
{"id": "1alq8eiij5n9qbri", "rating": 4.0, "text": "•\tAnswer internal and external customers' inquiries\r•\tEnter and validate vendors' invoices\r•       Make payments \r•\tReview aging", "pros": "flexible", "cons": "temp job", "date_created": "June 21, 2016"},
{"id": "1alb01qtnak5jeu3", "rating": 4.0, "text": "everyday is learning the new thing and challenging. Learn how to adapt and adjust to the changes of process. Deal with accuracy and chemicals", "pros": null, "cons": null, "date_created": "June 15, 2016"},
{"id": "1akthnfctb84lcjm", "rating": 5.0, "text": "The day starts of as a building check to see if everything is up to stander. There is very hard working co-workers that do a very good job.", "pros": null, "cons": null, "date_created": "June 10, 2016"},
{"id": "1agor3qhq52uif2a", "rating": 3.0, "text": "I had a very rewarding career with the City of Regina. I worked in several different positions, and given additional responsibility each year.", "pros": "Pension and benefits", "cons": "Lack of funding for projects", "date_created": "April 19, 2016"},
{"id": "1a9e784jv0mt35jf", "rating": 4.0, "text": "-Work began early (630 am) so that we could get out of work earlier in the day and still have time to do things for ourselves.\r-The bulk of the employees were quite helpful and willing to teach the new people.\r-Learned concrete construction skills.\r-Hardest part of the job was keeping up with the concrete; making sure that the concrete was properly finished prior to it setting.", "pros": "4 day work week", "cons": null, "date_created": "January 19, 2016"},
{"id": "1a236mbv8b86v9cq", "rating": 4.0, "text": "I worked at the City of Regina for 15 years and overall had great relationships with my managers.  All the staff were good to work with and I made some great contacts and relationships.  Would work with them again if I had the opportunity.", "pros": null, "cons": null, "date_created": "October 20, 2015"},
{"id": "19tdtp8tl5n96c0q", "rating": 1.0, "text": "horrible place to work there's a lot of verbal abuse people will stab you in the back in 5 seconds never seen anything like it in my life the Human Resources is a complete joke if they don't like you for some reason in 3 months they basically can do what they want I would recommend stay away", "pros": "none", "cons": "horrible people no benefits list is too long", "date_created": "August 23, 2015"},
{"id": "19svcsvqtas0pem6", "rating": 5.0, "text": "Fast environment \rDay start with a smiling face, energetic mood \rBe positive to help the customer\r Management , co workers are very supportive, friendly and I love my Job\r Helping customers enjoys and make me to love my job\r I go by Sunny", "pros": null, "cons": null, "date_created": "August 17, 2015"},
{"id": "19plgu7reak57b6r", "rating": 5.0, "text": "Very flexible shifts and hours\rlots of experience in customer service and helping the public\rgreat co-workers\rgood pay", "pros": null, "cons": null, "date_created": "July 7, 2015"},
{"id": "19i8s4bd1b80gcvk", "rating": 3.0, "text": "I would love to work for the City of Regina.\rThere is a lot of turnover with staff being rotated and moved so very often hindering the growth of many new comers.\rThe Management is supportive and biased when it comes to supporting  and backing new employees and sides only management fully.", "pros": "Great incentives", "cons": "No support for below management staff", "date_created": "April 6, 2015"},
{"id": "19do5og6hak8gbp1", "rating": 5.0, "text": "Great place, and great atmosphere. I learned how to operate various types of hand held and heavy equipment. The supervisors are great guys and really try and motivate co-workers. Everyone works as a team, even if your by yourself. Its great.", "pros": "You get to work outside", "cons": "Rain days", "date_created": "February 9, 2015"},
{"id": "198ek490mb80ge8n", "rating": 4.0, "text": "The forestry department for the City of Regina was a good job due to  both working with many personable fellow employees and oftentimes performing unique and interesting tasks. I learnt about heavy machinery and how to operate it, including the acquisition of my air-brakes endorsement.\r Every day began at 07:30, with a meeting at around 07:40. We would discuss what was to be done during that day, and the tasks to be assigned for that day. Following this, we would load our trucks up with the necessary equipment, being sure to check all of it before leaving. Then we would perform a 'circle-check' where we inspect the vehicle for anything that might not be working properly and needs repairs. This was recorded on a log book which was filled out when you start using the vehicle, and once again when you stopped. \r The assigned tasks varied per day, but they mainly consisted of pruning and chipping tree branches, planting, fertilizing, and watering new trees, as well as disposing of logs with a front-end-loader that are too large to be chipped.\r There were essentially two groups of co-workers: the permanents and the casuals. Many of the permanents were patient in training the younger casuals and quite approachable when needing any help. \r The most difficult part would be the occasional heavy-lifting, which would normally not be an issue, however it can be exhausting in the summer when working outside. The most enjoyable part would be when your efforts are acknowledge by thankful citizens, who appreciate you removing a dead tree in front of their house or planting a new one.", "pros": "Paid well, co-workers were friendly", "cons": "Working outside in the summer without air-conditioned vehicles", "date_created": "December 5, 2014"},
{"id": "18q9f2ouoak8g8tj", "rating": 5.0, "text": "Loved working here and would go back if I ever needed to. The management was all very nice and it was very much like a big family.", "pros": null, "cons": null, "date_created": "June 12, 2014"},
{"id": "18alcloqsb84ga2b", "rating": 3.0, "text": "Fun and always learning new jobs. Constant safety measures are taken.", "pros": null, "cons": null, "date_created": "November 30, 2013"},
{"id": "17ijksbck5dsgfqf", "rating": 5.0, "text": "Working in my current project is challenging, embedded with fun.", "pros": null, "cons": null, "date_created": "February 4, 2013"},
{"id": "17ibeq0l8b84g9dr", "rating": 3.0, "text": "The City has undergone several reorganizations since I began there in 2006. There is growing uncertainty regarding the sustainability of the pension plan and the direction of upper management. The City has not had the ability to attract senior engineers to distribute the work load. Daily my job entailed project management of large scale capital projects and landfill operations management. Since being relocated from Environmental Engineering to Landfill Operations, I have becoming more involved in the day-to-day operations and management of the City’s landfill including site regulatory requirements, integrated solid waste management plan, compliance with landfill site design requirements and landfill inspections, waste acceptance and screening, leachate production and management , landfill gas generation and management, equipment selection and maintenance, cell construction and compaction, litter control, health, safety and security management issues, gate attendant and scale house operations special operating concerns, groundwater monitoring, landfill economics, landfill closure and long-term care issues.", "pros": "ample opportunity for professional development", "cons": "growing uncertainty regarding the sustainability of the pension plan", "date_created": "February 1, 2013"}
]