[
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1gi7dkfu0j323802", "rating": 3.0, "text": "So many low effort employees have passed through this place that the bar is set really low and if you're a hardworking you'll have to separate yourself emotionally and do your own thing,  if you're partnered with a 5+ years vet, you'll find that your workday consists more of driving around aimlessly than it does actual work. ", "pros": "Great pay", "cons": "Miserable coworkers and foremen", "position": "Skilled Labourer", "date_created": "November 19, 2022"},
{"id": "1gha9h1vq2cj2000", "rating": 4.0, "text": "Very nice people to work with, especially crew chiefs are very nice and helpful when you need to know what needed for the job, overall they are great ", "pros": null, "cons": null, "position": "Journeyman Electrician (Former Employee)", "date_created": "November 7, 2022"},
{"id": "1gh9c0adbj31g800", "rating": 5.0, "text": "The student laborer position was easy to grasp as you were always working with a seasonal and always had someone to ask for help. The job was just landscaping but just for a whole neighborhood", "pros": null, "cons": null, "position": "Student Labourer (Former Employee)", "date_created": "November 7, 2022"},
{"id": "1ggbg347bjgbb801", "rating": 3.0, "text": "Benefits and pension is good but it's difficult to work there and have children as you will be reprimanded if you need to use sick time or don't have 10 people as options to watch them on your behalf", "pros": "Pension, benefits", "cons": "HR doesn't care, you can end up working 3 desks without extra pay when they don't replace people who leave", "position": "Clerk (Current Employee)", "date_created": "October 26, 2022"},
{"id": "1gekjqobejtff802", "rating": 4.0, "text": "Driving a tandem sand/salt spreader can be stressful but overall good experience. Good workplace atmosphere, great coworkers. Fast paced and keep you on your toes.", "pros": null, "cons": null, "position": "Equipment Operator (Current Employee)", "date_created": "October 5, 2022"},
{"id": "1gcv2050pklt3802", "rating": 3.0, "text": "The pay is good but if you have a social life or enjoy spending time with your family then this is not the job for you. They don’t care about work life balance. Who wants to work night shift for their career with a weekend during the week. We have tried to convince management to allow some type of shift rotation so all can have a weekend off occasionally but they won’t even consider it. Too much work to do the scheduling they say but they continue to lose good guys because of the poor shifts. Then they have to hire and train more which cost money. If they fixed this guys would be happier and they wouldn’t have the turn over they do.", "pros": null, "cons": null, "position": "Heavy Duty Mechanic (Former Employee)", "date_created": "September 14, 2022"},
{"id": "1gags7nuhkf14802", "rating": 2.0, "text": "Doesn't pay well enough to survive comfortably. Lots of opportunities but must have education and papers. Departments are segregated. Too many inexperienced foremen making up rules as they go.", "pros": null, "cons": null, "position": "Park amenities inspector (Current Employee)", "date_created": "August 15, 2022"},
{"id": "1gadf0hadkf14802", "rating": 1.0, "text": "I’ve never seen or heard of anyplace like this. There are people who make me wonder if they actually do anything aside from connive, and then nominate each other for recognitions. Just a little mutual admiration society. ", "pros": null, "cons": "Management. HR.", "position": "Safety Technician  (Current Employee)", "date_created": "August 14, 2022"},
{"id": "1ga6pk7f1k6f6802", "rating": 4.0, "text": "Being a wading pool attendant is a great summer job, the work is easy, most of the time you get really chill coworkers, and the pay is great. If you get bored or frustrated easily though, it might be hard for you since it’s a lot of sitting and watching, and sometimes kids will not want to listen to you. Aside from that, the office is always pretty chill as long as you do the things you’re supposed to do. ", "pros": null, "cons": null, "position": "Wading Pool Attendant (Current Employee)", "date_created": "August 11, 2022"},
{"id": "1ga53scdqllq9802", "rating": 1.0, "text": "Do yourself a favor and walk away. Not worth it.  Management don't care about about you. Theyonly care about numbers. You're used and abused. Don't apply. ", "pros": null, "cons": null, "position": "Bus Operator (Former Employee)", "date_created": "August 10, 2022"},
{"id": "1g8n83p2egfpd800", "rating": 3.0, "text": "Stressful but it keeps you busy. There’s some support but not all. There are days where it’s laid back and others where it’s busy to the point you almost forget to take your lunch. You’ll work with people who are rude and bossy….. but there’s always that one person I guess", "pros": null, "cons": null, "position": "Support Clerk (Current Employee)", "date_created": "July 23, 2022"},
{"id": "1g8bobhlpkf14802", "rating": 1.0, "text": "Rampant nepotism, outdated non functional systems, unrealistic expectations, no direction training or mentorship.If you want to fill a chair the City of Winnipeg is right for you - just watch management if they bother coming in.", "pros": null, "cons": null, "position": "Clerk (Current Employee)", "date_created": "July 19, 2022"},
{"id": "1g8411jjakf14801", "rating": 1.0, "text": "Worst job I've ever had, worst people I've ever worked with, and worst management I've ever seen. It's not a good place to work. Everyone always says \"safety first\" but at the city of wpg it goes \"money, convenience, then safety\" ", "pros": null, "cons": null, "position": "Utility Worker (Current Employee)", "date_created": "July 16, 2022"},
{"id": "1g7rvo6cl23jb001", "rating": 4.0, "text": "What you would expect of a call centre at 311. You’re breaks are paid for which is awesome and on busy stressful days they will order pizza or donuts. The weekend evenings you have more time between calls but any other time you’ll be taking back to back.", "pros": "Breaks, paid lunch", "cons": "Long hours", "position": "Customer Service Representative (Former Employee)", "date_created": "July 13, 2022"},
{"id": "1g5qb6qfam6fa801", "rating": 3.0, "text": "I worked at 311 call center as a Customer Service Représentative department of the City of Winnipeg.  Work related there is not much pressure from management or any weekly goals. But the main part that will require all your energy is handling the incoming calls from unhappy clients. Overall, think of this jobs as a good job while you wait for a better job or a promotion within the department.  ", "pros": null, "cons": null, "position": "Customer Service Representative (Current Employee)", "date_created": "June 17, 2022"},
{"id": "1g2odjt6bjm5n800", "rating": 1.0, "text": "Incredibly toxic and high ups have no consideration. Your mental health will skyrocket. When you say no they get upset and threaten you about being written up.", "pros": null, "cons": null, "position": "CSR", "date_created": "May 10, 2022"},
{"id": "1g0kjnkohghrm800", "rating": 3.0, "text": "integrity has declined over years.  leadership and management has become a popularity advancement based on who will due what is told and not challenge or present new thinking", "pros": null, "cons": null, "position": "Community Service Worker (Former Employee)", "date_created": "April 14, 2022"},
{"id": "1fvroqnj0pkeh800", "rating": 3.0, "text": "constant info citizens about their complaints, flexible work hours, allows you to work OT or extra hours, hardest part of the job is being yelled by callers", "pros": "flexible work hours", "cons": "pay, employment status", "position": "clerk (Current Employee)", "date_created": "April 4, 2022"},
{"id": "1furuekpnu2e4801", "rating": 1.0, "text": "There is extremely weak management and zero leadership. This city of Winnipeg is going in the wrong direction and is a horrible place to work and live. I have seen several people leave city jobs for less pay in the private sector. They are happier and never look back.", "pros": null, "cons": null, "position": "Public Works (Current Employee)", "date_created": "March 23, 2022"},
{"id": "1fumga6esq0vq802", "rating": 2.0, "text": "You’d think getting a city job is the start of a career, this job is not accommodating for anyone unless you have absolutely no life outside of work. Huge team, lots of management and no one knows anybody, not even your direct supervisor. Inconsistent schedules, one week can be part time hours and the next can be full time, you pick your schedule for a month in advance. Constantly being belittled by citizens, not enough people answering phones causing frustration and long wait times. ", "pros": "Paid lunches, good benefits", "cons": "Hours, scheduling, management", "position": "Customer Service Representative (Current Employee)", "date_created": "March 21, 2022"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1fues33bkhich802", "rating": 1.0, "text": "Lazy unqualified management nepotism at its best. Work ethic will get you in trouble as others will push you down. Management harassment if you stand up for yourself .", "pros": null, "cons": null, "position": "Labourer (Current Employee)", "date_created": "March 18, 2022"},
{"id": "1ftr8p0o5u2uf800", "rating": 2.0, "text": "Worked there through university and made good money for the job. Loved working with kids and coworkers in the same age demographic. However higher up management is incredibly toxic. Is filled of individuals who started working as teenagers and never left, moving up the ranks. Expect full time commitment for \"temporary employee\" status. ", "pros": null, "cons": null, "position": "Lifeguard/Swim Instructor (Former Employee)", "date_created": "March 10, 2022"},
{"id": "1ftk5gaaju1ec800", "rating": 1.0, "text": "Inadequate communication & feedback between employees & employees & employees & management. People that work hard are undervalued ,underpaid without acknowledgment for strong efforts .Lazy co-workers get by doing not much of anything, with impunity. The benefits are advertised as being generous but in reality fall far below benefits offered by many other employers.", "pros": "Meeting new people", "cons": "Gossipy co-workers", "position": "facility monitor (Current Employee)", "date_created": "March 8, 2022"},
{"id": "1fth3m6o9u2im801", "rating": 4.0, "text": "I worked as a wading pool attendant and it was a decent job. My coworkers were great, and the work was incredibly easy with good pay. The only downside is the supervisors. Some of them are great but there are a couple who have tried hitting on employees, or are just way too strict and unfair. ", "pros": "Good hours, good pay, good environment", "cons": "A lot sitting and watching, supervisors are sus", "position": "Wading pool attendant (Former Employee)", "date_created": "March 6, 2022"},
{"id": "1fqpi4hgeu1b6802", "rating": 2.0, "text": "I had a good time with my co-workers who weren't management for the most part, the wages you get are decent too and there's a chance for Sunday premium work if applicable/chosen. However, laziness is the name of the game with city employees and the gardening job is nothing more than taking care of glorified flower beds like grandma does. We spend over $1,000,000 on water alone for the flowers we plant each year, which is honestly a horrible waste. I planned on quitting in my final 3rd year there but was unceremoniously terminated less than a week before the end of season after word got around to my boss that I was going to quit. This then screwed me out of E.I. benefits for the winter, and I struggled immensely that winter just to get by and find a job.Just goes to show you, don't trust anyone when it comes to the City of Winnipeg employees.", "pros": "Higher pay than most ($19-20/hr), mostly good and friendly workforce, easy and simple tasks, lots of time to relax and literally do nothing", "cons": "Horrible management, cliques are everywhere, city politics messes with workflow and dealing with the public can be dangerous", "position": "Gardener 1 (Former Employee)", "date_created": "January 31, 2022"},
{"id": "1for4jjd3n56q800", "rating": 5.0, "text": "Getting in with the City of Winnipeg is always a great idea. They provide good job security and benefits, and there are opportunities for career advancement once you get your foot in the door. But that’s the key point; once you get in! That’s the tough part. Lots of applicants for a limited number of jobs, and the hiring process can take a lot of time. Maybe the type of thing you apply for while you already have a job. If you’re in school that’s a great time to apply for a summer internship or part time job, that might be the easiest way to get your foot in the door (far less competition)!", "pros": null, "cons": null, "position": "Traffic Services (Former Employee)", "date_created": "January 7, 2022"},
{"id": "1fll88hcpu1l4801", "rating": 5.0, "text": "Getting in with the City of Winnipeg is always a great idea. They provide good job security and benefits, and there are opportunities for career advancement once you get your foot in the door. But that’s the key point; once you get in! That’s the tough part. Lots of applicants for a limited number of jobs, and the hiring process can take a lot of time. Maybe the type of thing you apply for while you already have a job. If you’re in school that’s a great time to apply for a summer internship or part time job, that might be the easiest way to get your foot in the door (far less competition)! ", "pros": null, "cons": null, "position": "Administrative Assistant (Former Employee)", "date_created": "November 29, 2021"},
{"id": "1fli0es8qt4vo802", "rating": 4.0, "text": "The atmosphere was pleasant and lots of fun with my classmates. Supervisors are straight to the point and are willing to help you move forward in the company.", "pros": "Happy workmates", "cons": "Long hours for the pay", "position": "Transit Operator (Former Employee)", "date_created": "November 27, 2021"},
{"id": "1fl7savtpn5co800", "rating": 2.0, "text": "I've had quite a few positions. It started out great. I was young and the seasonal jobs are perfect for students and young people. Pay is great compared to any other job you can find doing similar or more difficult work. I had a lot of fun the years I was a seasonal worker. However, it wasn't challenging work at all. You don't need any knowledge, experience, skill or beneficial personality traits. I was always under the impression the City was a \"career\" - not just a job. But over the years of being subjected to stupid rules, disconnected management, watching people that didn't deserve promotions being promoted, learning to not question anything because logic doesn't exist within the City and seeing countless employees that should be fired welcomed back to the same position... I decided to pursue other career options due to feeling highly undervalued, unappreciated, virtually invisible and disrespected.  Your work ethic doesn't matter. Your skill level doesn't matter. Your ideas and desire to change things for the better doesn't count. The amount of work you do in a day doesn't matter. You can get away with doing absolutely nothing every day or taking on the work load of 3 slackers - you'll be treated the exact same. Between you and the employee that does absolutely nothing and management all hate - that person will get the promotion if they have more seniority than you and HR & The Union will make sure of it. Everything takes forever so if you get an interview - expect to hear back from them 3 months later. If they say something will be changing, expect the change in 5 years - more...", "pros": "Great coworkers, good overtime if you want it, fun/easy summer work, decent salaries, looks good on a resume", "cons": "Terribly coordinated, awful management, senior people who don't care, completely unfulfilling, rules/methods that are senseless, no desire to change anything from upper management", "position": "Multiple different positions", "date_created": "November 23, 2021"},
{"id": "1fkvdbffkn59v800", "rating": 3.0, "text": "Excellent place for retirement, good benefits, good pension, slow and relaxed place. Union sucks ... useless overpaid cowards. Management belongs to different union.", "pros": "day shift 7am 2-30pm", "cons": "low salary", "position": "General Helper (Current Employee)", "date_created": "November 20, 2021"},
{"id": "1fgp26jmtn5cv801", "rating": 5.0, "text": "Nothing but good times sad to go but starting a new chapter great job but your income hits a ceiling pretty quick great benefits great coworkers just a good time you might not make insane cash but not hating your job can be priceless...laid off half the year which can be good or bad but you can gain year round employment tonnes of different departments to try out....seniority rules.....would recommend it gotta be one of the best jobs out there ", "pros": null, "cons": null, "position": "Jack of all trades (Former Employee)", "date_created": "September 29, 2021"},
{"id": "1ffshv605u428802", "rating": 5.0, "text": "By far the best employer I have had. Work is pretty casual, no stress, foremen are knowledgeable and are always willing to help.Water & Waste department runs a 5 on, 5 off shift with a 4 on 4 off every 3rd shift so your weekends are like have a mini vacation.", "pros": "Wage, Shift", "cons": "Hard to get a full time permanent position", "position": "Skilled Labourer (Seasonal) (Former Employee)", "date_created": "September 18, 2021"},
{"id": "1ffit8i1gu428802", "rating": 4.0, "text": "Good people, reasonable workload. Overall great company culture. Benefits once you hit a certain amount of working hours. Ability to apply to other positions within the City. ", "pros": "Benefits", "cons": "Seasonal", "position": "Technical Assistant (Former Employee)", "date_created": "September 14, 2021"},
{"id": "1fehbiqfvu33u801", "rating": 2.0, "text": "Call center at water billing had some of the worst workplace culture ive ever experienced. Management run by S.Atkinson offered no positive feedback and an environment constantly  under appreciating its employees. The job itself is incredibly stressful and you’re under constant abuse from citizens. In return you are: charged for your own christmas party ($16-25 a person), the clerk c’s payed their own money for employee appreciation lunches, you arent allowed to use the bathroom on the clock and they will not take dr’s notes if you have a health condition.  Benefits are meh. Bare bones and not 100% coverage. Would not recommend. The opportunities to advance are competitive and based on seniority. If you’re looking for entry to work in the city youll be stuck in the call center for years before getting a new position ", "pros": null, "cons": "No free lunches. No christmas party.", "position": "Clerk B", "date_created": "September 1, 2021"},
{"id": "1fd0f0d4jhihf800", "rating": 4.0, "text": "People I work with have average knowledge and sometimes they don't want you to do things beyond their capability because you are new to workplace. You don't need to be smart to work here because they will teach you what they want you to do. As I said don't be so Smart because they will not like you, just follow them. Seniority is a big deal in the City even if they are less knowledgeable. Many workers are little bit lazy, sorry.", "pros": "I feel like I am at home because you have access to Microwave, toaster & Fridge.", "cons": "Be a Yes guy.", "position": "Building Servicer 1 (Seasonal) (Former Employee)", "date_created": "August 13, 2021"},
{"id": "1f9vglba2hipq802", "rating": 3.0, "text": "Although it’s understandable, people lower on the list get no hours or are given hours they are not able to work. Everything is based on seniority, so the lower on the list (or newer hired) the less likely it is that you will get hours you want. This is extremely difficult to manage around especially as a student and in COVID. I have seen applications for hiring jobs with the city such as instructor guard, where I personally know people who don’t have hours and have this job title and have already been hired by the city. When I was there for 1 shift, the people at my pool were very kind and helpful.", "pros": null, "cons": null, "position": "Aquatic Instructor (Current Employee)", "date_created": "July 6, 2021"},
{"id": "1f7sb5ih6u1m4800", "rating": 1.0, "text": "There was no freedom to use new ideas, management stuck in the dark ages, zero incentive to go above an beyond. Workplace is toxic and management supports a toxic workplace.  Policies arent followed by management, laws get broken, zero accountability if you are management.", "pros": "salary was ok", "cons": "terrible work culture", "position": "Safety Technician (Former Employee)", "date_created": "June 10, 2021"},
{"id": "1f5afe3fou3af800", "rating": 5.0, "text": "Great Place to Work with lots of sense of purpose in the service delivery to the tax payers of the City of Winnipeg. I wake up each day looking forward to the activities for the day.", "pros": null, "cons": null, "position": "Head", "date_created": "May 10, 2021"},
{"id": "1f22gr4nvt45n800", "rating": 2.0, "text": "The actual job was wonderful, I loved working with kids and teaching them important life skills. HOWEVER the management was awful. I got a promotion and lost all my hours, I went from 4 -5 shifts a week to 1-2 shifts a week and made barely enough money to cover my gas to get to work. They treat new hires like garbage and expect you to make school work AROUND work. I got constantly threatened with getting fired because my school schedule didn't work for them (not my fault I can't choose when my classes are the college does)", "pros": "Flexible Hours", "cons": "Not enough hours available for everyone to work", "position": "Lifeguard/Swim Instructor (Former Employee)", "date_created": "March 30, 2021"},
{"id": "1f03qqci2u4d4800", "rating": 3.0, "text": "Pension is good for long term employees but not short term. A payout is nice but if you are working for a term then pension is irrelevant.  The environment in the workplace smells of sewage even in the lunch room.", "pros": null, "cons": null, "position": "Lab Technician (Former Employee)", "date_created": "March 6, 2021"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1eud3t51ru1ib800", "rating": 3.0, "text": "Stress, stress and more stress.No bathroom breaks while driving, since restrooms hard to find and schedules tight.Long hours and split shifts when you start.Not a great job for family/ life balance.", "pros": "Work in controlled environment, no physical labour.", "cons": "Long hours, split shifts, stress and lack of support", "position": "Winnipeg (Former Employee)", "date_created": "February 13, 2021"},
{"id": "1etf2ppuau1n1800", "rating": 4.0, "text": "Could be a super post career job. Outside all day, clean air and park assignments. Younger managers are taking over with the retirement of senior ones now leaving. Enjoyed year one. ", "pros": "Great staff, with younger management.", "cons": "Can be hot, raining or just a super nice day outside with work detail.", "position": "Parks and Recreation (Current Employee)", "date_created": "February 1, 2021"},
{"id": "1esmbr048t4lr800", "rating": 5.0, "text": "I love my job, best job in the world. I get to help the citizens of Winnipeg with medical emergencies and building/structure fires along with motor vehicle collisions. ", "pros": "Great salary and benefits and great work environment.", "cons": "Shift work sometimes is tough.", "position": "Firefighter (Current Employee)", "date_created": "January 22, 2021"},
{"id": "1ek38s20vo2dd800", "rating": 1.0, "text": "It was a great place to work until you make a mistake. Then you are punished for years.  Management enjoy bullying you and not giving you a break. Training is really good but when they start bullying you you may as well quit. The union too is garbage  collect dues and allow the unfair treatment to continue.", "pros": "Co worker's", "cons": "Bullying, harassment, lazy people getting ahead, females treated better than males, very poor management, foremans grand fathered in that dont have atleast grade 10, slack workload/environment", "position": "Forestry Worker (Current Employee)", "date_created": "October 7, 2020"},
{"id": "1efgg1v07rnji800", "rating": 5.0, "text": "They treated their employees very well and were very accommodating with work hours. The over all hourly wage was great and the hours were very good for someone with a busy schedule or a student, weather theyre a student in highschool or post secondary.", "pros": "Great hourly wage", "cons": "short shifts", "position": "Learn to Skate Instructor/Assistant (Current Employee)", "date_created": "August 11, 2020"},
{"id": "1eeiqskvjr4sg800", "rating": 2.0, "text": "I worked as a CSR for 311. I learned a lot about the City of Winnipeg. The job itself was very stressful. You had to answer calls for all the City Departments. Citizen who called were generally upset about something. They called expecting to speak to a member of a certain department and instead got a 311 operator.  The pay did not match up to the amount of information you had to know or access to relay to the citizen. (26 or so different departments to answer for) The pay at $13.90/hr was not a living wage. The benefits were great but it didn’t make up for the low pay. The training was long but very little training on the phones. My training class started out with 25 people. By the time I left the job 6 months later, only 4 from that training were still working at 311. The hours were all over the place. It made it difficult to arrange around a school schedule or to have another job. If you want to get your foot in the door to work for the City, 311 is not the best way. It is an ok job if you are very young or this is your first job. But if you are supporting a family, not good. They required (at the time) 311 operators to work at 311 for a year before applying for other jobs at the City. The management and higher ups seemed very unhappy and the atmosphere at 311 was somber. There was little interaction with coworkers and generally a depressing place to be. It was not a great experience. ", "pros": "Benefits, statutory holiday pay", "cons": "Low pay, chaotic hours, low morale environment", "position": "311 Operator (Former Employee)", "date_created": "July 31, 2020"},
{"id": "1ecgqpqj0q41a800", "rating": 5.0, "text": "Working for the City of Winnipeg was a great experience. \rThere calls we took varied from informing a citizen about the road closure to informing them about the amount they owed on their property tax.", "pros": null, "cons": null, "position": "Information Officer (Former Employee)", "date_created": "July 5, 2020"},
{"id": "1ebd54asdrmho800", "rating": 2.0, "text": "Management is lazy, some can be helpful but rarely as the company works based on seniority and not on skills. Hours are all over the place. They do not accommodate students or daycare. Citizens call all day long to yell at the staff about the city.", "pros": "Co-workers are nice", "cons": "Random hours", "position": "CSR (Former Employee)", "date_created": "June 21, 2020"},
{"id": "1eb461sndqnuo801", "rating": 2.0, "text": "The culture at the City of Winnipeg is very poor with the 3 different departments I worked for in my 8 years with them. It was okay to start there as I gained experience, but felt it was a toxic place that didn't appreciate the employees that are actually there to do a good job. You're put in a box automatically with the majority lazy workers the public talk about. It's frustrating and the City of Winnipeg really needs to restructure the toxic culture it enables in all departments. People are being paid very well, but the jobs aren't being done properly or done poorly. I will never go back to working for an environment like that.", "pros": "good pay, easy to do bare minimum and get away with it.", "cons": "culture and environment is toxic", "position": "Bridge Worker (Former Employee)", "date_created": "June 18, 2020"},
{"id": "1eabdl0qtr4u2800", "rating": 5.0, "text": "Overall it was a good place to work. Problem is pay. Not enough to make a real living. I had a good gaining experience as data processing, and learning new programs. Overal it was good.", "pros": null, "cons": null, "position": "Customer Service Representative (Former Employee)", "date_created": "June 8, 2020"},
{"id": "1e9qo645aqh14800", "rating": 2.0, "text": "The people are very nice and so is the work.  HR supports Management. Management at the Indigenous Relations is the most toxic place and directly contributes to the suppression of Indigenous peoples, who work and live for and in the city. You are shamed and the environment is toxic. Employees are bullied and other people but their heads down while it happens.", "pros": null, "cons": null, "position": "Customer Service (Former Employee)", "date_created": "June 2, 2020"},
{"id": "1e9564muongvr800", "rating": 5.0, "text": "Best place to work. Second to none Area Coordinator/Manager in the Residential Property Assessment Department. This manager should the prime minister of Canada", "pros": null, "cons": null, "position": "Field Assistant (Current Employee)", "date_created": "May 25, 2020"},
{"id": "1e7lmt5qjnh4t800", "rating": 4.0, "text": "I drove semi prior to driving a bus. \rIf bus drivers try to drive to their written schedules, they will not enjoy the job. To be the best bus operator, you had to be friendly and drive safely. To drive as conditions allowed. \rBy being attentive, friendly and cautious you were able to maintain your schedule,  and gain the clients trust. \rDon't let an angry passenger get under your skin. They are unhappy life not at you.", "pros": null, "cons": null, "position": "Instructor (Former Employee)", "date_created": "May 6, 2020"},
{"id": "1e7iev1o3oaq2800", "rating": 5.0, "text": "Working at City of Winnipeg was a great experience. Management and coworkers were very respectful and collaborative.\rDefinitely a great place to work in the city.", "pros": null, "cons": null, "position": "TECHNICAL ASSISTANT (Former Employee)", "date_created": "May 5, 2020"},
{"id": "1e7gm27noo24m800", "rating": 5.0, "text": "Was a perfect summer job to work full time while attending school. They provide ample amounts of training to further advance yourself. If I didn't go to school I would have no issue making the City of Winnipeg my career path.", "pros": null, "cons": null, "position": "Full-time Seasonal Labourer (Current Employee)", "date_created": "May 4, 2020"},
{"id": "1e6utjstkhbql800", "rating": 3.0, "text": "If you are looking at getting your foot into the door for a better career with the city, be prepared to wait a long time! There appears to be a lot of job postings but it takes forever for you to advance, as there is always someone with more seniority than you. \r Also be prepared for the bullying from supervisors, its not all that great and not always worth the pay.", "pros": null, "cons": null, "position": "Clerk (Former Employee)", "date_created": "April 27, 2020"},
{"id": "1e6mcddi3he9t800", "rating": 3.0, "text": "Large staff at the City can mean that you can get lost in the shuffle.  Promotions based on seniority is a poor practice.  I feel I have worked all these years just to have a decent pension.", "pros": null, "cons": null, "position": "Technologist (Current Employee)", "date_created": "April 24, 2020"},
{"id": "1e4ejq96po2l9803", "rating": 5.0, "text": "Transit is a great place to work if you are patient and enjoy driving and are organized enough to deal with split shifts for random time and locations. You get lots of home work to do to prepare for next day Route.\rIt's hard for a few months only, If you have passion for driving, you will get through this easily.\r Overall workplace is fun. After your piece of spilt shift, you have calm and peaceful environment for sleep in the meanwhile time for your next shift. It also have liabarary, tv, table football or playing cards etc to pass the time in breaks.\r Transit pays well and has a pension and simple benefits.\r So Highly Recommended JOB!", "pros": null, "cons": null, "position": "Bus Operator (Former Employee)", "date_created": "March 27, 2020"},
{"id": "1e2cagrcthcsv801", "rating": 2.0, "text": "People you work with are great  the jobs and duties in the city for the most part are easy to accomplish the city is very safety conscience and provide top notch training on ever job to be performed  the bad  generally  management and foreman suck  they have been grandfathered  in and making your work life impossible.", "pros": null, "cons": null, "position": "Arborist 2 step 2 (Current Employee)", "date_created": "March 1, 2020"},
{"id": "1e22ctnusp434803", "rating": 5.0, "text": "The best company ever. The management are polite and know their job. I would recommend this job to people up to 21 years old. All I  can say is just perfect.", "pros": null, "cons": null, "position": "Wading Pool Attendant (Former Employee)", "date_created": "February 26, 2020"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1e0p1u7r2qfrv805", "rating": 5.0, "text": "I was the only GIS Tech in my department and was responsible for all GIS-related work.  I had a large office, steady work, friendly co-workers, and good pay.", "pros": null, "cons": null, "position": "Technologist (Former Employee)", "date_created": "February 10, 2020"},
{"id": "1dvc62bg0h6vj802", "rating": 5.0, "text": "You show up on time. and work until the jobs are done. I learned that its not what you know its who you know. Management is great. Workplace is dedicated to excellence. Don`t talk to the other employees. most enjoyable part of the job is the pay and the training you learn a lot from the training that you recieve. In my time spent at the City of Winnipeg I was paid well for the job and have no problem making light of the situation. I will say that the job is physically demanding and not everyone.", "pros": null, "cons": null, "position": "Labourer (Seasonal) (Current Employee)", "date_created": "January 24, 2020"},
{"id": "1dv5k7gudhbnp802", "rating": 3.0, "text": "Workload is overwhelming\rStressful, taxing on oneself.\rPolitical interference\rImpression of minimal support from senior levels\rGood people with a lot of knowledge.", "pros": null, "cons": null, "position": "Various Positions (Current Employee)", "date_created": "January 21, 2020"},
{"id": "1du5ue4pr3075001", "rating": 3.0, "text": "Half of the department has loads of down time and the other does not and can go 11 1/2 hours without a meal break. Yet management is scared of one half of the department and abuse the the other side, to the point of a grievance, It cost the city $11,000 to settle this.", "pros": null, "cons": null, "position": "Paramedic (Former Employee)", "date_created": "January 9, 2020"},
{"id": "1dtuhp19mhbln801", "rating": 4.0, "text": "The work is only seasonal and you get called back every year if they like you.  The aquatics department hires a lot of students that return to high school or University in the Fall.  However, it is tough to find another job to fit in with the City of Winnipeg because the public generally hates government workers.", "pros": null, "cons": null, "position": "Building Monitor (Former Employee)", "date_created": "January 6, 2020"},
{"id": "1dtpbaq3khc33803", "rating": 2.0, "text": "I worked there as a student and the student workers ended up doing way more work then the people who were there working full-time getting all the  benefits. It is a good summer job to keep busy when out of school but  for  the amount of work the students get suckered into they deserve a way higher wage.", "pros": "Good people", "cons": "Wages for students", "position": "Student Labourer (Former Employee)", "date_created": "January 4, 2020"},
{"id": "1ds1bh5d9no8q800", "rating": 5.0, "text": "One of the best places I ever worked.\rVery supportive coordinators and colleagues. \rManagement was remarkably good.\rIncredible opportunity for growth. \rDream come true job.", "pros": null, "cons": null, "position": "Student centered educator facilitating classes (Former Employee)", "date_created": "December 13, 2019"},
{"id": "1drse8lr525lu001", "rating": 5.0, "text": "Team work, cooperation, fun work athmosphere, safety oriented workplace, mostly relaxing labour intensive ,  result and customer service oriented. Mostly friendly work environment.", "pros": null, "cons": null, "position": "Labourer (Seasonal) (Current Employee)", "date_created": "December 12, 2019"},
{"id": "1dr11if411d0n003", "rating": 5.0, "text": "The City of Winnipeg was a great place to work.   As a member of the Union you know your job is secure.   Pay is above average and you get gaurenteed raise of between 2.5% to 4% every year.   Sometimes twice a year.   There was always a chance to advance in the City but typically you'd have to apply for a higher position within a different branch unless one happens to open in yours.", "pros": null, "cons": null, "position": "Technologist 2 (Former Employee)", "date_created": "December 1, 2019"},
{"id": "1dqcp1v02h3id803", "rating": 5.0, "text": "Working as a wading pool attendant is a great summer job. The environment is very uplifting and I enjoyed the experience of maintaining the safety of the wading pool for happy families spending time there during the summer.", "pros": null, "cons": null, "position": "Wading Pool Attendant (Former Employee)", "date_created": "November 23, 2019"},
{"id": "1dpbm7tutbreg804", "rating": 4.0, "text": "fast paced, lots of mechanical work, supervising, driving, using chemicals and biological chemicals, maintaining trucks and equipment, spray equipment servicing, on road maintance, purchasing, credit card statements, using hand and power tools, operating a forklift", "pros": null, "cons": null, "position": "Maintenace 1 and 2  also ATV \\Gator practical and trainer (Former Employee)", "date_created": "November 10, 2019"},
{"id": "1dorbntff52t0802", "rating": 5.0, "text": "Friendly colleagues,  learnt about job closing, interview and hiring procedure. Very supportive management. It gets a little busier during a job closing day.", "pros": null, "cons": null, "position": "Human Resources Assistant (Former Employee)", "date_created": "November 4, 2019"},
{"id": "1dn5v8tcbh451802", "rating": 4.0, "text": "Good place for students definitely.\rWork is pretty easy(really)& you get a chance to see things you have never see around the city mostly E/W St.Paul.", "pros": "Easy work, lots of chilling in the truck, getting certifications, lots of eating", "cons": "No room for advancement, seasonal, hot in the summer, you will get fat", "position": "Insect Control Utility 3 (Former Employee)", "date_created": "October 14, 2019"},
{"id": "1dmd4vm32h3sq802", "rating": 5.0, "text": "7 hours a day, 1 hour unpaid lunch, very competitive salary and benefits, good culture, lots advancement opportunities, co-workers are friendly and cheerful.", "pros": null, "cons": null, "position": "Accounting Technician (Current Employee)", "date_created": "October 5, 2019"},
{"id": "1dm16u1pqh3sl801", "rating": 1.0, "text": "I worked there for 15 years. I wholeheartedly agree with the first review. extremely toxic place to work! the driver is to blame for everything. there is no back up help when needed.", "pros": null, "cons": null, "position": "Bus Operator (Former Employee)", "date_created": "September 30, 2019"},
{"id": "1dlphrb34h3gh802", "rating": 5.0, "text": "Working for the City of Winnipeg has been a fun and rewarding experience.\rThey really value you as an employee and treat you fairly.\rWorkplace culture is relaxed but professional.\rThe supervisors and managers are the best part, they are very supportive and always there when you need them.", "pros": null, "cons": null, "position": "Recreation Technician C (Current Employee)", "date_created": "September 27, 2019"},
{"id": "1dlnjjmgbh3ki800", "rating": 4.0, "text": "it was hard work because you went to different locations very 2 weeks, but it was fun cause of it cause you wont be totally bored. you will work with kids and youth. you will do some yard work also, depends where ya at.", "pros": null, "cons": null, "position": "Green Team Member (Former Employee)", "date_created": "September 26, 2019"},
{"id": "1dlib7g6i24ec003", "rating": 5.0, "text": "This job will have you walking and interacting with clients for most of the day. You will be largely by yourself entering houses quickly and leaving just as fast. You start by introducing why you are there, ask about dogs and your shoes and then go read the meter...once you have you leave. You do this 5 days a week 6 hours a day. It has a repetitive nature but the interactions will vary.", "pros": null, "cons": null, "position": "Meter Reader (Former Employee)", "date_created": "September 24, 2019"},
{"id": "1dla2j69i24gt000", "rating": 1.0, "text": "I would like to start this review off by stating that I can ONLY comment on my experience working in the Planning, Property, and Development Department. I have worked a variety of jobs starting from factory work all the way to construction project management. It is unfortunate that a place like the City of Winnipeg, that used to be known as a great place to work, has become a thankless workplace filled with bullies, liars, and spineless management. The lack of support and succession planning within this department is mind boggling and is the main reason as to why I left. Current management does not want to see staff grow and succeed and they trap you and once your wage it maxed there is no growth. Because this is a union environment you either have to wait for someone above you to quit or die in order to move up and even then candidates are not selected based off of their skills and capabilities, but by the number of years that they have put into the city (which can be a LOT and a long wait to be able to advance if you’re even given the chance. Current management would rather see external staff in management jobs instead of providing current staff the opportunity and support to grow and advance. They also try to cover up hiring mistakes by bullying people out of positions so that they can accommodate unqualified staff. If you are not awarded a position, you will never get a straight answer OR be told things like “the only reason you received an interview was because it was a courtesy interview, you would never have been selected for that job.” Working in the Planning, Property, - more...", "pros": null, "cons": null, "position": "Clerk (Former Employee)", "date_created": "September 21, 2019"},
{"id": "1dl80l7ih24et000", "rating": 1.0, "text": "if one can put up with a very toxic environment, the pension and some benefits are worth it. currently, no home life/job balance exists, operators are always guilty of complaints unless you can prove innocence,", "pros": null, "cons": null, "position": "Bus Operator (Current Employee)", "date_created": "September 20, 2019"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1dktoqd6c24fh000", "rating": 3.0, "text": "this job is not flexible and the supervisory staff don't  care about the individual in general. They treat you like you are replaceable .The job pays well although a lot of the time it doesn't seem worth it.", "pros": null, "cons": null, "position": "Lifeguard/ Swim Instructor (Former Employee)", "date_created": "September 16, 2019"},
{"id": "1dkgelk91h3hs802", "rating": 5.0, "text": "I work with two people and we didn't have an onsite manager, So we just knew what to do and we did it. We basically ran our own wading pool, We would have to call for management when there was a problem but we mostly resolved them ourselves.", "pros": null, "cons": null, "position": "Recreation Technician (Current Employee)", "date_created": "September 11, 2019"},
{"id": "1djsdietsb81i807", "rating": 3.0, "text": "met some awesome people here and people are usually cool, however can be lazy n waste time, or work super hard n achieve nothing. If you end up working with someone who really shouldnt be working there and puts ur safety at risk good luck getting rid of them", "pros": "good hours, decent wage, easy work", "cons": "some lazy workers, union doesnt help the good workers, only helps the bad", "position": "Full Time Student Labour (Former Employee)", "date_created": "September 3, 2019"},
{"id": "1dja136rgh3vp809", "rating": 4.0, "text": "Did 2 jobs there over 3 years. HR was good to work with. Supervisor was nice and understanding. Although for a minimim wage job, they should raise it a bit more since I was working for the goverment.", "pros": null, "cons": null, "position": "Swim Instructor/Lifeguard (Former Employee)", "date_created": "August 27, 2019"},
{"id": "1dj3pb01vh46t800", "rating": 5.0, "text": "Great schedules, great salary, but didn't make the cut for regularization. Their standards are too high, attainable but because of deaths in the family, I wasn't able to focus.", "pros": "Discount on public transportation", "cons": "Working Saturdays", "position": "Clerk B", "date_created": "August 25, 2019"},
{"id": "1digtvtash46o802", "rating": 2.0, "text": "The City's Insect Control Branch has a new weapon in the fight against mosquitoes - The Standing Water Action Team (S.W.A.T.), and they want you to become one of their agents, dedicated to the removal of standing water that accumulates on private property.", "pros": null, "cons": null, "position": "employee (Former Employee)", "date_created": "August 17, 2019"},
{"id": "1die1ru4fh3qs800", "rating": 3.0, "text": "Enjoyed the on site inspections aspect, met a lot of good people and learned a lot. Management and management practices have gone steadily downhill in the past 5 years.", "pros": null, "cons": null, "position": "Commercial Building Trades Inspector (Former Employee)", "date_created": "August 16, 2019"},
{"id": "1dgm0rt6rh3l0800", "rating": 1.0, "text": "PP&D is a terrible place to work. You don’t get thanked for doing your job and you don’t get punished for not doing your job. If you would just like to coast through life and work for a thankless, unfulfilling company then I suggest working for this department. They hire managers with no background experience pertaining to the actual jobs that they will be supervising and there is no succession planning for current employees. Really disappointing place to work with disrespectful and ungrateful management. Not to mention cute 500 is a pathetic union that does not back it’s members.", "pros": "Coworkers", "cons": "Management, nepotism, poor structure, no common sense", "position": "Clerk (Current Employee)", "date_created": "July 25, 2019"},
{"id": "1dg30eh4b24gd000", "rating": 1.0, "text": "Political kaos at the top\rAdministration that doesn’t know what is happening in the workplace.\rManagement that doesn’t care what is happening in the workplace.\rWorkers trying to survive in workplace without any direction or leadership.\rTax payers are not getting value for their money due management inefficiencies  and lack of knowledge by the administration to effectively provide the leadership necessary to instill confidence within a dysfunctional system.\rThe only solution is to bring back the Board of Commissioners, on a permanent basis.", "pros": "Pension", "cons": "Disorganized confusion - No leadership", "position": "Instrumentation Technologist/Electrician (Former Employee)", "date_created": "July 18, 2019"},
{"id": "1dd66be7fh473800", "rating": 4.0, "text": "Was a lot better on past working there than present. Changes being made are questionable and not ideal .But still a decent place to work , benefits/pension related", "pros": null, "cons": null, "position": "Civil Maintenance Worker (Former Employee)", "date_created": "June 12, 2019"},
{"id": "1dd1q3669h42k802", "rating": 4.0, "text": "Plenty of great people and role models in the workplace. They are always pushing you to become the best person you can be. A typical day at work would consist of a mixture of teaching, lifeguarding, and maintenance of the workplace. In terms of communication, it can be hard to reach certain people at times when you need immediate feedback. Everyone in the workplace was like family.", "pros": null, "cons": null, "position": "Instructor Guard (Former Employee)", "date_created": "June 10, 2019"},
{"id": "1dc2gff3824ft005", "rating": 5.0, "text": "I liked the water on a hot sunny day. But if there was somethings i would change it would be more hours and less taxes most of my paychecks was mostly taken away because of taxes", "pros": "Being by water and seeing people have fun also seeing people happy", "cons": "taxes", "position": "Wading pool attendant (Former Employee)", "date_created": "May 29, 2019"},
{"id": "1dah909h6h45h800", "rating": 3.0, "text": "The staff is great to work with.  The place is quite, however the CEO and acting deputy are not over friendly and there is a lot of back stabbing. If you keep to yourself you will be fine", "pros": null, "cons": null, "position": "Legal Assistant (Current Employee)", "date_created": "May 10, 2019"},
{"id": "1daeq5c57h3ld800", "rating": 4.0, "text": "I worked there on my 2 summer co-ops, fun to work there, have a gym for exercising for free. Unionized and overall a good place to work. Advancement is generally from within.", "pros": "good benefits", "cons": "no overtime", "position": "New Construction and Cuts Inspector- Summer Co-op (Former Employee)", "date_created": "May 9, 2019"},
{"id": "1d9rcf7u8b89b800", "rating": 5.0, "text": "This job has been very challenging if you are not mentally strong. Working as a billing representative is great, however the actual over the phone interactions with customers is very sad. There are alot of bitter people out there that think you’re just a zombie on the phone. It is hard to make friends because the job doesn’t necessarily involve much interaction with co workers. The pay is great, in my opinion pretty reasonable for the amount of work expected.", "pros": "Good pay, consistent schedule", "cons": "Customers over the phone are very inconsiderate making the job mentally demanding", "position": "Bilingual Billing Representative (Current Employee)", "date_created": "May 1, 2019"},
{"id": "1d986dh3ah3kk800", "rating": 3.0, "text": "I like my coworkers but management are making life difficult for everyone. I have been working here for over 9 years and the experience is very stressful.", "pros": null, "cons": null, "position": "Clerk B (Current Employee)", "date_created": "April 24, 2019"},
{"id": "1d93vbgp7h44j800", "rating": 1.0, "text": "Hours are base on senority ...can only miss 7 days for the year ...poor training ......wouldnt recommend  working there......high turn over rate........", "pros": "Variety of shift", "cons": "Low wage...poor management", "position": "Customer Service Representative (Former Employee)", "date_created": "April 22, 2019"},
{"id": "1d7g2kjvh24fb000", "rating": 1.0, "text": "Terrible place to work, very poorly managed. Not fair to their emplyoees, youre just a number. It doesn't matter how hard you work or how lazy you are everyone is treated the same and work ethic is no rewarded.", "pros": null, "cons": null, "position": "Civil Maintanence (Current Employee)", "date_created": "April 2, 2019"},
{"id": "1d7d5tgns1ai5000", "rating": 4.0, "text": "You're given the opportunity to explore your talent and develop them, management is willing to help the employee succeed through training and various initiative", "pros": "Consistently engaging and healthy work environment", "cons": "lack of urgency", "position": "Project Manager (Current Employee)", "date_created": "April 1, 2019"},
{"id": "1d67bpfhnb88r800", "rating": 4.0, "text": "I learnt a lot, made plenty of friends and overall enjoyed my time there. I would work there again. However management needs a major rearrangement, some of the higher ups are fantastic and others don't want to be there or are incompetent. In addition, the City needs to update everything to move on from paper to computers.", "pros": null, "cons": null, "position": "Lifeguard/Instructor (Former Employee)", "date_created": "March 17, 2019"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1d5d5rlvk1bge001", "rating": 5.0, "text": "Great place to work. Great training. I enjoyed working with the staff and management was always helpful. I would recommend working for the city of Winnipeg.", "pros": null, "cons": null, "position": "Customer Service Representative (Former Employee)", "date_created": "March 7, 2019"},
{"id": "1d52h5nrj1fdi000", "rating": 5.0, "text": "The best career\rVery challenging but also extremely rewarding\rDealt with many unique situations as well met many types of individuals.\rAllowed to grow as a person and have fun every day.", "pros": "Exciting work environment", "cons": "danger aspect", "position": "Police Officer (Former Employee)", "date_created": "March 3, 2019"},
{"id": "1d4q7snh31ai3000", "rating": 5.0, "text": "I am very happy to be working within the Parks and Open Space Division, Public Works Department.\rManagement is amazing and very fair.  I can honestly say I love coming to work everyday.", "pros": "so many pros", "cons": "none", "position": "Public Works", "date_created": "February 28, 2019"},
{"id": "1d41dp14taqgj800", "rating": 5.0, "text": "Great team of educated people who are really dedicated to their work. Work is also very important, and for a good cause. Helping to support the diverse and significant plants native to our grasslands", "pros": "Great people, diverse work, important cause.", "cons": null, "position": "Living Prairie Museum (Former Employee)", "date_created": "February 18, 2019"},
{"id": "1d3ih4oaoak8i800", "rating": 4.0, "text": "I was lucky to get job with the city everyone wants to work at city and mostly in summer enjoy outside side views and warm weather in the summer times", "pros": "great pay", "cons": "working outside", "position": "Recreational Technician (Former Employee)", "date_created": "February 12, 2019"},
{"id": "1d2nvup4d1ahm000", "rating": 4.0, "text": "Job as a pool clerk was very chill most days during the summer especially at indoor pools. Outdoor pools were very busy during the summer however, still manageable though", "pros": null, "cons": null, "position": "Clerk (Former Employee)", "date_created": "February 2, 2019"},
{"id": "1d2gasbad0mcl000", "rating": 4.0, "text": "Has its ups and downs like anywhere.  Weather is cold.  Has major crime and poverty issues with the downtown area.  The city and province refuse to acknowledge the problems.", "pros": null, "cons": null, "position": "Police Officer (Former Employee)", "date_created": "January 30, 2019"},
{"id": "1d206ert6ak9i800", "rating": 3.0, "text": "The most enjoyable part of the job is dealing with other employees. Especially when I have good news for them or are able to help them in a timely manner.", "pros": null, "cons": null, "position": "TK Processor (Current Employee)", "date_created": "January 24, 2019"},
{"id": "1d0d25vrc1ahe000", "rating": 1.0, "text": "i really didn't like working for the city. there was a lot of hostility in the environment there, it was like another version of high school. the hours were bad and although you were paid a lot an hour it was probably the worst paying job i had.", "pros": "free swims", "cons": "bullying", "position": "Aquatic Instructor (Former Employee)", "date_created": "January 4, 2019"},
{"id": "1cv9jpnsu1ahv000", "rating": 5.0, "text": "great work placements for summer students. learned a lot for the time with the department. I fully recommend working for the city of Winnipeg public works.", "pros": "flexible hours", "cons": "no overtime", "position": "Technical Assistant (Former Employee)", "date_created": "December 21, 2018"},
{"id": "1cun8qt4m1ah6000", "rating": 4.0, "text": "Employer is good to work for.  Good salaries and benefits.  Culture is good.  Good management.  Really like my area of work.  Has challenges in the workplace.", "pros": "Good Salary & Benefits", "cons": "Not super flexible", "position": "Legal Assistant (Current Employee)", "date_created": "December 14, 2018"},
{"id": "1ctgavesaakis800", "rating": 3.0, "text": "The work place is rampant with racism, sexual misconduct, poor work ethic, and just poor behaviour in general both with people in management as well as fellow employees. There were certainly exceptions and workers with moral values, but they are noticeably outnumbered. \r Besides that, the wage is pretty good for a career that requires little prerequisite education. Lots of training opportunities, work safety is valued.", "pros": null, "cons": null, "position": "Parks and Open Spaces (Former Employee)", "date_created": "November 29, 2018"},
{"id": "1ctc5c74uakbj801", "rating": 3.0, "text": "The staff at the City of Winnipeg are hard working and a pleasure to be with.  \r Lack of staffing resources leads to stress, but this is a government organization after all.  No politicians will try to get elected promising to spend more money on staff.\r Departmental silos prevent the adoption of best practices with distributed IT managers trying to defend their empires.\r Some managers, but not all, treat their technical staff like professionals and value their opinion.", "pros": "good working conditions and benefits.", "cons": "understaffed, stressful.", "position": "Senior Security Architect (Current Employee)", "date_created": "November 27, 2018"},
{"id": "1ct5uj1v6akbj800", "rating": 1.0, "text": "Wouldn't recommend at all. If you are not a City of Winnipeg's partner, spouse, family member, or friend, you will not, REPEAT, not be respected or experience any advancement. Education, hard-work, and experience are ideals not recognized at this organization. Also, systemic favoritism, despite claims of being a \"Respectful Workplace\". \r I remember junior high as being more civilized and being way more respectful. Though, if you are young, connected, and/or male, you will see advancement, no matter what your experience and/or education level is. \r There are some that have to be productive all day, those that can goof off, play on their phones, and have almost continuous parties and/or get togethers on taxpayer time. It's the worst ideal of a clique you would ever see.", "pros": "Money, regular pay, benefits, and not having to have too much interaction with a toxic supervisor", "cons": "System discrimination and an unfair work experience. No rewards for educated, intelligent and hard-working employees. Too top heavy with unqualified individuals.", "position": "I'd rather not (Current Employee)", "date_created": "November 25, 2018"},
{"id": "1cqjscvq7ak6u800", "rating": 5.0, "text": "its good place to work, good wages, benefits and pensions are good. You must have seniority for benefits. Spray mosquitos. Diverse workplace, good hours.", "pros": null, "cons": null, "position": "Utility 3 Labourer (Former Employee)", "date_created": "October 24, 2018"},
{"id": "1cpqv2fp6akaa800", "rating": 3.0, "text": "Was an enjoyable position but could become stressful due to heavy workloads and changes in technology. Extremes in heat or cold could be challenging but its fun to work with the staff. Would do it again but not as a supervisor.", "pros": "Good Benefits", "cons": "Heavy work loads at times", "position": "Foreman/ Pool Eng. (Former Employee)", "date_created": "October 14, 2018"},
{"id": "1cmm73ne3as0oaci", "rating": 5.0, "text": "Great pay and benefits fun place to work.nice to have six weeks holidays.nice to work indoors in the cold winter.room for advancement with training provided to the employees.good working conditions and equipment to make my work go smoothly.", "pros": "Holidays", "cons": "Hard work", "position": "Building services (Current Employee)", "date_created": "September 5, 2018"},
{"id": "1cmlv7nn2as0oeiv", "rating": 5.0, "text": "Great Foreman , Great Work environment, Great Work Mates, Just a Great Experience that I will always be thankful to have had the chance to experience! Thank you : J.V and L.S!! For giving me that opportunity!", "pros": "Everything!", "cons": "Not much chance of advancement if you are old like me..lol..Seriously...No Cons!!!", "position": "Building Servicer 1 (Former Employee)", "date_created": "September 5, 2018"},
{"id": "1cmj7bo07as0o9r5", "rating": 5.0, "text": "Working for the City of Winnipeg Insect Control Branch was one of the best work experiences I've ever had. The staff and management were amazing. It was a very hands-on experience. I absolutely loved it, I have no complaints what-so-ever. I worked the evening shift 2-10, Sunday to Thursday.. For myself, that was an ideal schedule, but there are other options!", "pros": "great pay", "cons": "short breaks, seasonal", "position": "Entomology Lab Technical Assistant (Former Employee)", "date_created": "September 4, 2018"},
{"id": "1clfept431bad2eu", "rating": 4.0, "text": "My short time at the City as a Consultant (on a term role) was a very good experience.  The Public Works Department had the most employees and areas to serve as a HR Consultant and had many challenges.  However the HR and LR teams worked very well together and it made the days less difficult as it can be sometimes in the field of HR.  I would definitely look forward to another opportunity sometime in the future.", "pros": "Good learning environment and opportunities for advancement", "cons": "Very busy & long hours", "position": "Human Resources Consultant (Former Employee)", "date_created": "August 21, 2018"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1ch8dctnd1bgf08d", "rating": 5.0, "text": "I worked at Transit for 27 years. To enjoy the job you have to learn to just drive safe and be friendly. The scheduled time on a route are a guideline. Many factors interfere with being on time. A driver must relax,be composed and friendly under trying circumstances. \rI loved working here. Great coworkers. Loved interaction with 99% of the public. The 1% can create issues. \rGenerally very supportive management. At least when I was there. \rThe training used to be top notch. Friendly,relaxed, supportive. \rSplit shifts take getting used to. But u can make them work to your benefit. \rIf u like to drive and enjoy meeting all sorts of people I say go for it. \rRetire with a good pension and benefits. \rI loved it there.", "pros": "Not stuck in an office. Meet interesting people", "cons": "A very small percentage of the public, u can't please.", "position": "Trainer/Supervisor (Former Employee)", "date_created": "June 30, 2018"},
{"id": "1cfl6u51m1ahi12b", "rating": 2.0, "text": "I worked in a drop in centre with Inner-City youth, but there wasn't much for us to do with them other than supervise. Most of the time the youth are either shooting hoops, watching a movie or just lounging around.", "pros": "Free meals", "cons": "Not much to do.", "position": "Recreational Worker (Former Employee)", "date_created": "June 10, 2018"},
{"id": "1cf6gd29aas169gk", "rating": 3.0, "text": "Working for the City of Winnipeg for 3 summers was great  for the most part. The second summer I received 2 flat tires while driving a patch of gravel road. Having received no previous disciplinary actions the supervisors removed my driving privileges and stripped me of my seniority. \r Receiving a call from the city to go back to work the next year I was reluctant but went ahead with it. Before my first day I was told that i had been let go the previous summer and that i couldn't come back, told I could come back because of a clerical error they had made, then told i was on the \"naughty\" list for something i had previously done but they weren't sure what it was as they had thrown out my file. I was then relocated to a different branch furthest from where I lived.\r The staff overall was very respectful, organized, and hardworking. The supervisors for the most part lacked professionalism, competence, and organizational skills. Some of whom could not read, operate a computer, and would brag of the work they did in the good ol days where they would slash open chemical pesticides into and emptying there contents into ditches while they smoked.", "pros": null, "cons": null, "position": "Utility 3 Operator (Former Employee)", "date_created": "June 4, 2018"},
{"id": "1cf5vk3h1akd4b03", "rating": 4.0, "text": "Besides the fact we are not given breaks, the city has given me many opportunities for different employments and has been incredible. The work hours are very flexible and they are very accommodating.", "pros": null, "cons": null, "position": "Leisure Guide Winnipeg (Former Employee)", "date_created": "June 4, 2018"},
{"id": "1cclno5olakgpffu", "rating": 3.0, "text": "If you can spare a lot of your home life in the first 10 years, then driving here may be for you.\r Alot of holidays and odd hours to begin, until you get senior shifts.", "pros": null, "cons": null, "position": "drivers (Former Employee)", "date_created": "May 4, 2018"},
{"id": "1cabdcd9a1ahi7fg", "rating": 3.0, "text": "my position here had a pretty repetitive routine but i learned a lot and enjoyed my supervisors input and relationship. I used my vehicle to drive to intersections and map the assets.", "pros": null, "cons": null, "position": "Technical Assistant (Former Employee)", "date_created": "April 5, 2018"},
{"id": "1ca8hqomv1ai01iv", "rating": 4.0, "text": "my coworkers are great but the city will not offer my full time job only annual contracts. The work environment is relaxed and easy. There is no lunch room.", "pros": "coworkers", "cons": "no lunch room, contract work", "position": "Desktop Support Technician (Current Employee)", "date_created": "April 4, 2018"},
{"id": "1ca0vpnoaak8r9tq", "rating": 1.0, "text": "Ambitious people or those looking to do the job right, stay away.  Good ol' boys with little education get promoted based upon seniority, not attaining results", "pros": null, "cons": null, "position": "Parks Maintenance Worker (Former Employee)", "date_created": "April 1, 2018"},
{"id": "1c958sn941agm6hk", "rating": 5.0, "text": "I worked for the City of Winnipeg, Parks and Open Spaces department during the summer of 2016, and it was one of the best jobs I have ever held.\r The work was hard and meaningful, and I was able to sit down at the end of the day and realize how proud of my self I was for working as hard as I did. \r The supervisors and foreman at the site, as well as the permanent staff there were all very friendly, and fun to work with. They were understanding about a worker who was either sick or injured, and accommodated them very well. At the end of the year, a couple of the foremen even threw a little going away party for the season and student staff. \r Overall a very fun atmosphere and somewhere I would definitely work again!", "pros": "Lots of physical work, lots of time outside", "cons": "Early mornings.", "position": "Student Labourer (Former Employee)", "date_created": "March 21, 2018"},
{"id": "1c8njj6ciaqjnf96", "rating": 1.0, "text": "Half way decent place to work, the great people move on, some good humans chose to reside, but mostly the incompetent, uneducated  and toxic run the show. \r If your parents do not already rank I would not consider applying. They do not respect diversity or follow the core competencies depending on which department. You can blatantly see the nepotism in the seniority lists.", "pros": null, "cons": null, "position": "winnipeg (Former Employee)", "date_created": "March 16, 2018"},
{"id": "1c7emgv5raqj8ed1", "rating": 5.0, "text": "This was a great place to work. Amazing benefits, there was a littlke bit of tedious work, but it was monday to friday, so the social life was quite easy to have.", "pros": null, "cons": null, "position": "Community Services, Clerk (Current Employee)", "date_created": "February 28, 2018"},
{"id": "1c6c046qeak768rm", "rating": 3.0, "text": "Its a decent first job but there is a lack of communication which has resulted in us showing up on days where classes had been cancelled on more then one occasion, also since we are contract workers we almost never get payed on time.", "pros": "looks good on a resume", "cons": "disorganized", "position": "Skating Instructor (Current Employee)", "date_created": "February 14, 2018"},
{"id": "1c51h4u6cak65clk", "rating": 5.0, "text": "Payroll Timekeeper\r - I enjoy working with numbers, and helping staff with their payroll concerns\r - Everyone here is pleasant to work with\r -The most challenging times would be during payroll year end.  But I enjoy balancing the cheques to be correct!", "pros": "Unionized", "cons": "Union Dues", "position": "Clerk (Current Employee)", "date_created": "January 29, 2018"},
{"id": "1c42quotkaqhid35", "rating": 4.0, "text": "Lots of repetitive and boring work, but very manageable. Could definitely bring some homework or other work to these jobs and get a lot done. Staff and patrons are generally very friendly.", "pros": null, "cons": null, "position": "Clerk (Current Employee)", "date_created": "January 17, 2018"},
{"id": "1c3p0jp5cak9jb9l", "rating": 3.0, "text": "Job taught me new skills but became repetitive. The management was the only part of the job that was not pleasant. Working outside in our city's parks and greenspaces was wonderful.", "pros": "Well paying", "cons": "Outdated Management", "position": "Full-time Gardener (Former Employee)", "date_created": "January 13, 2018"},
{"id": "1c2uc5ln752sram4", "rating": 3.0, "text": "Very frustrating due to the lack of service material for the equipment they purchase. Mainly perform oil changes and running repairs. Most equipment is sent out/vendored to dealers for any major repairs.", "pros": "None", "cons": "Wide variety of equipment and no service manuals for information", "position": "Heavy Equipment Mechanic (Former Employee)", "date_created": "January 3, 2018"},
{"id": "1bvolcu4jak54dk2", "rating": 3.0, "text": "If you like union environment and willing to forego a promotion because you are not high enough on the seniority list then working for the City of Winnipeg is a good place for  you", "pros": null, "cons": null, "position": "Gardener (Former Employee)", "date_created": "November 24, 2017"},
{"id": "1bvfendnnakd0dgg", "rating": 5.0, "text": "I was part of the trim crew so your experience may vary.\r Working for the City's Parks and Open Space division was a very fun and enjoyable experience. the work wasn't too hard, the co-workers I worked with were very friendly and the pay wasn't bad for a student to have.", "pros": "Fun", "cons": "Sometimes boring", "position": "Student Labourer (Former Employee)", "date_created": "November 21, 2017"},
{"id": "1bun0e9j91bg9452", "rating": 4.0, "text": "This was my first time working with concrete as a carpenter , i caught on quickly as the weeks went on. The process and next steps are key to success ful job.", "pros": null, "cons": null, "position": "Form Setter (Former Employee)", "date_created": "November 11, 2017"},
{"id": "1bsvn4f9q1ba70nb", "rating": 4.0, "text": "Management can be unorganized at times. Advancing up the corporate ladder can be difficult. Wages are fair, and time off is given when necessary. overall, a good employer.", "pros": "good wage, hours", "cons": "unorganized", "position": "Recreation Technician (Former Employee)", "date_created": "October 21, 2017"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1bsqn0pii5nene7n", "rating": 5.0, "text": "It was a wonderful experience and made life long friends. Great opportunities and positive work environment. Co-workers were great to work with and great Training provided.", "pros": null, "cons": null, "position": "CSR Clerk A (Former Employee)", "date_created": "October 19, 2017"},
{"id": "1bs43m3g15j689pb", "rating": 4.0, "text": "The City of Winnipeg was a respectful, inclusive workplace that embraced people's differences and shared each person's unique perspective on the job and way of completing it.", "pros": "workplace downtown so easy to get out for lunch", "cons": null, "position": "Occupational Health Nurse (Former Employee)", "date_created": "October 10, 2017"},
{"id": "1bs3prcalas2v9ou", "rating": 5.0, "text": "Work days vary as far as duties however there is always hard work to be done. The people are realistic and friendly, and whatever needs to be done always gets done in a timely manner. The job can be physically demanding at times however you know that's what you sign up for. I've had a great experience working here.", "pros": null, "cons": null, "position": "Labourer (Former Employee)", "date_created": "October 10, 2017"},
{"id": "1brpeqgcfaki8e4u", "rating": 3.0, "text": "I thought it was a fun place to work but mostly because of the people who patronized the pool gym. It was sometimes a challenge to keep busy as there was not too much to do except clean. I was hoping to advance to maintenance position in the city, but found out that there is not cross over hiring internally to a different department  as my department was not the same as the maintenance department. Consequently, when my term was almost done, I took another job with better hours and pay.", "pros": null, "cons": null, "position": "Recreational Technician (Former Employee)", "date_created": "October 6, 2017"},
{"id": "1brnj03g3ak6leht", "rating": 5.0, "text": "flexible hours, great staff at all times, very accommodating to the school and work life basis.  You get to pick your own hours and that's awesome so you can still attend school", "pros": null, "cons": null, "position": "Learn to Skate Instructor (Current Employee)", "date_created": "October 5, 2017"},
{"id": "1brks715iak6icbe", "rating": 4.0, "text": "Its easy and straightforward, however you dont get weekends off. If thats important to you, then this isn't a good job to have. The supervisors are pretty chill too.", "pros": "Easy, relaxing, good pay", "cons": "No weekends, no breaks", "position": "Wading Pool Attendant (Former Employee)", "date_created": "October 4, 2017"},
{"id": "1bqdd01d8aka0dhb", "rating": 5.0, "text": "Loved to work at the wadding pool and got to be outside and interact with the children and i loved every moment of it! \rManagement was good and always supportive!", "pros": null, "cons": null, "position": "Wadding pool (Former Employee)", "date_created": "September 19, 2017"},
{"id": "1bq87f2u65ndmc5n", "rating": 4.0, "text": "For a part-time job, there was very little flexibility for time off, but the people were great and so was the pay. \rI started off as a swimming instructor, then did mostly guarding shifts.", "pros": null, "cons": null, "position": "Instructor/Guard (Former Employee)", "date_created": "September 17, 2017"},
{"id": "1bq5rhnhrak5r8og", "rating": 3.0, "text": "Work place is okay, no bad comments but it is difficult to move up and grow. I feel like the job I had was basically for high school students, which I was.", "pros": null, "cons": null, "position": "Recreational Technician B (Former Employee)", "date_created": "September 16, 2017"},
{"id": "1bq3pvvasbreabe2", "rating": 3.0, "text": "The job was relatively easy, however it was more like a 24/7 job.  We would be emailed, text, called constantly.  It was exhausting having so many people control you.", "pros": null, "cons": null, "position": "Lifeguard/Instructor (Current Employee)", "date_created": "September 15, 2017"},
{"id": "1bp9ko6sraqhib3l", "rating": 5.0, "text": "Driving a transit bus in Winnipeg picking up people at bus stops. Meet alot of people. But hardest part is long hours and drunk rude people. Helping out the citizens of winnipeg.", "pros": null, "cons": null, "position": "Transit Driver (Former Employee)", "date_created": "September 5, 2017"},
{"id": "1bp4redcuak5f94l", "rating": 4.0, "text": "Good job if you like to work with kids and can plan lessions, not the best hours schedule wise but could for some casual work. Hardest part can be dealing with parents.", "pros": "Not long shifts", "cons": "not bi-weekly paid period", "position": "Leisure guide program Instructor (Current Employee)", "date_created": "September 3, 2017"},
{"id": "1bn95am8d5j5aenu", "rating": 3.0, "text": "working with children is always fun with the city doing many activities and learning new things along with them, they are always excited for whats new!!", "pros": "Kids", "cons": "Nothing", "position": "Instructing/Assisting (Former Employee)", "date_created": "August 11, 2017"},
{"id": "1bn1fh56eakcuavd", "rating": 5.0, "text": "Very comfortable working environment. \rStaff make you feel welcome no matter what circumstance. \rTeam players.\rOrganized business.\reasy job tasks.\rvery minimal conflicts with job tasks.", "pros": "Well paid", "cons": "no cons", "position": "Rec Tech C (Former Employee)", "date_created": "August 8, 2017"},
{"id": "1bn1f97e85nd09es", "rating": 4.0, "text": "I have trained employees for the City of Winnipeg, being that I was employed for several summers. Planned crafts, excursions, games and science activities for summer program with children ages 6-12.", "pros": "Great pay", "cons": "Summer only", "position": "Recreation Worker (Former Employee)", "date_created": "August 8, 2017"},
{"id": "1bmbfi1i652sqaeq", "rating": 4.0, "text": "Wish I could go back. \r I was on the research side of the entomology lab, collecting specimens and removing wasp nests, and I loved it. I felt so incredible out in nature, dealing with what I enjoy most--bugs. \r Sadly though, life with the City was not to be. As a seasonal position, you had to reapply every year, and HOPE you got in. I was lucky enough to be there 2 years, but by the third I had another job offer elsewhere and couldn't work there. When I reapplied the year after, they never responded to my application. \r I've heard that things have changed much in the way of management and how the employment structure is set up, meaning different departments and job descriptions. I would definitely go back to this job in a heartbeat-- if only the City would ever mail me back.", "pros": "bugs, research", "cons": "early morning or later in the evening, no 9-5 day here.", "position": "Technical Assistant (Former Employee)", "date_created": "July 30, 2017"},
{"id": "1blvn3gvdas0mfhm", "rating": 5.0, "text": "With every part time task I accept, I feel like I learn more each day.  I enjoy the opportunity to work with people in fun atmospheres.\rHardest part is always learning but that is the challenge.  After that it becomes the best part of taking on part time work while working full time.  \rI have managed having full time work as well as part time work for at least 50% of my career.", "pros": "Learning", "cons": "Making mistakes while learning", "position": "Clerk C (Pay and Benefits Clerk) (Current Employee)", "date_created": "July 26, 2017"},
{"id": "1bldoae6iakdt8q4", "rating": 3.0, "text": "I get that it's the law office for the whole city but these people need to chill out. I was harassed for weeks at this job and then got fired because of it even though I did nothing wrong. \rThe pay was good. If you like snooty people who only care about working then this place will be good for you.", "pros": "good pay", "cons": "stuck up employees", "position": "Legal Administrative Assistant (Former Employee)", "date_created": "July 19, 2017"},
{"id": "1bjia7bk4ak549oa", "rating": 5.0, "text": "Great benefits, learned a lot, gave me trust and independence.  My only issue was I was seasonal and I needed a full time job.  Great job for students.", "pros": "Benefits", "cons": "seasonal", "position": "Labour 2 Utility 2 (Former Employee)", "date_created": "June 26, 2017"},
{"id": "1bhvh2l3rakci9is", "rating": 4.0, "text": "Working for the City of Winnipeg in the aquatics department has taught me a lot about how to be a supervisor with staff in the same general age range as myself. This has been a challenge at times because I want to have healthy working relationships with my coworkers where I am comfortable to see my coworkers outside of work, but also be able to know that when I am at work there is a level of respect and boundaries that cannot be crossed in the workplace. \rThe most enjoyable part of my job is the people that come in the building. At times the patrons can be a challenge, for the most part the children just want to get in the water and have fun, parents want to see there children succeed in swimming lessons, and the seniors just enjoy talking to the staff.", "pros": "Great benefits", "cons": "promotion opportunities", "position": "Instructor/ Guard (Current Employee)", "date_created": "June 6, 2017"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1bhjf9efi1agi1br", "rating": 5.0, "text": "Enjoyed this term. Co-workers as well as management were personable, approachable, and very humane and fair. Would never hesitate to accept another position with these kind, hard-working committed employees.", "pros": null, "cons": null, "position": "Clerk A (Former Employee)", "date_created": "June 1, 2017"},
{"id": "1bf8daad31d132ue", "rating": 5.0, "text": "Nice place to work. Senior Management and co workers are very cooperative, supportive and colloboartive. I loved working here. I would like to work again here.", "pros": null, "cons": null, "position": "Scrum Master/Agile Coach (Current Employee)", "date_created": "May 3, 2017"},
{"id": "1beeor6k01ai66u6", "rating": 4.0, "text": "Had to switch jobs due to health condition, they helped me find another job within my department. Excellent support network and great place to grow professionally.", "pros": "stability and salary", "cons": "can be boring", "position": "Clerk B", "date_created": "April 23, 2017"},
{"id": "1bdv8vgd052tle6s", "rating": 5.0, "text": "The City of Winnipeg runs programs that are not only beneficial to the community, but allow students a wonderful work opportunity. The hours are set and the work is extremely rewarding.", "pros": "Rewarding Work", "cons": "Minimal Hours", "position": "Learn to Skate Instructor (Former Employee)", "date_created": "April 17, 2017"},
{"id": "1bdk258vgaqhhbd9", "rating": 3.0, "text": "Co workers are fantastic, management is nice, however some are a little unprofessional, pay periods are awful, but the work enviroment itself is nice  and welcoming", "pros": null, "cons": null, "position": "Skating Instructor (Former Employee)", "date_created": "April 13, 2017"},
{"id": "1bc8an7n152t39i7", "rating": 5.0, "text": "learned a lot working there, about trees, soil and homeowners' opinions about the city of Winnipeg and its management of the urban forest. Its not too hard of work and the pay is good", "pros": null, "cons": null, "position": "forest health protection inspector (Former Employee)", "date_created": "March 27, 2017"},
{"id": "1bbtsbfd5akh4b39", "rating": 4.0, "text": "The people that work at transit are very good people but the safety issues are the reason for wanting to leave. Other wise it's a great place to be and work for", "pros": null, "cons": null, "position": "Bus Operator (Current Employee)", "date_created": "March 23, 2017"},
{"id": "1bb9o8eq2as0n9lq", "rating": 5.0, "text": "This was a great workplace as you never know what kind of day you are going to have. The kids keep you on your toes, and the community involvement is great. It was a pleasure to work with the city of winnipeg!", "pros": null, "cons": null, "position": "Recreation Technician C (Former Employee)", "date_created": "March 15, 2017"},
{"id": "1b80b8pseas0rd8q", "rating": 5.0, "text": "Working at the wading pool has given me an enjoyable balance of working outside and working with kids. Included in the job was a good amount of cleaning while also learning about how to handle different conflicts among patrons.", "pros": "working outside, using conflict resolution tactics", "cons": "working primarily alone", "position": "Wading Pool Attendant (Current Employee)", "date_created": "February 2, 2017"},
{"id": "1b7r64mm7aqgvd60", "rating": 5.0, "text": "Working with Canadian youth ages 5-12, in mass groups each day of the week, creating and implementing a summer schedule into this summer program really let us show our creativity. all above that, this job I really hate to let go.", "pros": "High wage, fun workplace, mentoring children andmaking life long friends.", "cons": "None", "position": "Youth Worker (Former Employee)", "date_created": "January 31, 2017"},
{"id": "1b6c354dpakgue7j", "rating": 5.0, "text": "After working in Fort McMurray where your work week is nothing but work, it is nice to be employed somewhere that you can go out for lunch with friends and have a 10 minute commute so you can enjoy time with your family. The management encourages team building and friendships within the workplace. Love working here.", "pros": "Teamwork", "cons": "Difficult to get permanent position", "position": "Certified Occupational Health Nurse (Current Employee)", "date_created": "January 13, 2017"},
{"id": "1b5me5fp60mcp2hj", "rating": 4.0, "text": "very productive team members. good environment to work in and well paid. they take care of the employees so well. project are fun to work in and the contractors are really nice.", "pros": null, "cons": null, "position": "Project Administrator", "date_created": "January 4, 2017"},
{"id": "1b50ktukgak64clc", "rating": 3.0, "text": "you can guarantee work everyday without getting sent home early. A typical day starts off by meeting in the yard and prepping trucks before heading out to job site. I learned how to use the roller machine which levels the asphalt when going over top of it. The co workers were all right to work with some were more lazy then others, so we would have to pull there weight.", "pros": "guaranteed 8 hours", "cons": "no overtime/laziness", "position": "Labourer (Current Employee)", "date_created": "December 27, 2016"},
{"id": "1b15736hcak6ve82", "rating": 5.0, "text": "I have been working with the City of Winnipeg for a couple years now. I really enjoy it, fun coworkers. Great management. Great for learning and its a wonderful place to learn basic skills towards other people.", "pros": null, "cons": null, "position": "Wading Pool Attendant (Former Employee)", "date_created": "November 9, 2016"},
{"id": "1atprshdhas28ega", "rating": 5.0, "text": "Ive learned alot of valuable skills working for the city of winnipeg from concrete finishing to joint and seal. Also working with treeas and plant. Ive had alot of safety training and equipment training, and i am much more knowledgeable about the day to day procedures that occure in a construction orriented work place.", "pros": "Lots of overtime", "cons": null, "position": "winnipeg mb (Current Employee)", "date_created": "September 28, 2016"},
{"id": "1atc26i9has20fhe", "rating": 3.0, "text": "Mgmt too top heavy lots of bullying and nothing done hiring old province workers for Mgmt that don't care and don't know anything and don't want to know anything", "pros": "Benefits", "cons": "Lack of people caring", "position": "Ready to retire clerk (Current Employee)", "date_created": "September 23, 2016"},
{"id": "1aptkkistas3b8cd", "rating": 3.0, "text": "Work here could be difficult and, at times, dangerous. A lot of time is  spent underground in stations or in sewers. You are in the heat in the Summer and cold in Winter around machinery and gases. \rHowever, the training and concerns about safety override any real danger. You are working with well trained individuals from crews under you to crews assisting you on jobs. Management is well educated and trained. They tend to work as much as part of the crew as they do management. Should there be problems they were helpful.", "pros": "Good people to work with", "cons": "Dangerous conditions at times", "position": "Foreman (Former Employee)", "date_created": "August 11, 2016"},
{"id": "1apm486tlaqi4996", "rating": 4.0, "text": "There can be complications between coworkers who can not manage to work effectively together, but with consequences of aggressive behaviour only being taken into action once someone is hurt. Miscommunication between employers and employees can cause hassles during the job and develop frustrations, which includes gossip. But with a healthy mindset, being patient and respectful to coworkers and employees, and avoiding conflict, you will be guaranteed a great work experience.", "pros": "Great breaks and understanding of individual's needs", "cons": "Gossip, lack of detail and organization", "position": "Utility 3 (Pesticide Applicator) (Former Employee)", "date_created": "August 8, 2016"},
{"id": "1ap6s81lgak4vfnd", "rating": 3.0, "text": "Working for the city has its perks. There is reimbursable education opportunities, free hearing tests for parks and recreation employees, and paid holidays.", "pros": "Free hearing tests", "cons": "Working on an extremely hot day", "position": "Park Attendant (Former Employee)", "date_created": "August 2, 2016"},
{"id": "1ap6fdlkeak4vdg4", "rating": 5.0, "text": "I worked in the Plant and Equipment division of the City of Winnipeg Transit for almost 39 Years.  The work was interesting, varied, challenging and generally pleasant. The people that I worked with were intelligent, pleasant and Professional in their behavior.", "pros": null, "cons": null, "position": "Maintenance Supervisor (Former Employee)", "date_created": "August 2, 2016"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "1ak29o2q7akbucft", "rating": 5.0, "text": "I'm speaking particularly to their Indigenous Relations Division. It is one of the healthiest work environments I have ever worked at. The team is so supporting for all its members and Indigenous youth who come onboard as work placements and interns.", "pros": "There are many opportunities for advancement", "cons": "You don't gain seniority as an intern", "position": "INDIGENOUS PUBLIC INFORMATION ASSISTANT (Current Employee)", "date_created": "May 30, 2016"},
{"id": "1ah7g5p7p5nb087m", "rating": 4.0, "text": "This was a secure job which paid well.I enjoyed the every day \rthings like dealing with the public, etc. The co-workers were a \rgood bunch .", "pros": null, "cons": null, "position": "Bus Operator (Former Employee)", "date_created": "April 25, 2016"},
{"id": "1ah21nt95ak6rd53", "rating": 4.0, "text": "Friendly working environment, fully accessible training documents.\rGood guidance from the supervisor and nice orientation from HR department on the first day of work.", "pros": "7 hours a day with one- hour lunch break", "cons": "limited parking spots", "position": "Junior Mechanical Plan Examiner (Former Employee)", "date_created": "April 23, 2016"},
{"id": "1afk5a915ak5fcmr", "rating": 5.0, "text": "A productive environment with efficient staff willing to put in their best.  Working with the best brains in the industry. The managers are cordial and willing to help you learn and be productive on the job.", "pros": null, "cons": null, "position": "Senior Business Analyst (Current Employee)", "date_created": "April 5, 2016"},
{"id": "1adjufn41as1ucgc", "rating": 4.0, "text": "Long hours for what you get paid. Good pay & benefits overall. I would recommend working here. Great training good training staff very knowledgeable best part of the job is the variation of schedules   At first it's exhausting mentally(constant attention to hazards on the road) and physically (long days) Great way to know the city of winnipeg", "pros": "Salary Benefits independance", "cons": "Long hours", "position": "Bus Operator (Former Employee)", "date_created": "March 11, 2016"},
{"id": "1a6hjqpreak6aama", "rating": 4.0, "text": "The City of Winnipeg is full of wonderful people willing to help you get far.\r I was a gardener for two years, the people I worked with were wonderful and very helpful. \r Training was difficult to receive and often goes by seniority regardless if you need particular training to do your specific tasks.", "pros": "Wages", "cons": "Training", "position": "Full-time work as a Gardner 1 (Former Employee)", "date_created": "December 14, 2015"},
{"id": "1a66fuuc5aka1fks", "rating": 5.0, "text": "taught me quite alot got alot of experience with equipment and learned alot about my city.Also met alot of people.\ra typical day at work consists of trimming grass and cleaning up the northend. my co workers were alright and respectfull.", "pros": "build seniority", "cons": "long hours", "position": "publick works (Former Employee)", "date_created": "December 10, 2015"},
{"id": "19rvpqeblakbidum", "rating": 5.0, "text": "•\tMet with city’s Workplace consultant to review RTW and human rights. \r•\tAssessed office and vehicle ergonomics and suggested interventions informally as well as with formal written report.\r•\tAttended RTW, work place health and safety and disability meetings \r•\tCompleted multiple jobs demands analyses\r•\tManaged and facilitated return to work for a large caseload.", "pros": null, "cons": null, "position": "Return to Work Coordinator (Former Employee)", "date_created": "August 5, 2015"},
{"id": "19luaccpu5nejckk", "rating": 4.0, "text": "Spent a long time at this employer!!  Great co-workers, didnt seem to get paid a great deal for what was asked of us (public relations, safety, etc), Worst part of job was dealing with management and getting time off when needed..", "pros": null, "cons": null, "position": "Instructor/Guard III (Former Employee)", "date_created": "May 22, 2015"},
{"id": "19l8ao939b822bkv", "rating": 3.0, "text": "Depends on your department opportunity for advances varies drastically across departments, difficult to attain full time, when hired as a seasonal employee", "pros": null, "cons": "sucks for students", "position": "Utility Assistant/Labor (Former Employee)", "date_created": "May 13, 2015"},
{"id": "19kofg01qak9ed99", "rating": 3.0, "text": "If you can get on, keep your mouth shut (in person and online), work hard and enjoy the hefty pay cheque. Dont feel bad if people don't really talk to you, they already have their cliques and don't warm up too easy. Director will demean you", "pros": "good money", "cons": "coworkers are subpar", "position": "Legal Assistant (Former Employee)", "date_created": "May 7, 2015"},
{"id": "19kfog889ak9ecmf", "rating": 5.0, "text": "Good people, good management, good benefits.\r I would suggest this job to all of my friends and to date, it is my best job i've had yet.", "pros": null, "cons": null, "position": "Clerk (Current Employee)", "date_created": "May 4, 2015"},
{"id": "19it2j5pd1bga0cs", "rating": 4.0, "text": "A typical day at my job involves opening the building, checking the AED trauma bags, and testing the pool deck alarms. The management is friendly and are willing to help their employees. The co-workers are always very friendly and make the work place a good place to work. The hard part of the job is when dealing with angry patrons that take their frustration on one person/the facility. For situations like that you have to always remember to keep a friendly face and smile. Also, you must remember to take your time and do your best to help with any problems or situations at hand.", "pros": null, "cons": null, "position": "lifeguard and swimming instructor (Current Employee)", "date_created": "April 14, 2015"},
{"id": "19echtghsas0galc", "rating": 4.0, "text": "I've learned many basic office skills here that may help me towards my future. The most enjoyable part of this job is just being able to do my job and be the best i can be and help out the most i can.", "pros": null, "cons": null, "position": "Clerk A", "date_created": "February 17, 2015"},
{"id": "19dqadpg9ak4g872", "rating": 4.0, "text": "Working in a political office can be both fun and painful at the same time.  \r Fun tended to be when left alone to develop unique advertising for the Councillor as well as developing policy positions to be used both in Council as well as in Committees.  \r The less enjoyable was the 100+ emails and phone calls from residents of the ward, members of the public service, and other individuals received on a daily basis.  All of these contacts have to be responded to in a timely and intelligent manner, regardless of how intelligent or personality challenged they may be.\r Other work involved maintaining the Councillor's website, keeping the office clean, and keeping the Councillor out of trouble.", "pros": "Independent", "cons": "No job security", "position": "Executive & Special Assistant (Former Employee)", "date_created": "February 10, 2015"},
{"id": "1972jfd82ak4g8vd", "rating": 4.0, "text": "a typical day would be go down to the wading pool phone in and walk the pool sweeping and looking for any hazards, then close the drain and  begin to fill pool and watch it, half way through turn on clorine finish filling pool and before opening take water reading and make sure they are good let the kids in an watch them and play with them and make everyone have a great time", "pros": "fun, active get to be around water, good hours", "cons": "weather, boring some days", "position": "Recreational Technician B (Former Employee)", "date_created": "November 18, 2014"},
{"id": "195p9v67uak4gbn1", "rating": 4.0, "text": "The work hours are great but, it is only seasonal. Great benefits as long as you have good weather outside.", "pros": "independent decision making", "cons": "weather", "position": "Wading Pool Attendent (Current Employee)", "date_created": "November 2, 2014"},
{"id": "195m028o4ak8g8o4", "rating": 4.0, "text": "Fast paced, stressful at times, dangerous situations at times", "pros": "Good people", "cons": "no overtime", "position": "Parts Truck Driver (Former Employee)", "date_created": "November 1, 2014"},
{"id": "193rku3t3ak4g83o", "rating": 4.0, "text": "Lots of areas for promotion, variety of opportunities and good work environment", "pros": null, "cons": null, "position": "Technologist 1 (Current Employee)", "date_created": "October 9, 2014"},
{"id": "190ss0i60ak8gaab", "rating": 5.0, "text": "‘Siting in the sun for 8 hours, getting good money watching kids. i learned how to be a mature adult and in force rules when broken. had no co workers, hardest thing is sitting there watching kids.", "pros": "good money", "cons": "long hours", "position": "Waiting Pool Attendant (Former Employee)", "date_created": "September 2, 2014"},
{"id": "1f7p5vgelu1fn800", "rating": 1.0, "text": "Management ignores contracts, laws and their own policies.  Abusive culture backed by management. If you are liked, it is easy to get promoted, if you aren't liked, it won't matter how much training you have or experience, you will be bypassed.  Horrific workplace harassment backed by senior management. ", "pros": null, "cons": null, "position": "Safety Technician (Former Employee)", "date_created": "June 9, 2021"},
{"id": "18lhg71bqak4g9tr", "rating": 5.0, "text": "Simple work and pays well. Great for students with a busy life who love kids.", "pros": "Flexible work schedules", "cons": "Not a lot of hours per week", "position": "Recreation Technician C (Current Employee)", "date_created": "April 14, 2014"},
{"id": "18bvcfcntb84gca4", "rating": 5.0, "text": "Great place to work, great people, it'll be hard for me to leave :( I'll miss everyone", "pros": "amazing people, great pay, benifit", "cons": "Hard to get in if you are not permanent", "position": "Network Support Specialist (Former Employee)", "date_created": "December 16, 2013"},
{"id": "18aihrpikb84gf2p", "rating": 5.0, "text": "Typical Day\rA typical day of work started at 7am with a meeting and discussion of the work to be done, a drive to the site, safety audit, and working until around 1pm at which point we took lunch. After lunch we cleaned up the site and drove back to the yard for around 3pm, or just after, unless there was approved overtime available. \r What I learned\rI learned how to repair roads, sidewalks and curbs. Framing, dismantling, and finishing concrete. I also did asphalt work when required. \r Management \rExcellent management that will always work with you to explain expectations and work through interpersonal conflict between employees respectfully and professionally.\r Co-Workers\rFor the most my co-workers were great, there were a few egos here and there but generally once a positive work ethic was displayed an individual didn't seem to have too many problems at work. \r Hardest part of the job\rId say teaching new employees or employees from other departments how to work in street maintenance while meeting the expectations and time frames was the hardest part of the job.", "pros": "Amazing salary and benefits, straight forward expectations, good people.", "cons": "seasonal indefinitely, short construction season.", "position": "Skilled Labourer (Former Employee)", "date_created": "November 29, 2013"},
{"id": "188564a53ak8ge8c", "rating": 5.0, "text": "The days started early but that was a good thing. People were great to work with, I just wish this position was all year.", "pros": "Good pay, great job.", "cons": "seasonal.", "position": "Technical Assistant (Current Employee)", "date_created": "October 30, 2013"},
{"id": "17p6l5d9mae0gevv", "rating": 5.0, "text": "Great place to work. Not for people who are shy as you have to instruct and lead large groups. ", "pros": null, "cons": null, "position": "Recreational Program Leader (Current Employee)", "date_created": "April 27, 2013"},
{"id": "17nrhm3ssadsgf9i", "rating": 5.0, "text": "Very busy, the way I like it. My co-workers were wonderful. The hardest part of the job was not being able to do things faster for the vendors. The most enjoyable part of the job was my co-workers and also dealing with the vendors.", "pros": "salary, benefits", "cons": null, "position": "Clerk B (Former Employee)", "date_created": "April 10, 2013"},
{"id": "17k9ii7g25dsgbph", "rating": 3.0, "text": "Pros – The people are great - you really get to know the people you work with, and the potlucks are fun. The work is very interesting - you are responsible for quite a bit from the beginning. Hours are standard, which is great since there's no overtimeCons – Bad/inefficient work flow/distribution. There's always a lot of work to be done, but the way it is distributed to employees needs to be fixed. There was a whole month that I basically had nothing to do, and days were pretty boring because you have very limited internet access", "pros": null, "cons": null, "position": "Parks Coordinator", "date_created": "February 25, 2013"},
{"id": "17gh9v4feae0gcv3", "rating": 5.0, "text": "The days go by extremely fast and everyone makes the work environment enjoyable. You will learn a lot of amazing new things about the city as well!", "pros": null, "cons": null, "position": "Technical Assistant (Former Employee)", "date_created": "January 9, 2013"},
{"id": "17gdt15rd5dogf67", "rating": 5.0, "text": "hardest thing was getting in and out of a work truck 100 times a day, drilling numerous holes in concrete. Learned basic concrete forming and finishing. overall good place to work.", "pros": null, "cons": null, "position": "Skilled Laborer (Student) (Former Employee)", "date_created": "January 8, 2013"},
{"id": "17aliljeoadsgf5q", "rating": 5.0, "text": "A lot of problem solving, Leading teams thru improvement plans.", "pros": null, "cons": null, "position": "Aquatics Coordinator (Current Employee)", "date_created": "October 29, 2012"},
{"id": "17ae1po12adsg87i", "rating": 5.0, "text": "Hard workers good wage good benefits new equipment that didnt break down", "pros": "good benefits", "cons": "long hours", "position": "retired (Former Employee)", "date_created": "October 26, 2012"},
{"id": "17acepcvo5dog9db", "rating": 5.0, "text": "This was a great job working with the Children in Downtown/ Westend Winnipeg.", "pros": null, "cons": null, "position": "Teachers Assistant (Former Employee)", "date_created": "October 25, 2012"},
{"id": "179tkiu124e0geng", "rating": 5.0, "text": "Many experiences,work load,steps taken,order of supervision,assistance,knowledge.", "pros": "union", "cons": "security", "position": "Maintenance Supervisor (Current Employee)", "date_created": "October 19, 2012"},
{"id": "179ik4impadsgaqj", "rating": 3.0, "text": "It takes a special type of person to do this type of work. I enjoyed the people, management, educational opportunities, training, and i've learned much in my short time there.Being at a later stage in life, the shift work took a little getting used to, but I personally struggled with the emotional side of the job. As you can imagine it can be heart-wrenching to hear some of the calls.The coworkers were always supportive and management there to help guide you through. I consider my time there a success, but the position just didn't suit my empathetic, compassionate side.", "pros": "wonderful people, helping community, great leadership", "cons": "emotionally challenging, shift work", "position": "911/Police Call Taker (Former Employee)", "date_created": "October 15, 2012"},
{"id": "1781g4sq2adsgedh", "rating": 4.0, "text": "A typical day is 10am to 6 pm. This depends on the weather. A lot of the work is by yourself. THe hardest part of the job is sitting idle when nobody else is around. Management is strict in order to keep up the city's reputation. THe most enjoyable part of the job is working with kids.", "pros": null, "cons": null, "position": "Recreation (Current Employee)", "date_created": "September 26, 2012"},
{"id": "172vft6g1ae0gbvd", "rating": 5.0, "text": "Start the day off by going in planning which area we where going to be canvasing and making sure we had enough flyers and the proper recording materials in the vehicle, then notify the management when leaving and area. Do a call in every two hours for check up and make sure everything was okay had a hour lunch. the co workers were amazing we made a good team, which made us stronger and better to face the public and answer any questions or inquires about animal services.", "pros": null, "cons": null, "position": "Bylaw Support Worker (Former Employee)", "date_created": "July 25, 2012"}
]