[
{"id": "1dqo1ctci833k802", "rating": 4.0, "text": "The work was very fast and easy, I learned a lot of safety tips around handling dangerous equipment. The employees were nice and easy to get along with.", "pros": null, "cons": null, "position": "Grass Cutter (Former Employee)", "date_created": "November 27, 2019"},
{"id": "1g25lbeiss7j2801", "rating": 1.0, "text": "City Council is dysfunctional and embarrassing. Makes it difficult to work there and make improvements. Senior staff were supportive by city council lack intelligence.", "pros": null, "cons": null, "position": "Senior Manager, Finance (Current Employee)", "date_created": "May 3, 2022"},
{"id": "1e2562kjfo8tt802", "rating": 5.0, "text": "The position I had, we drive around town cutting grass.  On rainy days, we wait for the rain to stop, and if it doesn't then we get to go home.  Most of the job is sitting, but the times we do work, it's pretty tough.", "pros": null, "cons": null, "position": "Labourer (Former Employee)", "date_created": "February 27, 2020"},
{"id": "1dlo21v3q52t3801", "rating": 1.0, "text": "it sucks the pay sucks and the managers suck the hardest part of the day is driving around all day when its raining or when the grass doesn't grow because they'd rather let you waste gas driving around then send you home", "pros": null, "cons": null, "position": "Grass Cutter (Former Employee)", "date_created": "September 26, 2019"},
{"id": "1dije05k95ncu801", "rating": 5.0, "text": "I thoroughly enjoyed my career with one of the best employers in the Province.    I was a team player so worked well with staff and newly elected Mayor & Council working through 14 civic elections in my career.   Loved every day of my job...loved meeting people and helping to make this City an even better place in which to live.", "pros": null, "cons": null, "position": "ADMINISTRATIVE ASSISTANT (Former Employee)", "date_created": "August 18, 2019"},
{"id": "1d90f7aql0mch000", "rating": 4.0, "text": "You get to know work closely with most of the team. Very open to swapping shifts with other team members. Often busy but quiet periods come up. Overall a decent summer job.", "pros": null, "cons": null, "position": "Lifeguard (Former Employee)", "date_created": "April 21, 2019"},
{"id": "1ccegceor5nd0909", "rating": 4.0, "text": "The overall rating is 4 points. Whereas, this is commendable for the overall objective of the institution.. The Job work is always in tandem with the rules and regulations lay down by the council .Compensation benefits is regular, and there is a long time security of Job with inclusive sound management. Diversity of culture is the bedrock of the city.", "pros": "1% bonus pay on every Canadian Day", "cons": "No work No pay", "position": "Traffic Control Officer (Former Employee)", "date_created": "May 1, 2018"},
{"id": "1bmkga5uh52t19bm", "rating": 4.0, "text": "Excellent company, great work environment with good pension and salary   40 hour work week with variable overtime\rSmall staff of eight people\rManagement issues", "pros": "Free lunch", "cons": "Nil", "position": "Wastewater Technician (Current Employee)", "date_created": "August 3, 2017"}
]