[
{"id": "1cr2ovh8qak72800", "rating": 4.0, "text": "ok typical day, learned alot about the city how it works, managed the street drainage office for 18 yrs., then compined with other office, hardest thing was to communicate well with other employees since I was the new person, 2yrs, was unpleasant at times, why I retired", "pros": null, "cons": null, "date_created": "October 30, 2018"},
{"id": "1g8a4k12ckf14801", "rating": 5.0, "text": "The city of Victoria has been there for me for 17yrs and I appreciate everything they have done for me. I suffered a heart attack in  April 2020 and the staff has reached out to  me after I was out of the hospital wit a get well card signed by staff in my department of street cleaning and it meant the world to me. Caring and always thoughtful,  looking forward to returning to work very soon. Thanks again to all that are involved with my return to my post.", "pros": "Gr8t staff...", "cons": "Early hours...", "date_created": "July 18, 2022"},
{"id": "1fuvqkp9v2m6t002", "rating": 2.0, "text": "Management has far too many layers and procedure to function as a supportive happy environment. Little attention is paid to actual work and rather the shuffling of papers to make the organization logical and happy ", "pros": "wages", "cons": "management", "date_created": "March 25, 2022"},
{"id": "1fup9cdu33oa0000", "rating": 5.0, "text": "Feel like I'm part of a family. Everyone is helpful in all area's. It's nice to speak to someone who always has a smile on their face, regardless of the department.", "pros": null, "cons": null, "date_created": "March 22, 2022"},
{"id": "1etcidjhvu1lf800", "rating": 2.0, "text": "I worked in the parks department and my supervisor was very ugly and went back on a word all the time and did not treat people with respect at all I was absolutely miserable I managed to make it 10 months before I finally found another job and left I've been at my new job for 90 days and this company treats me way better than the city ever did the only reason to stay with the city is if you're looking for a solid 401K that you don't have to worry your stress about", "pros": "401k, Monday thru Friday schedule", "cons": "Terrible management", "date_created": "January 31, 2021"},
{"id": "1ehb7mk5er4qu800", "rating": 1.0, "text": "The worst job I’ve ever had. Hard work for penny’s. I thought it was going to be a great opportunity but it was the total opposite. The new employee’s don’t get enough support from senior workers. ", "pros": null, "cons": null, "date_created": "September 3, 2020"},
{"id": "1efljb9gi3245000", "rating": 5.0, "text": "Hardest thing about city work is showing up. If you can do that, be reliable and not be a whiner, its easy. Once you show up  ON TIME! , you can spend the rest of your day trying to figure out ow to leave early.", "pros": "Great pension. Great benefits. Show up. Do your job. Get paid. Easy.", "cons": "Whining co workers that have never actually had a real job.", "date_created": "August 13, 2020"},
{"id": "1ea82ppkpqmag800", "rating": 3.0, "text": "Was in keeping sewer lines going, tieing on to new service's Ect. 3 to 4 crew's. People same # of crew's worked in keeping fresh water line's going. Also had meter installer's & locater's. Not cutting sewer lines with sewer water running off your hard hat, Ect. How long ago did we go to the moon. Could be cross trained very easy, because all operator's in crew's making same $. At the time director of public works had to much time & head over H.R. Was a know somebody job", "pros": null, "cons": null, "date_created": "June 7, 2020"},
{"id": "1dsoahov1q59n802", "rating": 1.0, "text": "Back stabbing liars cliques boring waste time lazy management is incompetent untrained and utterly stupid work 3.5 hours at most on garbage truck and get paid for eight hours", "pros": null, "cons": null, "date_created": "December 22, 2019"},
{"id": "1dbsgg87q24g9000", "rating": 1.0, "text": "low wages, no raises, can not keep up with cost if living, benefit to employees cost is high compared to wages,  employees are not rewarded for working through hurricane and sending family away, but mainly can not make a living working for City of Victoria,  someone need to look at cost to hire someone and how many employees are leaving or have left in pass 5 to 6 years.", "pros": "decent place to work", "cons": "very low wages", "date_created": "May 27, 2019"},
{"id": "1ctdt8msib8bo800", "rating": 4.0, "text": "Elected officials have a diverse array of responsibilities and fluid workdays.  We advanced many important initiatives in city building, a satisfying experience.  Workdays could be long or short, depending on meeting schedules. Learned much about issues not previously part of my expertise.  Well managed organization and good cooperation among Mayor and Council ensured a positive culture.", "pros": "Making a difference", "cons": "Job insecurity", "date_created": "November 28, 2018"},
{"id": "1cr5blo0cas2a800", "rating": 5.0, "text": "clock in, set up bathrooms and unlock fields, watch games and help any customers that had questions, clean up the stadium once games are done, lock up and clock out. I loved this job because I was usually working independently or with someone at the same level, rarely with a supervisor. It was all about sports which was also something I loved.", "pros": "lots of down time, work with sports", "cons": "pick up and throw away trash", "date_created": "October 31, 2018"},
{"id": "1ckv63m56b88iad0", "rating": 4.0, "text": "Many wonderful people, great opportunities for learning, good money.\rThe staff are friendly and engaged and care about the work they do. The most enjoyable part of the job is meeting new people and learning about different departments.", "pros": null, "cons": null, "date_created": "August 15, 2018"},
{"id": "1cgl8ugeh1aho2mp", "rating": 4.0, "text": "Its like having a second family who will always have your back.  It can be very rewarding and at times very stressful depending on the call at the time.", "pros": null, "cons": null, "date_created": "June 22, 2018"},
{"id": "1c7n2g7a0aqja9di", "rating": 3.0, "text": "job is overall of just do not make enough money to provide for my family. We work 12 hr shift in all kinds of weather. The other crew members I get along with well and enjoy them. I just need to make more money.", "pros": null, "cons": null, "date_created": "March 3, 2018"},
{"id": "1c4q3q0atbrdn87c", "rating": 5.0, "text": "great place to work if you can get full time . everyone seams to be after that full time spot . management was on the ball good people to work with for sure.", "pros": "people", "cons": "long time to get full time", "date_created": "January 26, 2018"}
]