[
{"id": "1di0bkpt28318802", "rating": 4.0, "text": "Fantastic Learning and Development program available to all employees.\rVery supportive culture and encouragement to develop professionally.\rFlexibility program to support Work Life balance.", "pros": null, "cons": null, "date_created": "August 11, 2019"},
{"id": "1e23ergd0q51i803", "rating": 1.0, "text": "Horrible culture, no diversity in \"male dominated departments\".  Room to advance if you're best friends with the boss only.  Everyone talks behind everyone back, no one cares about the harrassment policy, nor will most supervisors enforce it.  If you speak up you get pushed out.  Don't work there.", "pros": null, "cons": null, "date_created": "February 27, 2020"},
{"id": "1d0v2tdnc5n8u800", "rating": 1.0, "text": "Worked for organization for over 10+ years. Culture became progressively more and more toxic. Outdated x-style management including constantly reminding employees of their pay rate while justifying disrespectful treatment; lack of communication directly from the top (example: decrease in number of directors without informing employees); CONSTANT reorganization; job descriptions written/re-written for specific person wanted within a role (vs. searching for best candidate); maintaining budget by purposely leaving jobs unfilled for 6 months to 2 years and belittling the many employees who brought up practices internally while turning around and claiming it was unknown years later to media; saviour-like attitude towards jobs being filled by \"someone amazing from out-of-territory\" vs. understanding that investing in employee growth is invaluable; general bullying and ostrasizing of employees who are not liked personally by management; managers across multiple Divisions who are encouraged to bring up employees challenges (vs. working with their strengths); nepotistic hiring practices (relations/friends of Mayor, Counsellors, City Manager and Directors often land in cushy jobs with no prior education or experience); played-out personal revenge tactics by City Counsellors in newspapers including scape-goating of last City Manager; inability of Counsellors and Senior Management to design, deliver and execute plans in a timely manner; committees made-up of \"old boys clubs\" with sexist overtones. Many Counsellors are looking to pad their resumes to apply to Territorial politics and are - more...", "pros": "Good benefits and pay; may form great relationships while in survival-mode", "cons": "Everything else", "date_created": "January 11, 2019"},
{"id": "1ctlfhgasaqj6800", "rating": 5.0, "text": "I learned some new computer systems.  Everyone was very helpful in my learning curve when I first started.   There is an excellent benefits program.  There is a effort to make it a stress free work environment.  I very much enjoyed the atmosphere, people and the work in this position.", "pros": null, "cons": null, "date_created": "December 1, 2018"},
{"id": "1cs9olethbrf8800", "rating": 5.0, "text": "I liked my coworkers, supervisors and bosses while working here. It was a pretty straightforward job that had a handful of tasks that were required to do daily, weekly etc.", "pros": "get to meet interesting people from all over the world", "cons": "hours can be a bit long", "date_created": "November 14, 2018"},
{"id": "1ca6q2pja1ai04hu", "rating": 5.0, "text": "My time with the City has been great. Being a casual employee has given me the opportunity to work in several different departments and learn the inner workings of each.", "pros": null, "cons": null, "date_created": "April 3, 2018"},
{"id": "1c5krcf2m836fb28", "rating": 4.0, "text": "Well structured volunteer program. Relaxed vibe which can be good or bad (depending). Could offer more opportunities to give volunteers qualifications and help get into the events industry.", "pros": "Free food and free entry to events", "cons": "Not much in actual qualifications", "date_created": "February 6, 2018"},
{"id": "17jib9rhradsgb1k", "rating": 5.0, "text": "Collecting and receiving parking tickets from customers and over the phone.Collecting property taxes from clients in person and over the phone.Collecting payments for business licenses being issued.Receive payment for Utilities bill from clients.Answer general phone enquires.", "pros": null, "cons": null, "date_created": "February 16, 2013"}
]