[
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1fojbr7d6o2dt802", "rating": 5.0, "text": "Great place to work at where employees are looked after and listened to.I found it was a safe environment where the management listened to any safety concerns brought up.Great work life balance where time off for me wasn't an issue as I have family living at long distances.", "pros": null, "cons": null, "date_created": "January 4, 2022"},
{"id": "1fmr24ovhosij800", "rating": 2.0, "text": "At the city it is the 80/20 rule. 80% are dead beats and 20% are doing good work. Many should be let go but have a union defending them. Over 19 years with water services I finally had enough. I would have more in my pension if I invested it on my own and with company matching. The best part is the 4 day or 3 day work week. But if you are motivated and a go getter and want to make lots of money this is not the place for you. It is for people with no motivation who want to survive only and not looking for better opportunities. Job security seems to be the motivation at the city. ", "pros": "4 day work week", "cons": "Mentally draining, nothing makes sense, just show up and do what you are told and you will be fine.", "date_created": "December 13, 2021"},
{"id": "1fmq557alsa1l801", "rating": 5.0, "text": "Union based.  Advancement is primarily based on senority and not how hard you work.  Vacation days are also allotted by senority; don't pick popular dates to take off. No political stress.  Do your job and you'll be fine.  Salary is high compared to private sector.  Great organization to work for.", "pros": "Salary, compressed work week, schedule, benefits", "cons": "Advancement, vacation dates", "date_created": "December 13, 2021"},
{"id": "1fmffdtdcosm7800", "rating": 2.0, "text": "Suitable job for students and people looking part time work. This position does not get the benefits other government employees receive. Wage is not great either", "pros": "Part time", "cons": "Poor managment", "date_created": "December 9, 2021"},
{"id": "1fm8g8h0su37a802", "rating": 4.0, "text": "Perfect work, life balance, supportive management , professional development opportunities are some of the reason I enjoy working at the City of Calgary", "pros": null, "cons": null, "date_created": "December 6, 2021"},
{"id": "1fkpu18s7n59v800", "rating": 4.0, "text": "If you get into a good team, it's golden. If not, there can be very traumatizing, back-biting, dysfunctional behaviours to deal with from either bosses, coworkers or both. The policies for respectful workplace and the like, exist... the trouble is that in some groups, they are not enforced. There are sweetheart deals for some staff but not for others. It is stressful that some situations are not fair, makes you feel vulnerable and that is unproductive. Some mgmt should not be in their positions due to no education or life experience for the responsibility. They tend to hire leaders from within the ranks of staff and then don't require them to seek further education. If you get a leader who has integrity, cares and is true to his/her word, then you will thrive and enjoy your career. It's unfortunate, but the \"good\" leaders are few and far between. Just when you think you have the worst leader... and get a different job, you find out that this one is even worse. The benefits are ok, not super. I like that there's a pension. I have benefitted from working from home since the pandemic. The best thing is the ability to move around by applying for different positions. Hopefully, you can find something/someone to your liking. I am a technology worker, indoors, working 37.5 hours/wk. There are flexible work options and now Telework options. ", "pros": "Telework/working from home, flexible work schedules, pension, stat hol", "cons": "Few good leaders/bosses. Weak union. Very weak HR dept.", "date_created": "November 18, 2021"},
{"id": "1fkld3nmqnpu2801", "rating": 1.0, "text": "It's a very clique environmet. they keep hiring lots of regulars for the elections wich leads to a very unwelcoming \"team\". The process taught during training were changed last min by the PDRO Wich also made me uncomfortable as the reason sited for the change was \"too much cleaning and sanitizing\". The city give a time frame for payment then completely changes it weeks later and blames the delays on Canada Post. All around a truly miserable expirience. If you worked an elections Canada elections and think this would be similar you would be wrong. Stick to elections work with standards consistently followed. ", "pros": "None", "cons": "The people", "date_created": "November 16, 2021"},
{"id": "1fkiab51fo2bl802", "rating": 3.0, "text": "No strong leadership. People pay more attention to office politics.Good work-life balance.Passive-agressive attitude.Good benefits, defined benefit pension.", "pros": null, "cons": null, "date_created": "November 15, 2021"},
{"id": "1fkej1ss331id000", "rating": 2.0, "text": "Too many managers and far too many promoted beyond their ability but no accountability. Just riding it out until they hit their full pension. Also, instead of solving tough problems the mgmt likes doing re-orgs. ", "pros": "Working to better Calgary is fun", "cons": "Too many lazy people hiding from accountability", "date_created": "November 14, 2021"},
{"id": "1fk1ik3r0o2eu800", "rating": 3.0, "text": "Good work life balance and benefits.  Lots of turn over in our department for years.  Re organization ongoing for the last 5 years. Same staff levels as 6 years ago with much more work to do. Not as enjoyable place to work as it was years ago. ", "pros": "Benefits, pension", "cons": "constant middle management changes, unhappy retirees, burn out good staff.", "date_created": "November 8, 2021"},
{"id": "1fk0msve5o22h800", "rating": 4.0, "text": "It's a nice place if you're looking for some job security but not too much advancement when it comes to career. I love the 4 day work week which gives more work/life balance.", "pros": "4 day work week", "cons": "none or very slow advancement", "date_created": "November 8, 2021"},
{"id": "1fjitf6j5o2h4800", "rating": 4.0, "text": "The City of Calgary is a nice place to work.  Competitive salary, and reasonable work hours.  The union is a bit ridiculous and heavily favors the tenured.", "pros": null, "cons": null, "date_created": "November 3, 2021"},
{"id": "1fj957kg3oc9d802", "rating": 2.0, "text": "Poor wage compared to real world. Pension is constantly increasing in cost and decreasing in value. Follow collective agreements, safety, code of conduct and policies when it suits them, otherwise they look the other way. Management has too many layers and considers the fundamental reason of existence (provide service to citizens) a nuisance to their “projects”. ", "pros": "Compressed work week (if you can get it)", "cons": "Safety perceived, but not achieved. Zero management accountability", "date_created": "October 30, 2021"},
{"id": "1fiqis196t4qn802", "rating": 1.0, "text": "Everyone wants to work for the City but don't be fooled. They oversell the benefits but are not competitive at all. If they want to build a great City they should start with their own organization. There is very little diversity at non-elected senior levels. Policies are outdated and focus on controlling what can go wrong and giving the minimal required versus assuming the best in people. No paid sick days for the first 3 months, then only 90% pay if you are sick (even for exempt positions), low end of the scale for vacation and have to wait until the next calendar year to get your accrued vacation. Working from home is a non-starter because management doesn't trust that employees are working.Senior leaders think they are smarter than everyone else and give very little autonomy. You are told what to do--ideas, work, and policies flow from the top down. Managers and above think and say they are better than people below them doing the work. Leaders take no accountability. blame others, and look for mistakes to point out leading to low collaboration and fear.Processes and technology are out dated and instead of focusing on a great employee experience leaders and HR want to micromanage, assume you will take advantage of the system, and track everything you do with constant reminders that IT is tracking activity on computers.", "pros": "Work Life Balance, Little risk of being fired after probationary period", "cons": "No paid sick days for first 3 months, no vacation days within the first year, No autonomy., No flexibility, hierarchical, lead with fear", "date_created": "October 24, 2021"},
{"id": "1ff39kc76308t002", "rating": 5.0, "text": "They say they care about their employees and they mean it. Very supportive group while I was there. I’m happy that I had the chance to work there - it was an excellent place to learn and grow as a professional. ", "pros": "Excellent people, interesting work, very collaborative and a sense we are all on the same team", "cons": "None that I can think of.", "date_created": "September 8, 2021"},
{"id": "1fc009nocpib1800", "rating": 3.0, "text": "Stay outta the drama. Politics. Gossip. Go to work. Do your job. Mind your business. Good jobs at the city. You sometimes work alone. Can do what you please as long as work is completed. ", "pros": "4 day work week. 9.5 hours. No micro managing.", "cons": "Drama. Gossip. Rumors. Favoritism.", "date_created": "July 31, 2021"},
{"id": "1fb5i7m3ro2fo802", "rating": 1.0, "text": "Very toxic work environment. So many levels of unnecessary management. Reckless spending. Management clueless as to what was going on around them..", "pros": "Pay", "cons": "Management", "date_created": "July 21, 2021"},
{"id": "1fa3skpffnpjo800", "rating": 1.0, "text": "in my opinion, there are several ways can make a company developing successfully. First, the ower has to hire right person. all staff has to be honest, talent, and hard worker.   Secontly, the ower respect staff, pay staff fairlly. For daycare,the ower and all the teacher have to respect family and love all the children, especially, give the children excellent  traning and care.    ", "pros": "the ower can offer free lunch to staff that would make all of staff happy, but it is not very important.", "cons": "If the ower pay for it that is OK.", "date_created": "July 8, 2021"},
{"id": "1f3t9s1srnpee800", "rating": 4.0, "text": "Good place.Lot to learn.DiversifiedInclusionSlow & steadyGovernment regulations and policies.Structured.Remote some times.Travel within the city.", "pros": null, "cons": null, "date_created": "April 22, 2021"},
{"id": "1f39f9va7o2a8800", "rating": 5.0, "text": "So many options once you are employed Great benefits All supplies and uniforms providedInterview is by at least two peopleCheck Calgary.ca for Interview tips and Guidelines.", "pros": null, "cons": null, "date_created": "April 14, 2021"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1f2ng77oh309g000", "rating": 3.0, "text": "Benefits and pay are fair and there’s a health and wellness program. I enjoy the work as you can see direct positive impacts in the community. There are many layers of management with leads, coordinators, managers. It’s extremely stressful to have work constantly downloaded through attrition and departmental business changes. There’s a lack of accountability and change impact review as well as out of touch upper management. ", "pros": "Benefits and decent pay", "cons": "Problematic management", "date_created": "April 7, 2021"},
{"id": "1f287qhq0o1nq800", "rating": 4.0, "text": "Staff and Managers are supportive and understanding. It is a fast pace job with many departments and programs so, need to take time and meet people and learn about their positions.", "pros": null, "cons": null, "date_created": "April 1, 2021"},
{"id": "1f00jntdg306b000", "rating": 2.0, "text": "Decent pay and work-life balance, but limited career advancement opportunities. Stigma of lazy environment. The farther from center the worse harassment and favoritism problems. Big words about commitment and values, but no second thought when it's time for lay offs. Satisfaction surveys are only collected in good times, and no exit polls for departing employees. Dysfunctional union that restricts flex work, caps salaries below market, and does not represent employee. ", "pros": "Annual salary increase, decent pension plan.", "cons": "Questionable job security, no/weak bonuses, health & dental compensations not reviewed for ages, union spoiled many benefits.", "date_created": "March 5, 2021"},
{"id": "1eul1ug9fo15p800", "rating": 3.0, "text": "Pleased to have the opertinity to apply myself, learm and grown, meet knew challanges and build solid working relationships with skilled staff. Provid building ownership a level of compliance through contractor inspection and compliance checks. Understand the importance of keeping all facility dwg's current and availible", "pros": "Serving municipality with my experoenced skill set snd leadership", "cons": "Ño overtime, lay-off cycled with drastic price with WCS Commodity", "date_created": "February 16, 2021"},
{"id": "1ets3688co29g800", "rating": 5.0, "text": "its a great place to work i wish im working there again. And very competitive wages and lots of benefits if you become a regular employee of the city ", "pros": null, "cons": null, "date_created": "February 6, 2021"},
{"id": "1esbe7r25npoh800", "rating": 5.0, "text": "The City is an Excellent place to work especially for long term employment. Used to have a better pension plan structure and better retirement payout etc", "pros": "Competitive salary scale", "cons": "At times politicized by manageable", "date_created": "January 18, 2021"},
{"id": "1ekpjp9slo1eg800", "rating": 5.0, "text": "amazing people who are supportive and helpful in achieving personal success, excellent work culture, management works with you rather than over you.over all an amazing place to work and set up a future.", "pros": null, "cons": null, "date_created": "October 16, 2020"},
{"id": "1ehtigvm3rct1800", "rating": 5.0, "text": "I have been employed with The City of Calgary for over 11 years and have found them a very good employer with the opportunity to progress and also change career   The offer very competitive wages for a municipality and work/life balance is something they pride themselves on.  The City is a very sort after place to work in Calgary.   The team I work on is busy and high achieving, but we still have fun in our day to day tasks and going to work each day is always enjoyable.", "pros": "Good benefits, stable work environment", "cons": "Union structure can sometimes be restrictive", "date_created": "September 10, 2020"},
{"id": "1eec9at0vrdkn800", "rating": 4.0, "text": "Lots of support from the experienced members of the team. A learning, collaborative, and supportive environment. Emphasis on ensuring that employees are able to enjoy their lives outside of work.", "pros": null, "cons": null, "date_created": "July 28, 2020"},
{"id": "1eahlch45ppar800", "rating": 4.0, "text": "Ok place to work\r Good pay\r Not stable \rNo benefits until full time\r Need another job while working here as no guarantees of hours per week\r  Favouritism plays a role when covering shifts unfortunately", "pros": null, "cons": null, "date_created": "June 11, 2020"},
{"id": "1ea5vf366rd71800", "rating": 5.0, "text": "Out f all the places i have work the City of Calgary was by far the best. From the minute i walked in everyone was so welcoming and friendly. they where also there to to help you no matter what.", "pros": null, "cons": null, "date_created": "June 6, 2020"},
{"id": "1e9qvplnep02r800", "rating": 4.0, "text": "Overall my experiences working with the City of Calgary were positive and rewarding. A great place for advancement and encourage you to always upgrade your skill set with education options. Great work life balance", "pros": null, "cons": null, "date_created": "June 2, 2020"},
{"id": "1e9oo7amuobul800", "rating": 5.0, "text": "great place, passionate people, good structure, very busy, culture depends on the unit and the leadership, overall very good environment, good opportunities for movement.", "pros": null, "cons": null, "date_created": "June 1, 2020"},
{"id": "1e9on6hogoldp800", "rating": 1.0, "text": "A typical day at work: face to face processing of various payments for: admissions, program registrations, bookings and rentals as well as facilitate financial transactions, prepare bank deposits and complete cash reconciliations.\rAdministrate: program registrations, facility bookings, fee assistance, employee fitness passes and personal training package purchases\rRespond to customer inquiries, requests and complaints regarding Centre services.", "pros": null, "cons": null, "date_created": "June 1, 2020"},
{"id": "1e9bisi3mprvi800", "rating": 4.0, "text": "I had a great few weeks volunteering with the City of Calgary helping run and organize events for summer day camps at Nose Hill Park. The program was smoothly run, and the other volunteers were friendly.", "pros": null, "cons": null, "date_created": "May 27, 2020"},
{"id": "1e9698uco31dp000", "rating": 4.0, "text": "Very little in terms of out of work stuff going on in the office, but the office is relaxed and good to work at. Low pressure environmkent, typically get in and go about your work. Expected to get work done, but not pushed to work all the time, so breaks are expected.", "pros": null, "cons": null, "date_created": "May 25, 2020"},
{"id": "1e8gfv1bdq1ta800", "rating": 4.0, "text": "For the most part it's a good place to work. You could do a lot worse. I'll remain as long as they'll have me. Will start you as seasonal employee and you can expect a layoff in late fall.", "pros": null, "cons": null, "date_created": "May 16, 2020"},
{"id": "1e7l94ssgov18800", "rating": 5.0, "text": "•\tWorked during city-wide municipal vote for the 2026 Winter Olympics, Provincial Election, and the Federal Election.\r•\tHelped organize community center voting stations, election advertisements, as well as assessing the votes and releasing the results at the end of the day\r•\tHelped assist seniors and individuals with mobility restrictions", "pros": null, "cons": null, "date_created": "May 6, 2020"},
{"id": "1e7l88jtmnh4t800", "rating": 4.0, "text": "Steady employment with opportunities in the future. Excellent pension and benefits. Safety positive environment. Good place to develop new skills and learn.", "pros": null, "cons": null, "date_created": "May 6, 2020"},
{"id": "1e6i2dngkobda800", "rating": 5.0, "text": "All staff are hardworking, and put our customers first. Work/life balance is excellent.  Management build relationships with staff and easily approachable. Best job I've ever had.", "pros": null, "cons": null, "date_created": "April 22, 2020"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1e5r82vqdpqri800", "rating": 1.0, "text": "Roads is Managed and maintained by a toxic work environment, fear of management and corporate Bullying throughout department. Human Resources department is completely complicit with the culture..", "pros": null, "cons": null, "date_created": "April 13, 2020"},
{"id": "1e5de33dlprtr803", "rating": 5.0, "text": "There are a lot of team event to help you know the organization well and familiarize you to the work. The team also gave me flexibility to work on what I proposed.", "pros": null, "cons": null, "date_created": "April 8, 2020"},
{"id": "1e5aqreriqbq7802", "rating": 5.0, "text": "Even with the challenges related to the projects managed by City employees, the environment is light and very collaborative. It is really driven by the 4 C's : Collaboration, Character, Commitment and Competency.", "pros": null, "cons": null, "date_created": "April 7, 2020"},
{"id": "1e4oh79cppq4i803", "rating": 4.0, "text": "good working place. high productivity. challenging projects. good culture. recommended to professionals, engineers and technicians. people work there are knowledgeable.", "pros": null, "cons": null, "date_created": "March 31, 2020"},
{"id": "1e46kg3fnppae803", "rating": 5.0, "text": "A rewarding experience with many career choices of a corporation with over 17,000 employees. Several unions, careers and levels for personal advancement.", "pros": null, "cons": null, "date_created": "March 24, 2020"},
{"id": "1e3ni4jrbqb4s803", "rating": 4.0, "text": "As a volunteer, my responsibilities were to support the counselors in delivering programming to upwards of 30 campers. While I held a volunteer position at the time, I acquired the skills needed to apply for and enjoy a successful part-time career working with other non-profit camps in the Kananaskis.Trying to decide if the camp life is for you? Try volunteering first!", "pros": null, "cons": null, "date_created": "March 18, 2020"},
{"id": "1e3i7t22o1cv5003", "rating": 5.0, "text": "I worked for a day as a DRO for the provincial elections. The environment was fast paced and the co-workers were very helpful. If I get a chance, I would love to go back and work again.", "pros": null, "cons": null, "date_created": "March 16, 2020"},
{"id": "1e2c94hrvf0me801", "rating": 3.0, "text": "Good place to work but the politics can ruin a guy if he can’t brush it off  The workers are awesome and do their best  Management is questionable to say the least", "pros": null, "cons": null, "date_created": "March 1, 2020"},
{"id": "1e1lpulr1olq3803", "rating": 5.0, "text": "I always enjoyed going to work in the morning, I never had a bad day at work. The experiences I got to be involved in, really gave me great life experience. The employees within the workplace were like no other, they were always there to help and always fun to work with. The culture within the workplace is like nothing I have ever experienced, it felt like one big family.", "pros": null, "cons": null, "date_created": "February 22, 2020"},
{"id": "1e14rsolq32l3000", "rating": 1.0, "text": "The Waste and Recycling Services section is unfair and unequal to employees, showing blatant favouritism to some and a consistent history of antagonism and contempt for others. An employee can expect harassment and personal attacks by management as well as a toxic work environment. The job gave an overall feeling of \"us\" against \"them\" (being the city).", "pros": null, "cons": null, "date_created": "February 15, 2020"},
{"id": "1e0ttmqjfobeq803", "rating": 5.0, "text": "Enjoy a great career in multiple settings and roles as you can move around and do whatever you choose in many different fields.  When you work with the City of Calgary, you will be very pleased.", "pros": null, "cons": null, "date_created": "February 12, 2020"},
{"id": "1e0r05bh2ol2h804", "rating": 4.0, "text": "Job satisfaction depends on a variety of factors such as who your supervisor/superior is, who your coworkers are, the type of program you work in, and the budget of the program.", "pros": null, "cons": null, "date_created": "February 11, 2020"},
{"id": "1e08l6bubobp3803", "rating": 3.0, "text": "When you're at the bottom of the totem pole when working for the city, it takes YEARS to move up. I was stuck on the night shift for 7 years with no light at the end of the tunnel. I have young children and working nights became too much on my body and family. They have wonderful benefits and holiday/sick time and paid pretty good though!", "pros": null, "cons": null, "date_created": "February 4, 2020"},
{"id": "1e04chpu6bmlf802", "rating": 4.0, "text": "You get to work with different individuals that either can help you progress or will throw you under the bus. I enjoyed meeting different types of customers. I enjoyed the different types of events that were done within the facility. You also had the opportunity to work outdoors in the summer. There was in-house training within the City. Courses that you could take to better yourself.", "pros": null, "cons": null, "date_created": "February 2, 2020"},
{"id": "1e01a2ipgosop803", "rating": 4.0, "text": "It was fun to work for the city, met good people. The pay was good and fair. I also learned lots of new things. Only thing that was bad was some of the management.", "pros": "Pay", "cons": "Management", "date_created": "February 1, 2020"},
{"id": "1dvrjjr1sbmlg802", "rating": 3.0, "text": "Stable secure job. Wages seem good at first, but deductions for all your benefits reduces take home pay in a big way. Good people overall, but troublemakers never get fired. Worked there 27 years. The pension is nice. Be aware, this is a sewage treatment plant! A very large sewage treatment plant.", "pros": null, "cons": null, "date_created": "January 30, 2020"},
{"id": "1dvkb1pvnblvk803", "rating": 4.0, "text": "The Parks Department is a large and diverse workplace within the City of Calgary, with many divisions working together to help create and more a more enjoyable experience with Calgary's green spaces.\rEveryday is a new challenge, which makes the job more challenging and rewarding.", "pros": null, "cons": null, "date_created": "January 27, 2020"},
{"id": "1dv1psqpbf0sh800", "rating": 4.0, "text": "This job is not fun, however it does keep you occupied. For a 60year old man, it is perfect. You have to be organized, if you don't you will be going back to the same house 4 times. You have to have a great personality to overcome negativity , People are usually nice to you. However you will meet the odd one. Great exercise.", "pros": null, "cons": null, "date_created": "January 20, 2020"},
{"id": "1dum9i2jcq4fc802", "rating": 1.0, "text": "Applied with 3000 people. 40 made the cut 2 years after. 4 months of very hard training. The worse time of my life. Discriminated against, harrassed, bullied, abused, dehumanized, ridiculed in front of every other coworker. Anyway, I believe it is a great job if you get on the right side of the bunch bullies.", "pros": null, "cons": null, "date_created": "January 15, 2020"},
{"id": "1dtk01h6khad1803", "rating": 5.0, "text": "My workplace culture is great where I get to learn and enjoy working with my co-workers. My work let me spend time with my family as well therefore my work life balance is good. My manager listens to my problems if I have any and provide me solutions as well.", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1drtmhkcono8q803", "rating": 3.0, "text": "I left the city due to personal reasons and mainly additional stress that I was facing that time. While I wanted to join back, with more experience and jollifications, I am not given an opportunity so for.", "pros": null, "cons": null, "date_created": "December 12, 2019"},
{"id": "1dr489pboov54803", "rating": 4.0, "text": "Working for the City was great. Many opportunities to apply in different business units from within. \rThey offered wellness sessions from meditation, yoga, nutrition, gyms and riding bicycles by the river! Ever hear of a company doing that? The services offered to employees really blossomed over the years and the City is a great place to work.", "pros": null, "cons": null, "date_created": "December 2, 2019"},
{"id": "1dqqmf9no1d0f003", "rating": 4.0, "text": "Counted ballots and learned the whole election process, it was a great learning experience for a young kid like me, I would recommend it to anyone who wants to learn about the election process and see how things work in Calgary.", "pros": null, "cons": null, "date_created": "November 28, 2019"},
{"id": "1dqks1vdb1d0b001", "rating": 5.0, "text": "Hired to work on an ERP Implementation and continued to work there after the implementation to support the ERP system. Great people to work with in a relaxed environment.", "pros": null, "cons": null, "date_created": "November 26, 2019"},
{"id": "1dqfdgcgn1d06003", "rating": 5.0, "text": "I have been with the city for 17 years and wouldn't change a day of it.  The ability to learn new positions and the security of knowing I can provide for my family", "pros": null, "cons": null, "date_created": "November 24, 2019"},
{"id": "1dpqp3858b87i801", "rating": 5.0, "text": "City of Calgary is an excellent place to work, if you are ambitious and hard working this is a place to gain appreciation and visibility.\rI loved and enjoyed working at the City of Calgary.", "pros": null, "cons": null, "date_created": "November 16, 2019"},
{"id": "1dpea3rskb86v802", "rating": 5.0, "text": "Was the best place I've worked in a long time, my TEAM was amazing!!\rWhat more can I say The Bonny Brook Waste Water Treatment Plant was a GREAT place to work.", "pros": null, "cons": null, "date_created": "November 11, 2019"},
{"id": "1dp0vqh8rb838802", "rating": 5.0, "text": "I enjoyed working at the City very much.  I received the job through Mark Staffing.  I worked for a couple of the Councillors during the summer of 2015 and I worked on Reception for the remaining time I was there.  Everyone was very nice and supportive.", "pros": null, "cons": null, "date_created": "November 6, 2019"},
{"id": "1docfh9kobre0800", "rating": 1.0, "text": "The city of Calgary was a good summer job for a short period of time. But the work environment was bad at best. You have no ability to advance in the industry and no changes could be made to staff due to the union.", "pros": null, "cons": null, "date_created": "October 29, 2019"},
{"id": "1do821bdbbrdt801", "rating": 3.0, "text": "Flexible work environment, great coworkers, culture is ok. management is good, but not stable as most people are contract and waiting to be permanent,", "pros": null, "cons": null, "date_created": "October 27, 2019"},
{"id": "1dnqu5tufbrdo802", "rating": 4.0, "text": "City of CALGARY is a nice place to work. The people are helpful and friendly. There are always possibilities towards job advancement. If you work hard you will reap from your efforts. Communication between departments could be improved. I would recommend the City of CALGARY!", "pros": null, "cons": null, "date_created": "October 22, 2019"},
{"id": "1dnb0ui21b89q802", "rating": 4.0, "text": "A continuous learning environment with the ability to advance easily. Peers are light-hearted but serious when needed. Kept busy by having different challenges daily", "pros": null, "cons": null, "date_created": "October 16, 2019"},
{"id": "1dnaig3aqb82a802", "rating": 4.0, "text": "Enjoyable working with culturally diverse crew doing paint and fence repair for seniors who qualified for this City service. The pay at the time was minimum wage.", "pros": null, "cons": null, "date_created": "October 16, 2019"},
{"id": "1dmd9gchib85m800", "rating": 4.0, "text": "I strongly suggest to anyone to work for the city of Calgary because it’s relaxed and there’s a wide verity of work to be done and the benefits are ok and the pay is good", "pros": null, "cons": null, "date_created": "October 5, 2019"},
{"id": "1dls2ujhvb88n807", "rating": 5.0, "text": "First of all my boss was the very best in terms of leadership and caring. As in most corporate environments there are colleagues who just don’t know how to get along with others and this decreases the value of your job. The pay and benefits are the great as is the work/life balance. The city is different in that City Counsellors and top brass pass down  orders and directives that are almost impossible for a manager to complete. The managers then look like the bad guys when passing directives to the average workers. Again this is the difficulty working in a corporate atmosphere. Otherwise the City takes care of their employees well, especially at the Fire Department.", "pros": "Advancement, Learning, Benefits", "cons": "Corporate environment", "date_created": "September 28, 2019"},
{"id": "1dliprv2fbrcg800", "rating": 4.0, "text": "It was very hands off and I was free to manage my own work days. \r There was a lot of office politics though. The pay was fair and there was nice to have every 3rd Friday off.", "pros": null, "cons": null, "date_created": "September 24, 2019"},
{"id": "1dl0mfjac1d01005", "rating": 3.0, "text": "Had lots of fun leading activities and interacting with children and collaborating with other staff.  It helped me learn how to time manage more efficiently.", "pros": null, "cons": null, "date_created": "September 17, 2019"},
{"id": "1dkm0svo71fdi000", "rating": 3.0, "text": "Great place to work with a diverse culture and good leadership values. The organization values growth and development and supports mental health. The compensation is good.", "pros": null, "cons": null, "date_created": "September 13, 2019"},
{"id": "1dkeseg4352sv802", "rating": 3.0, "text": "This is a great career and employer but with cut backs and other outside influences looming it has become a very unknown and unstable future type workplace. Very stressful not knowing what is happening day to day and no potential to advance or increase income! After contract negotiations the workers were left to live with ZERO increases for 3 years while inflation and the cost of living in Calgary continuously skyrockets out of control! It's Impossible to survive or even buy a home on a single income for a ridiculous amount of work and health and safety concerns with no wage increases while a loaf of bread is $4.00 and higher ! Totally unacceptable from a city employer from my vast career experiences!", "pros": null, "cons": null, "date_created": "September 10, 2019"},
{"id": "1dkeoj20dbre6801", "rating": 5.0, "text": "It has been a pleasure working for the city and serving citizens with the information they are looking for.  \rThe management team is very supportive and helps understanding the procedures in a friendly manner. I am looking forward for full time position.", "pros": null, "cons": null, "date_created": "September 10, 2019"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1dkelocg4b85q800", "rating": 5.0, "text": "Awesome place, no complaints thus far. Pay and venerate great, hours are great and friendly environment. Only downfall is you get laid off the first year so you start from zero again after recall.", "pros": null, "cons": null, "date_created": "September 10, 2019"},
{"id": "1dkbprmc7b898804", "rating": 4.0, "text": "Great seasonal job\rDays consisted of...\r-First Aid (when needed)\r-Statistics\r-Provide information to park visitors\r-Small scale maintenance\r-Park safety advocate\ras well as anything else required of me while on shift", "pros": null, "cons": null, "date_created": "September 9, 2019"},
{"id": "1dkbck382b85o802", "rating": 5.0, "text": "Great place to work but very hard to secure a full time position. The call center staff is was always very nice and expressed a willingness to help the newbies. Managers were available and professional", "pros": null, "cons": null, "date_created": "September 9, 2019"},
{"id": "1dj9ogk9ph3h7805", "rating": 5.0, "text": "The corporations among different team such as web server team, web service team, database team, security and development and support team are good. We have a scrum meeting every day.", "pros": null, "cons": null, "date_created": "August 27, 2019"},
{"id": "1dj2tdgfs1d0n002", "rating": 5.0, "text": "Regular work in daytime never overtime\rSupervisor is so nice and friendly,we respected each other\rWorking at\" The City\" looks like stay at  a international family\rI like to attend \"Stampeded breakfast party\" and \"Christmas Party\"\rWish go back working the City again!!!", "pros": null, "cons": null, "date_created": "August 24, 2019"},
{"id": "1dj0hu8241d0b000", "rating": 1.0, "text": "I decided to write a review but I am only giving them a one star to help bring their ratings to a more realistic level. They should be about maybe a three. This is one of those places if they do not like you and they want an excuse to get rid of you, then they will. I worked hard for them and they let me go. I don't hold grudges against them. This review is to just tell you to be very careful. Good luck", "pros": null, "cons": null, "date_created": "August 23, 2019"},
{"id": "1divp51eub8bm800", "rating": 5.0, "text": "Great to work with.Wish the budget had not slashed my position. Felt appreciated and valued even as a contractor from day 1. Staff made me feel at home and the workplace was positive and intelligent.", "pros": null, "cons": null, "date_created": "August 23, 2019"},
{"id": "1ditpbf8j1d0b002", "rating": 5.0, "text": "Productive and very respectful place to work\rIt was a contract job thats why I left after completing my contract term.\rat Calgary Police Services very friendly and Respectful environment, Energetic Organisation. Love to work there.", "pros": null, "cons": null, "date_created": "August 22, 2019"},
{"id": "1dir311c1brcm801", "rating": 1.0, "text": "A typical day at work: - abuse abuse abuse\rWhat I learned - NEVER work for the city of calgary\rManagement - THEY are the ABUSERS\rWorkplace Culture - There is none\rThe hardest part of the job - NOT walking out\rthe most enjoyable part of the job - absolutey zero", "pros": "None", "cons": "Nasty people", "date_created": "August 21, 2019"},
{"id": "1diot11p61d0b000", "rating": 5.0, "text": "Great environment, good culture and ethics, great location, teams. ( I have to add 150 words to go to the next level with indeed, does not make sense )", "pros": null, "cons": null, "date_created": "August 20, 2019"},
{"id": "1dilb1a2ub87p800", "rating": 4.0, "text": "Very chill, coworkers are super friendly and have a great atmosphere altogether. Working with them has taught me a lot about customer service, and I am very grateful for that.", "pros": "Flexible Hours", "cons": null, "date_created": "August 19, 2019"},
{"id": "1dibohfsq1fdk000", "rating": 4.0, "text": "Good experience for any age. Good skills, good people. Leadership was fun and enjoyable. Advancement opportunities. Able to make lifelong connections and relationships.", "pros": null, "cons": null, "date_created": "August 15, 2019"},
{"id": "1di16heqhb879800", "rating": 4.0, "text": "Under the city of Calgary's employment, I gained an amount of practical experience that I hope will aid in my future career. Working with children is always difficult but due to the organization and maturity of my coworkers the issues that came up were swiftly dealt with. I was given enough freedom to perform my duties and complete my program fully.", "pros": "Organization", "cons": "Approachability", "date_created": "August 11, 2019"},
{"id": "1dglg5n7i5j5a800", "rating": 2.0, "text": "You're just a number\rManagement is stuck in their own ways, have a more efficient idea? Don't bother. If it makes sense, they don't like you\rPolitics and different personalities and can become quite bs after awhile. Started off as a great place... That's where I'll end it", "pros": null, "cons": null, "date_created": "July 25, 2019"},
{"id": "1dfmgi1k91d0h000", "rating": 1.0, "text": "The work was great but management don’t have a clue on how to operate and deal with people always trying jack the personal around especially in winter don’t train the for the shortage of equipment operators always training more operators on loaders when they have tons but in graders which is shortage is the last to get trained on.", "pros": "Benefits", "cons": "No life and health balance they don’t care about that", "date_created": "July 13, 2019"},
{"id": "1dfm5ocqs1d11001", "rating": 4.0, "text": "Worked as an aquatics fitness instructor. Hourly pay was good, no benefits and no job security (contract work without a written contract so you could be replaced at any time). Taught morning classes on weekend; and evening classes during the week around another full time job (not at City). I was replaced permanently when I asked for a week off to visit family out of town and this ended up ending my employment with the City. No loyalty from employer even though I received Employee of the Month just 2 weeks prior and was awarded a Subway Samdwich gift card (that was never activated by the City) so I couldn’t even use it and when I asked for a replacement, all I got was runaround.", "pros": "Good pay", "cons": "You are easily replaceable", "date_created": "July 13, 2019"},
{"id": "1dfh6jc4324eh000", "rating": 5.0, "text": "Work life balance was amazing here as was the compensation. Lots of opportunities to move around and move up. Job security and access to great benefits.", "pros": null, "cons": null, "date_created": "July 11, 2019"},
{"id": "1dfh259391d11000", "rating": 4.0, "text": "Worked with great people. Positive and challenging work environment.", "pros": "Great benefits and working hours", "cons": "Part time because of union - hard to get additional hours", "date_created": "July 11, 2019"},
{"id": "1ddqsbgt35nde800", "rating": 5.0, "text": "The Day start with the Free coffee.checking the ticketing queue and scheduling the tickets. Calling the end users. \r Discussing with the senior team mates for possible solutions", "pros": "weekly meetings and updates", "cons": "Temporary job", "date_created": "June 20, 2019"},
{"id": "1dcnqcfeubrep800", "rating": 4.0, "text": "able to gain experience and move through different experience.  multiple online learning courses that enhance your employment experience. For someone who is driven, it is a great place to work.", "pros": null, "cons": null, "date_created": "June 6, 2019"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1dcn9omblbrep800", "rating": 5.0, "text": "A typical day at work in The City of Calgary is wonderful because there you are treated with dignity. Everybody share values and are committed to do their best. That's why The City of Calgary is a great place to work.", "pros": "Good payment", "cons": "short contracts", "date_created": "June 6, 2019"},
{"id": "1dci2er9gb8ah800", "rating": 5.0, "text": "Personally the best job I have had to date. This is a perfect place to learn new skills and become part of a life long community. The most enjoyable part of this job is being part of recreation and creating a safe and fun environment for children, youth and adults. The hardest part of this job is terminating your position after being part of this lovely community. This job is for people who work hard, have a passion for kids and aquatics, are open to learning and growing as a individual.", "pros": null, "cons": null, "date_created": "June 4, 2019"},
{"id": "1dbvnvsasbrd2800", "rating": 3.0, "text": "The best part about the City - work life balance. With 7.75 hours a day, you get to take every alternate Fridays off. Work culture is very self motivated i.e. if you are motivated enough to get something done then you take the initiative to get it done without the possibility of extra pay. As with every other job there are pluses and minuses. Talk to as many people as you can and create your own opinion about working for the City.", "pros": "Great work security and work life balance", "cons": "limited opportunities for career advancement", "date_created": "May 28, 2019"},
{"id": "1dbir2cj2b80n800", "rating": 5.0, "text": "A bit bureaucratic at times\rA bit hierarchal \rInteresting work\rManagement lead by example\rProcess could be refined for quicker turnaround \rColleagues are nice", "pros": null, "cons": null, "date_created": "May 23, 2019"},
{"id": "1dbins6n924g9000", "rating": 5.0, "text": "The City of Calgary is a very good government to work for. They pay well, offer great work-life balance, solid benefits, pension plan. Managers lead by example, are strong communicators.\r Most employees work there in order to retire, not for the challenge or opportunity to grow, and are not very ambitious", "pros": "Comfy job", "cons": "Not overly challenging", "date_created": "May 23, 2019"},
{"id": "1dbg7to050mtp001", "rating": 4.0, "text": "Excellent colleagues, environments, open to new ways of doing things and they care about their staff improving and gaining experience as well as training.\r The culture is diverse.\r The clients are very demanding on the operations side of things and they can be the worst part of the job.", "pros": "Exposure and experience to different things", "cons": "Client expectations are difficult to manage, promotions are not that easy to come by", "date_created": "May 22, 2019"},
{"id": "1db62jh8e1d03000", "rating": 5.0, "text": "Really enjoyed my time that day and as am retired now can work  days prior to election and hours as required. Willing to train for any position available. I am experienced in pressure situations and love the challenge.", "pros": null, "cons": null, "date_created": "May 18, 2019"},
{"id": "1darv0e1hbre6800", "rating": 5.0, "text": "I took a 6 month contract at the City of Calgary with the hopes of getting a full time position. Unfortunately there were funding cut backs and my position was not extended. The most frustrating part of working for the City is room for advancement. I applied for several jobs that I had all of the qualifications for, but never even received one interview. This was due to seniority within the union at the City.", "pros": "Good work/life balance", "cons": "Very hard to advance", "date_created": "May 14, 2019"},
{"id": "1da5nio9tb85g800", "rating": 5.0, "text": "Inclusive and positive work environment. A typical day at work for me would be to arrive at 8:09 and work on work that has been assigned to me throughout the day. Some of the work I do is research on projects, which I do enjoy.", "pros": null, "cons": null, "date_created": "May 5, 2019"},
{"id": "1d9l8cic3b85g801", "rating": 5.0, "text": "I enjoyed working for the Calgary Fire Department for 25 years. I retired as a Captain in charge of a firehall with men and equipment to serve the citizens of Calgary.\rLearned many skills in firefighting, saving lives and protecting property and the environment.\rThe hardest part was dealing with people injured and how their lives were affected. \rThe most enjoyable part was seeing how happy people were when we helped them", "pros": "Saving lives, helping people", "cons": null, "date_created": "April 29, 2019"},
{"id": "1d98km84vb81e800", "rating": 4.0, "text": "Would be a great place to work if you start young and don't mind working your way up the hierarchy. Until you reach seniority you can expect to be put on any rout or traded to any department or given any job for many years. I was told by other employees the best way to succeed there is to do exactly as you're told but don't do any extra because no one will notice or care if they do. That was very good advice.", "pros": "good pay and benifits, schedual rotation gives you 4 days off in a row, community clean ups were fun", "cons": "union culture hard to get used to, some sketchy people work there", "date_created": "April 24, 2019"},
{"id": "1d7l3vipn1fdv000", "rating": 4.0, "text": "Everything is great about working for the City of Calgary Transit department except for the daily 12 hour split shifts, the monotony of the work, the hazards of traffic, and the threat of assault from hostile customers. It requires great dedication, collaboration with other operators to accommodate shift changes, ability to deal with difficult customers and to operate a bus and stay on schedule, safely and with courtesy at all times, on various routes, sometimes more than two or three different routes per day, regardless of conditions of the roadway and the customer, including drunken and belligerent customers. Other than all that, it pays very well, has great medical benefits, a good pension, union support, and free uniform including shoes, socks, winter coat and gloves.", "pros": "Excellent pay", "cons": "High stress, daily 12 hour split shifts", "date_created": "April 4, 2019"},
{"id": "1d74dqtdg5nd1800", "rating": 1.0, "text": "The all successful business understand how important productivity is in a work environment .an employees productivity  can help the company in utilize", "pros": "Yes", "cons": "12 Hour", "date_created": "March 29, 2019"},
{"id": "1d6ncamvf1d13000", "rating": 1.0, "text": "Top heavy management, too many managers who micro manager to few union staff. Management are arrogant and vile.\r Lots of bullying and intimidation. To cut property taxes, cut management. Those who do the work are union people. MME's do nothing except micro manage.", "pros": "None", "cons": "Managment", "date_created": "March 24, 2019"},
{"id": "1d6bk5sl3b894800", "rating": 2.0, "text": "I worked here for years and have nothing bad too say except they dont treat you well if you have personal issues and need time off and come back. They bullied me out of the company", "pros": null, "cons": null, "date_created": "March 19, 2019"},
{"id": "1d5stu7ro5n8j800", "rating": 3.0, "text": "i worked for parks out of high school its a very good place to get your foot in the door with the city of Calgary being seasonal for some people works but at the time it didn't for me but luckily there is lots of things to do for them", "pros": null, "cons": null, "date_created": "March 13, 2019"},
{"id": "1d5sqv9kkb88r800", "rating": 2.0, "text": "I've had a few jobs with the City of Calgary. There are many different walks of life that work there which is wonderful but can also be challenging. There are a lot of expectations with very little support at times, and I found that there were some managers that didn't have the skills to be there. Overall, good starting point for young adults to integrate into the working world, but not a long time career choice", "pros": null, "cons": null, "date_created": "March 13, 2019"},
{"id": "1d5p9nnv61fdv000", "rating": 2.0, "text": "Some great people work here but there is no accountability for management. There is poor communication among teams and there is a genuine fear for people's jobs. Would not recommend working here.", "pros": null, "cons": null, "date_created": "March 12, 2019"},
{"id": "1d3t43bk4b88j800", "rating": 3.0, "text": "Nothing very fascinating but people are nice. Still stick with old technology. They try to grow but things are slow. Good benifits and salary. Free parking at some locations is good.", "pros": null, "cons": null, "date_created": "February 17, 2019"},
{"id": "1d34jsmvb1fdu000", "rating": 4.0, "text": "Good place to work, great people. I have worked in several business units across the organization. Each time I work in a new business unit I am pleased with the welcome I recieve.", "pros": null, "cons": null, "date_created": "February 7, 2019"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1d2b3f81db860800", "rating": 5.0, "text": "Very fast paced position dealing with children between the age of 3-14(typically). Good teamwork is required and supervision is helpful to improve the day camps and sports camps.", "pros": "Fun environment", "cons": "Long preperation", "date_created": "January 28, 2019"},
{"id": "1d20rcv4cb85t800", "rating": 5.0, "text": "Great summer internship, you get to meet a lot of other students, the work load and responsibilities are quite fair. The City offers a really good mentorship program where you can be matched with a mentor that can help your career.", "pros": null, "cons": null, "date_created": "January 24, 2019"},
{"id": "1d1ouph88brdk800", "rating": 5.0, "text": "Great people to work with, awesome learning and advancement opportunities.  Possible education assistance.  Great benefits and hours of work.  Very flexible.", "pros": "Flexibility, benefits, hours, pay, people", "cons": "Commute to some locations", "date_created": "January 21, 2019"},
{"id": "1d0i2cake1d1f000", "rating": 3.0, "text": "Interesting and complex work, good people and lots of diverse jobs.\r Leadership is hit or miss depending on the department and division you are in.\r Great pay and benefits", "pros": null, "cons": null, "date_created": "January 6, 2019"},
{"id": "1csah2vlm837c800", "rating": 5.0, "text": "This was a summer student position; however, I was given a ton of support in pursuing matters I was interested in. I had the best managers imaginable.", "pros": null, "cons": null, "date_created": "November 14, 2018"},
{"id": "1cpffro05b828800", "rating": 1.0, "text": "Loved working for the city of Calgary but I would like to work closer to home . Loved interacting with customers and employees that I work with We were tonight’s split shifts early mornings drove eight hours a day had to deal with situations of bad weather and good weather Train to drive an Airbrake vehicle", "pros": "Bus pass", "cons": "A lot of assaults on bus drivers", "date_created": "October 10, 2018"},
{"id": "1cp8juekmb868800", "rating": 4.0, "text": "Everyday I am thankful that I was hired by The City of Calgary.  They treat you always with dignity and respect and it was the first legal position I have had in 26 years that I feel like a valued member of a team.", "pros": null, "cons": null, "date_created": "October 7, 2018"},
{"id": "1cobirc45brdq800", "rating": 3.0, "text": "This is a great place for work life balance. Management seems to be lacking communication and leadership. Career opportunities are largely based upon education and not skill.", "pros": "good pay and pension", "cons": "lots of politics", "date_created": "September 26, 2018"},
{"id": "1co710o3sb85v800", "rating": 4.0, "text": "Good working environment and opportunity for advancement.\rLocation is advantageous, good accessibility. Parking is also available. Lunch room is avaialble", "pros": "relaxing atmosphere", "cons": "none", "date_created": "September 24, 2018"},
{"id": "1cnl3131hb81ke4d", "rating": 5.0, "text": "Very fun,productive and supporting work environment. So far it was my favorite place to work. I learned a whole lot of new things with all the training sessions that i feel like ill definitely use in the future.", "pros": "free lunches", "cons": "short hrs", "date_created": "September 17, 2018"},
{"id": "1cm3s9ggjb816d3a", "rating": 4.0, "text": "Great place to work at without many of the perks that come with a job in the private sector, such as Christmas parties. Good internal training program.", "pros": null, "cons": null, "date_created": "August 29, 2018"},
{"id": "1cm0uloslbrd3dsq", "rating": 5.0, "text": "they where very understanding with the work hours and they had great management and I loved the shoes there highly recommend working there because of the friendly attitude and welcoming atmosphere", "pros": null, "cons": null, "date_created": "August 28, 2018"},
{"id": "1clidd5epb812fjg", "rating": 5.0, "text": "I worked there for 27 years and enjoyed every day of it. I was given opportunities  to learn new skills and get job advancement . I found the management was fair and we all had equal opportunity for positions as they became available.", "pros": "4 day work week", "cons": "none", "date_created": "August 22, 2018"},
{"id": "1cktl5pm6b84ke4p", "rating": 3.0, "text": "Working with children can be stressful, and the management does not always seem to know what they are doing, but the coworkers are nice and it's good to have an outside job", "pros": null, "cons": null, "date_created": "August 14, 2018"},
{"id": "1civc5sq7b818cn6", "rating": 5.0, "text": "Typical day at work was professional, yet casual.  Safety and Diversity in the Workplace is strongly promoted.  There was no dress code and in a professional environment I was allowed to take breaks when desired.  There was no time keeper and as long as I was productive my work ethic was never questioned.  My team leader was very knowledgeable and did not micro manage our department.  Every one in my group was approachable and there was no requirement to follow a chain of command even though we have senior positions and coordinators.  When I had ideas or a desire to take on new tasks, I would usually be granted my request if I could provide a use case and it did not impact the department.  I was able to learn new skills by taking the initiative and approaching my team leader.  The hardest part of the job was to work with others that I would deem unproductive.  These type of workers are protected by the union and it is very difficult for management to take action.  Therefore, all you can do is maintain a positive attitude and think of your contributions and not the lack of others.  Thank goodness 99% of City of Calgary employees are respectful hard working individuals.  I enjoyed coffee breaks with co-workers, organized city events, the freedom of my position, the ability to work four days a week, the option to work two days from home, and lots more.", "pros": "Pension, flexible work hours, telework option, very competitive wages, compressed work week, apply/work in temporary City positions while retaining your base position.", "cons": "Union environment protects unproductive workers", "date_created": "July 21, 2018"},
{"id": "1ci4sl9o2b88sdo8", "rating": 5.0, "text": "Great place to work, treat you like people. Excellent work climate. wish all companies treated employees this way. One draw back, some positions traditionally held by women are not unionized and therefore you get treated and paid way way less.", "pros": "Freedom to work", "cons": "Systemic gender discrimination", "date_created": "July 11, 2018"},
{"id": "1cgk8f1911fdr5bc", "rating": 4.0, "text": "great way to get a farmers tan. early mornings and beautiful grounds.\rlots of lazy people looking to do the bare minimum. the best part of the job was a job well done. \rthe worst part of the job was doing other workers jobs over because they didnt do it right the first time", "pros": "work by yourseif", "cons": "working in all kinds of weather", "date_created": "June 22, 2018"},
{"id": "1cfv8mai6b84lbf4", "rating": 5.0, "text": "it was a definite learning experience where I strengthened my role of leadership. I was making no money because it was volunteering but I received a few free lunches and had some great times", "pros": "Working with Kids", "cons": "different location every week", "date_created": "June 14, 2018"},
{"id": "1cfb8969mb85valb", "rating": 5.0, "text": "Overall day to day work is fairly easy-going. Great place to grow and learn different skills. Management and workplace culture is okay, depends on your department.", "pros": null, "cons": null, "date_created": "June 6, 2018"},
{"id": "1cc9dhd8daqgpbs8", "rating": 5.0, "text": "I got to learn a lot about interactions with others throught the job, i was a volunteer so i didn't get paid but I still got rewarded for my hardwork at the end of it.", "pros": null, "cons": null, "date_created": "April 29, 2018"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1cc22k5bcb85eb0s", "rating": 4.0, "text": "So much fun working with the city. Learn everyday new things, always expecting to help people with what they need, and at the end of the day, you feel so comfortable after getting your job done.", "pros": null, "cons": null, "date_created": "April 26, 2018"},
{"id": "1cbm1l6spb88gdgv", "rating": 5.0, "text": "This was a temporary position to help organize voter ballots for Calgary's 2017 Municipal Election. I enjoyed the work environment immensely, everyone was a good team player to one-another to get everything done and it was an experience I will not forget any time soon.", "pros": null, "cons": null, "date_created": "April 22, 2018"},
{"id": "1cb8pllu41d137k4", "rating": 3.0, "text": "Excellent place to learn skills gain customer service and technical experience,  Hours are reasonable and people are fantastic, very family friendly environment.", "pros": null, "cons": null, "date_created": "April 16, 2018"},
{"id": "1caqq0cogbrclbgl", "rating": 4.0, "text": "I got hired on as a temporary full-time employee, with a two-year probationary period. Wanted to make career out of it, but got laid off  due to budget cuts one week before I became permanent.", "pros": "Good schedule", "cons": "Difficult to become permanent full-time", "date_created": "April 11, 2018"},
{"id": "1c9sl0qb21fdn386", "rating": 4.0, "text": "Got to pick which days I wanted to work with my job in the recreation department, which meant I could choose hours that worked with my schedule. Opportunity for pay raises annually with performance reviews (at least in the area that I was in) and great people to work alongside with.", "pros": "opportunity for pay raises and awesome work environment", "cons": null, "date_created": "March 30, 2018"},
{"id": "1c9qal9a2b84mauq", "rating": 5.0, "text": "A typical day of work is to keep busy and time go by fast. I have had experience that i do not know before. Also, the Management is nice , they look after you very good and friendly workplace. The hardest part of the jobs is remove the snow and your sweeper is broken. For me, the most enjoyable part of the job is driving on cops's cars.", "pros": "best wages", "cons": "health care, penson, vacation", "date_created": "March 29, 2018"},
{"id": "1c9pt13u81fdn08f", "rating": 3.0, "text": "working in a team we created game taught kids to play. We did this for the summer throughout the city,  went on field trips and educational actives included.", "pros": null, "cons": null, "date_created": "March 29, 2018"},
{"id": "1c9pcgpt01fdn3ce", "rating": 4.0, "text": "Seasonal employees do not get to contribute to their pension. minimum two years of working seasonally before you are able to work full time. That was very upsetting for the 24 new hires.", "pros": null, "cons": null, "date_created": "March 29, 2018"},
{"id": "1c9djvcsv1fdn4q2", "rating": 3.0, "text": "Although on paper, each duty/job is very clear, the actual expectations of each job is very unpredictable. Each day is a new surprise with what you are expected to do and often times you are left on your own to figure out how to reach the end goals.", "pros": "Flexible hours", "cons": "Unpredictable situations", "date_created": "March 24, 2018"},
{"id": "1c926gdmvb80ichq", "rating": 3.0, "text": "Most enjoyed working with the developmental department assisting with the implementation of new software for the occupational hazard and incident reporting.", "pros": "Great hours, calm work environment and good salary", "cons": "employment is mostly temporary", "date_created": "March 20, 2018"},
{"id": "1c7rg37ofbrfef2t", "rating": 5.0, "text": "Excellent place to work.  I thoroughly enjoyed my internship at the City of Calgary and was amazed at how nice everyone was.  It is no wonder that people rarely leave once they are in at the city.", "pros": null, "cons": null, "date_created": "March 5, 2018"},
{"id": "1c7etoaf4b8bedg4", "rating": 4.0, "text": "Working for Recreation in the City of Calgary was fun for a while, but did not work for me as an individual. I worked one or two 3-4 hour shifts a week. The pay was fair and the environment was positive and helpful. I just didn't feel the job was right for me, and I needed more working hours from my part time job. \r I love the kids I got to work with, though the parents were sometimes stressful. Overall it was a positive experience.", "pros": null, "cons": null, "date_created": "February 28, 2018"},
{"id": "1c79fs5t9b87g8p5", "rating": 3.0, "text": "As a sub-contractor, opportunity for advancement is minimal. You do not get all the tools to perform your job efficiently and receive pressure on things out of your control.", "pros": "A paycheck", "cons": "Minimal reward or incentive.", "date_created": "February 26, 2018"},
{"id": "1c6q89cbcbrf1csh", "rating": 2.0, "text": "I worked for parks since 1996 and now worst season.  The city hires contracting out for parks and roads. Normally. Started work on April 1st until November Remembrance Day long weekend. April 1st to November 10th. Now the city changed to April 15th to October 10th.I am seasonal park labourer and truck driver. I was hard worker, maintenance, litter pick, laying on the sods, playround renovation,  painting, baseball diamonds grooming, inspect bleachers and more.\r  Our health benefits are excellent.  I do not recommended anyone to apply for parks due to corruption.", "pros": "very poor", "cons": "needs to improve and needs new manager.", "date_created": "February 20, 2018"},
{"id": "1c5r7akffbreifqm", "rating": 3.0, "text": "- little communication\r- poor performers protected\r- good workers leave \r- poor management\r- minimal recognition of accomplishments\r- no annual review of job performance \r- no peer job performances\r- reports to HR go no-where\r- annual work plan rarely reviewed, or completed", "pros": null, "cons": null, "date_created": "February 8, 2018"},
{"id": "1c5793tsib86adn2", "rating": 4.0, "text": "This was a really fun place to work while in school. Flexible hours and good pay. Would love to go back one day. There were many wonderful people I worked with.", "pros": null, "cons": null, "date_created": "January 31, 2018"},
{"id": "1c540augab8a5cjt", "rating": 4.0, "text": "Provides great work/life balance. Under new financial restraints, less staff is hired with growing infrastructure which does make it tough to manage, I was proud to work here for many years (15).", "pros": "Work/Life Balance", "cons": "Financial", "date_created": "January 30, 2018"},
{"id": "1c4hvfqq0b85t8gp", "rating": 4.0, "text": "311 is front line for all business units within the City of Calgary. Calls range from property tax to sewer backup and bylaw complaints. The calls can be both frustrating and fulfilling. As tough as the job is, the people working there are great and the management allows a lot of flexibility with scheduling and understands how mentally trying it can be sometimes. I appreciate the 4 day work week, the pay and management.", "pros": "Great management", "cons": "tough calls", "date_created": "January 23, 2018"},
{"id": "1c4fdlag0b81ob0r", "rating": 5.0, "text": "very  early mornings and set up for day, busy all day sometimes stressful, most customers are quite pleasent and enjoy coming there. sometimes heavy lifting but employees are willing to work together to get things done", "pros": "good atmosphere", "cons": "long hours", "date_created": "January 22, 2018"},
{"id": "1c4513iurbrdib5h", "rating": 2.0, "text": "great organization, not much job security in current position, very little ability for job advancement due to constant hiring freezes. certain job codes not worth being employed for.", "pros": null, "cons": "code 86", "date_created": "January 18, 2018"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1c3tjo8hgb85fapa", "rating": 3.0, "text": "pay was great, but the city would keep around totally useless workers. Its impossible to get rid of a bad employee\r benefits were fantastic pay was great", "pros": null, "cons": null, "date_created": "January 15, 2018"},
{"id": "1c2g64khsb850e6o", "rating": 5.0, "text": "Management of the Parks and Recreation branch in the City of Calgary is accommodating and fair. In my position as a Recreation Leader, I was tasked with creating weekly scheduled activities for kids aged 6-12 and leading them. As the face of the organization, I had to have excellent communication skills so that parents are able to trust leaders, and are aware of how their children are doing at camp.", "pros": null, "cons": null, "date_created": "December 28, 2017"},
{"id": "1c22bjbqv5n8pebu", "rating": 5.0, "text": "The City of Calgary was an equal opportunity employer. It provides good entry level positions, but advancement is difficult. It is a wonderful place to gain work experience. There are also frequent trainings available to city employees and I'd recommend taking advantage of those.", "pros": "Great benefits, job security, training opportunities", "cons": "Difficult to advance, very low pay for entry level positions", "date_created": "December 23, 2017"},
{"id": "1c0pnjeah5na0bh1", "rating": 4.0, "text": "Good company, if you desire advancement they will be willing to promote from within. They are great for advancement, learning new skills, and job security.", "pros": null, "cons": null, "date_created": "December 7, 2017"},
{"id": "1c0ho3voqbrdbdrp", "rating": 4.0, "text": "A very nice to work with job security.  Good work/life balance and excellent opportunities for career development.  Fast paced most of the time subject to economic factors.", "pros": "Morning and Afternoon breaks and one Friday off every month", "cons": "Salary a bit lower than private sector", "date_created": "December 4, 2017"},
{"id": "1bush3bvs1d0r7aq", "rating": 4.0, "text": "Good experience and enjoyed my tenure.\rFocus on the company and your individual experience while employed there\rProvide reasons for why you liked or disliked working at the company\rEnsure any facts you include in your review are true and accurate", "pros": "Culture", "cons": "Trust", "date_created": "November 13, 2017"},
{"id": "1bu92b7u41d174vk", "rating": 5.0, "text": "On a typical day at work I would answer anywhere between 60-80 calls.\r I learned how to work with 29 different business units.\r Management was great with support.\r Hardest part of the jobs was sometimes having to sent service request to other departments that take time to adhere to.\r Fulfilling customer requests and being able to help them out.", "pros": null, "cons": null, "date_created": "November 6, 2017"},
{"id": "1btt7e27pak50e5h", "rating": 3.0, "text": "Daily challenges safely transporting people under a variety of conditions that can change in an instant. Always nice at the end to be told what a great job you had done by the customers, yet never knowing what any particular day will bring your way!", "pros": null, "cons": null, "date_created": "November 1, 2017"},
{"id": "1bsr4f3aobrfbd2i", "rating": 4.0, "text": "The only thing is it's hard work and the schedule is not definite and management is a little unorganized but other then that it's great people, rewarding work and a satisfactory part time job.", "pros": "wages, easy shifts, lenient", "cons": "random schedule, hard work, outdoors", "date_created": "October 19, 2017"},
{"id": "1bs4isue4b8b4dit", "rating": 5.0, "text": "Best manager I've been with, the working environment and co-workers are very laid back, lot's of opportunities to transfer between departments and lots of opportunities to grow.", "pros": null, "cons": null, "date_created": "October 10, 2017"},
{"id": "1brpc6e9haqimdks", "rating": 4.0, "text": "The work environment allowed a wide scope of professional practice. A friendly environment where coworkers were willing to share their experience and knowledge.", "pros": null, "cons": "Management changes were frequent", "date_created": "October 6, 2017"},
{"id": "1brmn0921b876fu4", "rating": 2.0, "text": "You always hear about how working for the city is a life long career and how the benefits are so great but it really was not that great.\r City hires most people on contracts for years and before you become permanent they lay you off so they aren't stuck with you. They hire Sait students with big promises and never follow thru. The pay is really good and its a pretty relax environment generally but then once in a while management would drop the hammer on the team leads, who in turn drop the hammer on foreman, who in turn take it out on you for absolutely nothing. \r The guys doing the hiring and firing don't know who you are and have never seen you do a day of work. so if you do good work everyday for years and have a couple of mistakes in a row management will wash their hands with you. \r the facilities are all dated, a lot of old school mentality with guys just working to retire in the next few years and don't really care about the job anymore.", "pros": null, "cons": null, "date_created": "October 5, 2017"},
{"id": "1bqls94r952tuc15", "rating": 5.0, "text": "Amazing management, work life balance, great corporate culture, great pay rate , value of employees , flexibility , and employees are always encouraged to learn more and more", "pros": null, "cons": null, "date_created": "September 22, 2017"},
{"id": "1bqddil3ib82ja5o", "rating": 4.0, "text": "Working for the City of Calgary has the benefit of being part of a  union which in turn leads to certain pros and cons. Good pay and benefits are both nice to have however overtime is hard to come by and the structure of the Aquatics hierarchy make advancement hard to come by. The majority of the job is closer to public relations and teaching rather than life guarding itself.", "pros": null, "cons": null, "date_created": "September 19, 2017"},
{"id": "1bqb0ej65breabie", "rating": 4.0, "text": "Some good, some bad.  The presence of a union ensures that anyone with a poor attitude or a lackluster work ethic stays on for years, effectively poisoning positive spirits.  Salary is way above industry average, and most people are great to work with.\r On the plus side, I was blessed with an excellent boss who provided me with whatever I needed and even provided support on her days off!\r Very difficult to get a full-time, permanent position here, and I'm not sure I'd want one.  They can move you, change your position and you have no say over what they've decided.", "pros": "Above average salary", "cons": "Union", "date_created": "September 18, 2017"},
{"id": "1bprl3fesb868ffo", "rating": 5.0, "text": "I loved my years working for Calgary Transit.  Felt respected and valued.  A great opportunity to work with other professional drivers and provide  customer service.", "pros": null, "cons": null, "date_created": "September 12, 2017"},
{"id": "1bpdce4v7b860etd", "rating": 2.0, "text": "Management is poorly trained and long time staff are very nasty.  Probably a form of PTSD or Compassion Fatigue but not a very pleasant atmosphere to work in.  \r The job itself, 911, is stressful but very rewarding.", "pros": null, "cons": null, "date_created": "September 7, 2017"},
{"id": "1bp1elcnbbrdic3c", "rating": 4.0, "text": "Early safety meetings followed by vehicle maintenance . Review of public safety notifications. Emergency responses as called upon. Training in theory and practical application.", "pros": "team work", "cons": "stressful situations of life and death", "date_created": "September 2, 2017"},
{"id": "1bojg0cilbrdadus", "rating": 4.0, "text": "Got to work with good people on interesting projects. They are committed to developing staff, doing solid work and place high value on customer service.", "pros": "development opportunities", "cons": "some managers are toxic", "date_created": "August 27, 2017"},
{"id": "1boai8b8pb815f8l", "rating": 3.0, "text": "People are pleasant enough and there is a fair amount of collaboration. There are advancement opportunities but sometimes subject to union rules. There are opportunities to move to other positions and get trained on other skills. Pay is great. But manager tends to micromanage things.\r The political / unionized environment means one has to be careful what one says around people so as not to raise any red flags.", "pros": "use of kitchen, free parking", "cons": "unionized environment, hard to get in", "date_created": "August 24, 2017"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1bo5dgln3b8959pe", "rating": 4.0, "text": "Working for the City gives you many opportunities to learn and grow.  It is a major employer in Calgary, there are personal and professional development opportunities.", "pros": "flexible work options", "cons": "long commute", "date_created": "August 22, 2017"},
{"id": "1bno8upphbrcoc3d", "rating": 5.0, "text": "Enjoy the dynamic everyone was productive and easy going as well as professional. Made some great friends in the time I was there, wish I could have accepted the positions permanently.", "pros": "good team environment", "cons": "they don't hire from external temp agencies", "date_created": "August 17, 2017"},
{"id": "1bnehbk8u0mta0tr", "rating": 5.0, "text": "very great place to work especially for construction\rgreat pay and benefits. vacation time\rawesome co workers and bosses\rhelped me learn about direction", "pros": null, "cons": null, "date_created": "August 13, 2017"},
{"id": "1bn43b91jbrda8ra", "rating": 4.0, "text": "great place to work,  WAY TOO MANY MANAGEMENT due to economy,  budget cuts equals Group Layoffs  aside from that,  the city is a fair place to work,   :)", "pros": "great work and home life balance", "cons": "forever critzied for being a lazy city employee", "date_created": "August 9, 2017"},
{"id": "1bmiaq3q9b88rbu4", "rating": 4.0, "text": "No day is the same with this type of job, as different types of people come in every day. A good place to meet new people. New challenges every day that requires time and patience.", "pros": "city status", "cons": "limited growth", "date_created": "August 2, 2017"},
{"id": "1blujj74v1d054oi", "rating": 5.0, "text": "great place to work, management great. the pay is the only down fall,,,low money no benefits. best part is meeting lots of people. i drive golf cart and sell beer, wine coolers, chips sandwiches and choc bars. 8-9 hr days", "pros": "clients and staff", "cons": "low pay not allowed to accept tips", "date_created": "July 25, 2017"},
{"id": "1bj0l4r5rb82f8b8", "rating": 4.0, "text": "I've been with the City for 10 years. It has been a good experience and I've been able to advance my Career very well.\rMy shift is good now. My life and time with my child is very good.\rThe job has been a rewarding experience.", "pros": "Good hours", "cons": "Different shifts", "date_created": "June 19, 2017"},
{"id": "1bive7ioab82fepm", "rating": 4.0, "text": "Very respectful for the most part ,  reasonable wages ,  good benefits , good balance of work/life . good relations ship between front line workers and management.", "pros": "excellent benefits", "cons": "limited salary", "date_created": "June 19, 2017"},
{"id": "1bi4at7s0b814ca2", "rating": 5.0, "text": "I worked as a census taker for 2017 and found this job is fun to have. I can work with and rearrange my own schedule in order to meet the deadline. Going door to door to collect information allowed me to meet and talk to different people. It also allows me to earn some income while doing my daily walk.", "pros": null, "cons": null, "date_created": "June 8, 2017"},
{"id": "1bi4a0e9tb897drh", "rating": 3.0, "text": "Positive part about this job is being able to create a bond with new people. Learning new and old things. Being apart of someone's life, and making a difference or not and helping someone through a difficult time.  \rI would like to work part time with an opportunity to work more if needed.\rBeing honest .. it has been a long time since I have applied for a job. I would love the opportunity to see where I can go. \rThankyou\rGillian", "pros": "positive, moving forward, educating", "cons": "negative working environment.", "date_created": "June 8, 2017"},
{"id": "1bh9aq9mvb8bmb0n", "rating": 3.0, "text": "I have enjoyed working with the City as it has afforded me a good balance between my work and personal life. However, the evangelized values of Character, Competence, Commitment and Collaboration are, sadly, inconsistently practiced across the departments.", "pros": null, "cons": null, "date_created": "May 29, 2017"},
{"id": "1bgphgvjv5nd1b27", "rating": 5.0, "text": "typical day consists of morning meetings with the foreman for the current days scheduling and tasks, different groups perform different tasks,  we were responsible for planting flowers in city parks while maintaining them.", "pros": "great pay", "cons": "work in unpredictable weather heat/rain", "date_created": "May 22, 2017"},
{"id": "1bg7on3lqb8aodph", "rating": 5.0, "text": "great place to work where the training never stops. Always room for advancement, and the benefits are pretty nice too. everyone there is friendly and will advise you on the do's an don'ts .", "pros": "everything", "cons": "seasonal work", "date_created": "May 15, 2017"},
{"id": "1bg5hmq79b8ao98j", "rating": 5.0, "text": "I was under the Facility Management. Facility management is currently building five (5) Recreational Facilities in the City of Calgary. 1 project worth over 100M and it is almost  in completion this year. The other 4 projects have a budget of over 450M. These 4 projects will be completed within 2 years.", "pros": null, "cons": null, "date_created": "May 15, 2017"},
{"id": "1bfsdsg5g1d0u7bd", "rating": 4.0, "text": "I enjoyed all aspects of this job. Everyone was approachable. The work was done at a medium pace and we all learned alot about our area (yard work). We were also given classes on minor repairs and painting. Once a month we had a guest speaker who talked on various life skills (budgeting to healthcare).", "pros": "Everyone learned alot.", "cons": "The job was not for everyone.", "date_created": "May 11, 2017"},
{"id": "1bfkt1v121d0j6a4", "rating": 3.0, "text": "Though working with the city was a wonderful oppurtunity it provided very little job security for part-time employees and they never gave you a definitive answer as to whether or not they would be giving you a job again next season.  There was never a point in time that i did not have a minimum of 3 foreman controlling a maximum of 12 people.  I never actually figured out what they did during a day aside from call the crews for updates and meetings.  All i can say is that i was blessed to be able to work with the city for the time i did but they really need to revise the ammount of management there.", "pros": "high pay and great hours", "cons": "confusing/vague and often contradicting orders from management", "date_created": "May 8, 2017"},
{"id": "1bfhslmav1d0j0ne", "rating": 4.0, "text": "Long simple days working with young children during the summer. helped the camp leaders run games and activities for the children. Friendly fun environment.", "pros": null, "cons": null, "date_created": "May 7, 2017"},
{"id": "1bfaii0pq1d0j2p2", "rating": 5.0, "text": "UUUUUM I show up to the skatepark unlock it, sign kids in, ensure that they are wearing helmets. maybe teach the occasional skate lesson. But mostly just skateboard all day. what more can I say. Awesome summer job", "pros": "Skateboarding all day", "cons": "you get cooked in the sun", "date_created": "May 4, 2017"},
{"id": "1bf6ff9201fdl5p0", "rating": 4.0, "text": "Conducted extensive research on E-learning options and patiently consulted with different E-learning specialists.\r Designed interactive E-learning demos by using Adobe Captivate 8 and other software tools.\r Successfully gave several formal presentations about my E-learning project to team members and stakeholders in\rregular meetings.\r Carefully prepared and compiled reports on recommendations.", "pros": null, "cons": null, "date_created": "May 3, 2017"},
{"id": "1bf14d7qp1d0i5h1", "rating": 3.0, "text": "I was one of hundreds of administrative support professionals in a department caught in a fiscal restraint policy of The City of Calgary.  My fellow support staff, many who had been in service to the City for 20+ years, and myself suddenly found ourselves bereft of employment, representation - and support - as we watched our department disappear and our services outsourced.", "pros": null, "cons": null, "date_created": "April 30, 2017"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1be6ncijsb8b0fhu", "rating": 4.0, "text": "its a good place to work due to the kind of leaders I have\r I know some people don't have this to say but I am grateful for the kind of leadership I have", "pros": null, "cons": null, "date_created": "April 20, 2017"},
{"id": "1bdkjekl2b8a8dbd", "rating": 5.0, "text": "My job had me moving around a lot. From working as a helper on a chemical truck. Going to different fire halls. And pickup up chemicals and returning to base. Everyone has each others back. When one person had an off day. The rest of us would pick up the slack. Like most outside jobs Weather was always the down side of the job.But Formans   always  came to the rescue. Great job never wanted to leave. cut back with the city.Lots of jobs lost in waste management/roads/parks this past year.", "pros": "great place to work", "cons": "working in the rain", "date_created": "April 13, 2017"},
{"id": "1bdevrf16b8a8ahn", "rating": 4.0, "text": "As a Service Lane Attendant you learn how to work as a team. It is a very fast paced work environment, but you must always work safe at all times. We do various campaigns on the trains every week, which means we may lift seats and clear out garbage underneath or we may clean the light fixtures in the U2 vehicles. This is difficult physical work but we get the job complete. My favourite part of the job is getting the opportunity to drive and park the trains.", "pros": "4 days on 3 days off", "cons": "Late nights", "date_created": "April 11, 2017"},
{"id": "1bdcugra3b821dmj", "rating": 4.0, "text": "The City of Calgary provides a stable work environment.  Key to longevity in this work is consistency.  Reliable workers stay longer and go further.\r At times there are inconsistencies between policy and job demands.  This is common when those responsible for policy are not on the front line.  \r Friendly atmosphere in the department I worked", "pros": "Benefits, stable, consistent expectations", "cons": "Beauracracy. Top heavy. Different departments determine your long term expectations.", "date_created": "April 10, 2017"},
{"id": "1bcq3o5p9b81lbf5", "rating": 5.0, "text": "It was a great place to work at. great management and good co-workers. learned a lot about traffic engineering and traffic management center. Also I met a lot of great people", "pros": null, "cons": null, "date_created": "April 3, 2017"},
{"id": "1bcgj67aob81jdf9", "rating": 3.0, "text": "Good company to work for. Have good work culture. Very much everyone cooperative and helpful, and overall good place to work. The most enjoyable part of my job, is looking forward to go to work.", "pros": null, "cons": null, "date_created": "March 30, 2017"},
{"id": "1bbrj32sib895d4s", "rating": 5.0, "text": "The building that I worked in had a fantastic gym facility that was accessible year round. The fee was very reasonable and there was also a fitness instructor available for tips and suggestions on my fitness goal.", "pros": null, "cons": null, "date_created": "March 22, 2017"},
{"id": "1bbcccm3kbrcrdes", "rating": 4.0, "text": "I was only there for a summer position, but I felt I learned a decent amount from working there. I would not call my time with them exceptional in any particular way, but the overall experience was a positive one and I would definitely work there again if given the opportunity.", "pros": "Nothing horrible, fair wage, solid management", "cons": "Nothing amazing, felt my being there wasn't really noticed", "date_created": "March 16, 2017"},
{"id": "1baql7nvh1ahf1pt", "rating": 3.0, "text": "It's a good place to work. Great benefits and great people. It was nice to see all the beautiful parks we have in Calgary.Every day was different and interesting .You are always busy and on the go. The days fly by and so does the season", "pros": "4 day work week", "cons": "Not bad 9.5 hr days", "date_created": "March 9, 2017"},
{"id": "1bagbab921d18746", "rating": 2.0, "text": "Job and the people I work with are great. I wouldn't say that about the management and their treatment of the operators. The hours make traveling to work much easier in the busy Calgary traffic.", "pros": "coworkers", "cons": "management", "date_created": "March 5, 2017"},
{"id": "1b8d4nse2ak8sdec", "rating": 3.0, "text": "work well with others, \rable to multi-task,\rable to follow directions accurately, \rexcellent customer care assistance, \rI am a quick learner.", "pros": "cares greatly for customer service", "cons": "no overtime", "date_created": "February 7, 2017"},
{"id": "1b8be4q0n5j5v88i", "rating": 3.0, "text": "The City gave me the opportunity to grow in my professional procurement experience. It exposed me to great projects that have a positive impact on the lives of many Calgarians.\r I highly recommend the city.", "pros": "every second Friday off. Stable.", "cons": "slow career progression", "date_created": "February 6, 2017"},
{"id": "1b78oh716b8bobak", "rating": 5.0, "text": "It was temporary assignment for a short period of a week only. Team members were very supportive. I wish I would have been worked for a long time with this company.", "pros": null, "cons": null, "date_created": "January 24, 2017"},
{"id": "1b6cd1dqdbvupfuv", "rating": 5.0, "text": "Work at the call centre can be hectic at times when call volumes are high but the pay is very good for customer service work and the benefits are excellent. The environment is very supportive thanks to management and it is truly like working with a close-knit family. You are left to make your own decisions and you are fully supported in doing that. Unfortunately, I had to move on after a limited term ended so I do wish there was more room for advancement/job security but other than that, I would highly recommend working at The City of Calgary.", "pros": "Great management, great benefits, good work environment", "cons": "Hectic pace during periods of high call volumes.", "date_created": "January 13, 2017"},
{"id": "1b5o1n6pcakd3d22", "rating": 5.0, "text": "The City of Calgary was professional and upheld a high quality standards which in turn produced positive results. The workload was well spread throughout the employees and management was very accommodating if help was needed.", "pros": "Benefits, accommodating atmosphere, no overtime necessary", "cons": "Lack of parking", "date_created": "January 5, 2017"},
{"id": "1b55dd7dc1ah62v5", "rating": 5.0, "text": "The City of Calgary of IT shop is one of the best to work. The staff are very knowledgeable, professional and innovative.\r Leadership provides great direction and have a solid plan on how to provide a very high quality of service to the citizens of Calgary.", "pros": null, "cons": null, "date_created": "December 29, 2016"},
{"id": "1b3v80ok1as3ifg2", "rating": 5.0, "text": "Opportunity to participate in change and innovation. Work culture strenghthen and supported by the leadership team. Learning and development opportunities available.", "pros": null, "cons": null, "date_created": "December 14, 2016"},
{"id": "1b1ds1kqf1d086pd", "rating": 3.0, "text": "I worked in an area for several years.   This year the City\rchanged all the areas and crews.\r They are also subcontracting a lot of the Parks operations.\rMy job will likely be phased out in the next couple of years.\r I enjoy working with plants and growing.   I supervised crews and worked right along with them to achieve success.\r I also operate a small home business greenhouse and have achieved success with my endeavours.", "pros": "Enjoyed the area I was working in", "cons": "No room for advancement or getting a full time position", "date_created": "November 12, 2016"},
{"id": "1b10044hv1d0l3qh", "rating": 4.0, "text": "The City of Calgary Swim Instructor position is a fun, flexible and empowering job. Instructors get to work with kids, adults and seniors in a linear progressive program that branches of as swimming ability improves.", "pros": null, "cons": null, "date_created": "November 7, 2016"},
{"id": "1avsgm02gb8arbsr", "rating": 4.0, "text": "I have enjoyed basically everything about my current job with the City. I like my co-workers and all of my bosses, and especially the kids. I've learned a lot about dealing with parents/customers and how to try and settle conflicts. I like everything about my job, its just not enough hours for me currently.", "pros": "Great management and environment", "cons": "Not a lot of hours", "date_created": "October 24, 2016"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "1aud9vtqiak4lef0", "rating": 4.0, "text": "I have lived in Calgary all my life and working at 311 Customer Contact Centre has expanded my city knowledge. There were days when I would take the same call inquires and other days, I would learn more each day.", "pros": "No sales targets, customer service experience, great people to work with, like family", "cons": null, "date_created": "October 6, 2016"},
{"id": "1arttr1mhas10bk5", "rating": 3.0, "text": "My experience with the City of Calgary for the most part was enjoyable. The work was challenging and I learned something new every day. I had never used or worked with Integraph CAD system, and enjoyed the challenge of learning a new system. I wrote modules that were going to be used to train or refresh City Fire and EMTs. In addition to the modules, I also wrote test cases. These cases allowed the user to create new Stations/Units, etc. The hardest part of the job was that we were in a huge building, but isolated from the main area. I'm used to working in a more diverse environment. In addition, there was no cafeteria on site and it took 20 minutes to get anything to eat. Lastly, I was contracted through Manpower to the job and the pay, for my skill set, was not up to standard.", "pros": "Good equipment", "cons": "Working through Manpower the salary was not up to my expectations.", "date_created": "September 5, 2016"},
{"id": "1ares18rpas0j978", "rating": 5.0, "text": "The 311 operations center is dynamic and fast paced\r I've learned a great deal about Calgary while at 311\r The citizen's call in with their concerns, and as an agent, I would create a service request for the appropriate department to have them investigate, it's a very good system.", "pros": "Varied shifts", "cons": "Varied shifts", "date_created": "August 30, 2016"},
{"id": "1an8b9gv6as16evj", "rating": 4.0, "text": "Constant learning environment as technology advanced  Went from an entirely mechanical product to entirely electronic and programmable within 5 years.  \rHard working and dedicated co-workers always looking to improve the methods of operation", "pros": "In house training available", "cons": "limited budgets for training", "date_created": "July 9, 2016"},
{"id": "1amna5h2t0mt21fb", "rating": 3.0, "text": "A great environment to work with the city !! Lots of free swim pass days, and annual social events. A new bike program has begun! Go to the city of calgary website for more details on two wheel view!", "pros": null, "cons": null, "date_created": "July 2, 2016"},
{"id": "1alsmqfdob88sfb3", "rating": 5.0, "text": "Overall Best company with good people to work.Learn new software like JDE and how to organize things on priority basis. Had good health benefits", "pros": "Best COmpany", "cons": "Management changed", "date_created": "June 22, 2016"},
{"id": "1al30bchlas0qfn4", "rating": 4.0, "text": "I started my career with The City over nine years ago. I started in an inbound Human Resources Service Centre and worked my way up until I reached HR Analyst. The best part of my job is working with my clients and working on complex and challenging cases. The most enjoyable part of my job is helping others. A typical day at The City includes phone calls, lots of emails and drop ins with inquiries, cases and project work. Then there are meetings to learn and share from colleagues, talk to the Director and regular meetings with clients. I feel blessed to have worked at such a great company and would like to move out East to learn a new culture, processes, collective agreements, etc.", "pros": "Own office, parking, co-workers, relationship building, flexible, great benefits, pension, vacation and pay", "cons": "Far from family", "date_created": "June 12, 2016"},
{"id": "1al0rup0i1ago06l", "rating": 5.0, "text": "Excellent work and life balance. Great package and compensation. Flexible management. If you like to grow you always have an opportunity to work around. Professional growth is their number one priority.", "pros": null, "cons": null, "date_created": "June 11, 2016"},
{"id": "1ajnfor7cb82288s", "rating": 2.0, "text": "Great place to work. Shift work is an issue. Management is a little off, they could have managers/foreman that are more qualified. A lot to learn between equipment, learning to work with crews, growing.", "pros": null, "cons": null, "date_created": "May 26, 2016"},
{"id": "1ahkk0smmak7jdge", "rating": 5.0, "text": "GGGreat work and experience with opportunities to advance with strategic qualifications and experience.  Excellent hours and benefits to participate in several activities with colleagues.", "pros": null, "cons": null, "date_created": "April 30, 2016"},
{"id": "1act2pothb851fuv", "rating": 1.0, "text": "People who sit and do nothing but good at talking climb the corporate ladder quickly while people who does work were stuck in corner and was told to shut up otherwise got kicked out.", "pros": "None", "cons": "Talented people are eventually drive off the environment. Politics prevails quality work.", "date_created": "March 2, 2016"},
{"id": "1acsfnuqpak7saie", "rating": 5.0, "text": "- Responsible for a large number of children at day camps, the children were 3-12 years of age \r- Ensure safe environment for all children; clear area of physical dangers \r- Plan and organize crafts and activities for the children \r- Explain and ensure children follow the rules of the programs \r- Lead and organize the children in fun and safe activities ", "pros": null, "cons": null, "date_created": "March 2, 2016"},
{"id": "1abqpjfmib80k9qa", "rating": 5.0, "text": "Really enjoyed showing up for work daily M-F from 8am-4pm was very well respected and really enjoyed new things which I use daily on my own lawn care maintenance and was able to teach my teenage son and my 10 year old son, much useful skill I could share with family.", "pros": null, "cons": null, "date_created": "February 18, 2016"},
{"id": "1a9q6nesjak5ra25", "rating": 4.0, "text": "Working for the City of Calgary is an experience.   If you have heard a joke about a city worker it is probably true.  That being said government work is a catch 22 of management trying to accomplish their mandate inside a framework that limits their ability to do it efficiently.   \rThe pay and benefits were good.  The allowed sick time was almost criminal (to the benefit of the worker).\rThe hardest part was watching tax dollars at work.", "pros": "benefits", "cons": "union vs management", "date_created": "January 24, 2016"},
{"id": "1a92vkl7has389i0", "rating": 5.0, "text": "Everyone is so nice and supportive. All the managers treat you like an equal. The work is simple, and if you don't know something and ask they will explain why and how something is done the way it is.", "pros": "Great environment", "cons": "none", "date_created": "January 15, 2016"},
{"id": "1a4ri56l9ak91etn", "rating": 5.0, "text": "It was an excellent work environment with great supervisors and excellent culture. It was excellent salary and great work.", "pros": null, "cons": null, "date_created": "November 23, 2015"},
{"id": "1a40r9276b82mbfv", "rating": 5.0, "text": "Work/Life Balance is top-notch. Salary/Benefits are comprable to most other organizations. Lots of opportunities for advancement.\rThe culture can be depressing at times (lots of entitled union folks) and the top management likes to preach one thing, then do the opposite. But that's really the only downside.", "pros": null, "cons": null, "date_created": "November 13, 2015"},
{"id": "1a3ai3pt5b82aaoe", "rating": 5.0, "text": "Customer Service has been a major interest for me. Helping passengers get to where they want to go. Rewarding career to be able to operate a large vehicle and have contact with people. Highlights of civic events, and the excitement of the attendees.", "pros": "Flexibility of being able to work without close supervision. Empowerment.", "cons": "Long hours between job shifts, split shifts", "date_created": "November 4, 2015"},
{"id": "1a1uo50trb81fbf4", "rating": 5.0, "text": "The city of Calgary is a great place to work.  I take great pride in just saying that I work for the city.  My job is fun steady and always different.  If I could find year round work with the city it would be amazing, due to my current job only being a summer time job.  My co workers are great I have allot of fun working with them.  The hardest part of my job is dealing with on coming traffic, and the crazy speeds.  The most enjoyable part is the environment that the city provides.  Its safe and well maintained.", "pros": "Benefits are awesome", "cons": "working nights with a new born in house", "date_created": "October 18, 2015"},
{"id": "1a16aq74jb86g9bo", "rating": 4.0, "text": "I have had a long standing career with The City of Calgary and have had many opportunities.  The most rewarding aspects have been the people I lead and support on a daily basis", "pros": "I love the work I do and the people I work with", "cons": "Commute to downtown Calgary - just moving to Okotoks I would enjoy something more local", "date_created": "October 9, 2015"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "19upc2js6akaba03", "rating": 5.0, "text": "Working at the City Of Calgary was one of the best places I have ever worked.  I am a single mom their understanding and flexibility definitely made things easier on my home life.", "pros": "Flexibility", "cons": "None", "date_created": "September 9, 2015"},
{"id": "19uculv56b8308ej", "rating": 5.0, "text": "Enjoyable to go to work everyday due to the great team work environment. There was always support available from supervisors and computers when we had questions, also enjoyed working with the co-workers.", "pros": null, "cons": null, "date_created": "September 4, 2015"},
{"id": "19u7vrin8b82ndrg", "rating": 5.0, "text": "In the time I was employed with the City of Calgary, I gained a great amount of experience with their different websites, how the department was run. There are a lot of perks to this company such as the classes that were offered to update yourself (for ex: excel training, power point training, record management etc.). The benefits and salaries (depending on what position you had) were a bonus.  I met some great co-workers and have made some friends from there.  I found most people were willing to help you if you didn't understand a process. The only thing I didn't like was my contract ending. I was a limited term and was so close to getting to my 2 year mark.  I would definitely work for the City again if an opportunity was available.", "pros": "benefits, salaries, variety of job opportunities", "cons": "Not all positions were permanent", "date_created": "September 2, 2015"},
{"id": "19q24ub12b81f90g", "rating": 5.0, "text": "Typical day of work varies through the duties that we do. When trains are closed for maintenance, I am working on the platform directing people to the shuttle busses. I count people coming in and out of trains at various stops within the city. I also count people in busses and trains.", "pros": "Easy, money", "cons": "Sometimes have to work early morning/late night", "date_created": "July 12, 2015"},
{"id": "19n34hrmpb83mej3", "rating": 3.0, "text": "Day to day work load would change , using  vast experience to meet the demand  of the task of the day . Operated many pieces of equipment would  perform routine maintenance of equipment . Gardening , Pruning were ordinary tasks of the day .  Irrigation work was an interesting experience at the City . Management at the department  was always in a chaotic state more reactive than proactive .When I worked in Irrigation found the management to be very good and proactive .  My time  there with my co-workers were enjoyable we had a very easy going workplace atmosphere  in all departments , conflicts were rare . Challenges presented themselves when working on re mounting and installing the headstones due to the ground was always difficult . When completion of task that impacted others and hearing the feedback was a rewarding experience .", "pros": "the work shift, co- workers, feedback from the public", "cons": "rare and infrequent visits from the management, inconsistent work schedule", "date_created": "June 5, 2015"},
{"id": "19lc42dnm52u0b0e", "rating": 3.0, "text": "if you are satisfied with doing just the least in life, and don't want to be challenged then the City can work for you however if you strife to want to make a difference in life and lead it is a very poor place to work. I retired from there now went and trained in safety to add to my knowledge and experience base to work for 4 or 5 more years to try and enjoy all the things I could not while working at the City. The one thing I did enjoy about the City was the people I was able to help the workers I supervised and coached, trained, and I have to admit it did provide me with employment, education,& benefits. I did start and stop three time in my career with the City. They liked me & it worked for me. Now set me FREE.", "pros": "Always training", "cons": "Politics", "date_created": "May 15, 2015"},
{"id": "19l4vp3o1b81gek5", "rating": 4.0, "text": "It was good experience working at the city. I enjoyed the management, and gained quite a lot of valuable knowledge from my time there.", "pros": "City Work", "cons": "Not enough hours", "date_created": "May 12, 2015"},
{"id": "19km5igrhb81gel5", "rating": 4.0, "text": "I had a good experience working for them as I continued to learn how to Landscape, prune trees & shrubs and I loved the atmosphere and I also enjoyed working as a custodian at the Arts Center.......", "pros": null, "cons": null, "date_created": "May 6, 2015"},
{"id": "19kddntjbb81gfb4", "rating": 4.0, "text": "The management is top heavy,   It is that old saying too many chiefs and not enough Indians.   The work load for the regular staff is overwhelming at times.    Mostly my co-workers were great, I was always requested back to the same departments once I had worked there.   The most enjoyable part of the job was dealing with the public.", "pros": "good work environment", "cons": "nothing comes to mind", "date_created": "May 3, 2015"},
{"id": "19iqqkmcj1d016fh", "rating": 2.0, "text": "Loved my job there.  I enjoyed the atmosphere, the coworkers, but wished there was more job security and stability.  Unfortunatley I was laid off.", "pros": null, "cons": null, "date_created": "April 13, 2015"},
{"id": "19ibd3ubpb80gevn", "rating": 5.0, "text": "I enjoyed getting up every day and being at work at least a hour early get work load for the day, and what your job duties  where for that day, I learned how to drive trucks with Air Brakes Steam roller, and good team work, Management was very good to me and got along good with all managers, Co workers were all good team and worked well, with every one, Hardest part of job was when we all got laid off, Most enjoyable is getting the jobs, done, and filling good about what you accomplished in a day", "pros": "Staff lunches, and BQ, s", "cons": "Night Shifts, and 12 hours shifts", "date_created": "April 7, 2015"},
{"id": "19htck49vb80g9sf", "rating": 4.0, "text": "I enjoyed the people on a daily basis, loved driving the units, found the training program excellent. The salary is amazing along w ith benefits. the hardest part was learning route within 24 hr notice every day.", "pros": "Salary", "cons": "treated like a number", "date_created": "April 2, 2015"},
{"id": "19hom0u1bb84g8u9", "rating": 5.0, "text": "It was very great to work at. Great pay and great people. Hard to get time off (since it is a summer job), you are expected to work summer hours. Would recommend someone to work here.", "pros": null, "cons": null, "date_created": "March 31, 2015"},
{"id": "19hkb1k3bb84gcbd", "rating": 5.0, "text": "A typical day at work would involve me sitting at my desk and working with microsoft excel, word and access. I would help the Certified Engineering Technologists and Professional Engineers with various tasks. Also when there is free time they would take me out on site and see the LRT system that they are responsible for.", "pros": null, "cons": null, "date_created": "March 29, 2015"},
{"id": "19gm2keq0b84g8kv", "rating": 5.0, "text": "Enjoyed all my days learning new things working with City Clerks side by siCustomer Service in all areas. troubleshooting, listening skills extreme knowledge.", "pros": "nothing", "cons": "nothing", "date_created": "March 18, 2015"},
{"id": "19fh87qr2b84g82n", "rating": 4.0, "text": "Good work. Good people to work with. Job is seasonal so it starts out slow, then gets very busy and hectic in mid summer. It gets slow\rat the end of the season. Then you get laid off. You get swamped with work from Victoria Day weekend until Labour Day weekend.", "pros": "Good work, money, and benefits", "cons": "Over stressed some times", "date_created": "March 3, 2015"},
{"id": "19et2936bb84gf76", "rating": 5.0, "text": "A typical day at work would be;\r Loading up my van with gear; computers, cameras, lighting and or sound equipment, monitors, stand backdrops all the accessories. \rOften i am sent out to events as a one person event staff\rTraveling to the event meeting with site co-coordinator/s reviewing staging and set requirements.\rUnloading and setting up equipment, testing and trouble shooting computer systems to ensure reliability\rShow time\rworking with all ages either as a photographer or green screen technician and personal adviser in preparation to capture the most flattering images of clientele.\rMy most enjoyable part of the job is working with the public, keep them laughing, smiling and feeling great about themselves and their experience with our events.\rAt the end of the event it i s time to pack everything meticulously in preparation for anoth er event.\rAll inventory is collected and loaded back into the van to take back to the shop.", "pros": null, "cons": null, "date_created": "February 23, 2015"},
{"id": "19edch2g9b80geuf", "rating": 4.0, "text": "A typical day included checking in golfers, keeping the tee sheet running on schedule.  Stocking and selling snacks from the concession and at the end of the night finished a cash out and cleaning the club house.", "pros": null, "cons": null, "date_created": "February 17, 2015"},
{"id": "19e58oh9rb80gaqo", "rating": 5.0, "text": "Short position, but lots of opportunities to take personal initiative. Provides excellent leadership experience. Lots of opportunities to advance.", "pros": null, "cons": null, "date_created": "February 14, 2015"},
{"id": "19e35te38b84ge6c", "rating": 4.0, "text": "I really liked my small team. I wish I could have been challenged a bit more, but I really liked the reliability. Yeah, you have to deal with a lot of politics but as long as you know how to keep your mouth shut when it's \"important\" then you'll love it. They really try and make you feel good about being a part of a huge organization, personally, I learned that they're not for me.", "pros": "Awesome Pay", "cons": "Hard to keep the fire in your belly", "date_created": "February 13, 2015"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "19dno4oisb80gdek", "rating": 4.0, "text": "Too corporate with initiatives coming from Council. A lot of work couldn't be completed without direction from all over the place. It's hard to feel accomplished in your work.", "pros": null, "cons": null, "date_created": "February 9, 2015"},
{"id": "19c72a95bb80gb9d", "rating": 4.0, "text": "Good part-time job with flexibility and great benefits and pay given the position", "pros": "Low stress, flexibility, good people, benefits", "cons": "Occasional split shifts", "date_created": "January 21, 2015"},
{"id": "19bvpahkqb84ged1", "rating": 5.0, "text": "I drive bus for Calgary Transit.\rDealing with customers.\rMost enjoyable part is meeting with new people.", "pros": "Wrok Independently", "cons": null, "date_created": "January 18, 2015"},
{"id": "19ac09hk2b84g8tg", "rating": 4.0, "text": "I work part-time, shift work. I earned $30,000 per year.\rI work with a team of people", "pros": null, "cons": null, "date_created": "December 29, 2014"},
{"id": "199309gdob80g9ma", "rating": 3.0, "text": "A typical day at work would begin playing games or sports with young kids. This position has taught me allot, such as How to be patient and more understanding. It has helped me to be more myself and to become not so afraid to let the \"kid in me\" get out and just have some fun once in a while. \r The hardest part of my position here was thinking of creative and intuitive ways to coach muay Thai to the youngsters. Even though I have been the sport for so many years, coaching it is a whole other level. It definitely helped me with my presentation skills. A second  difficult thing to deal with was preventing and stopping, both with the individual being bullied and the individual being the bully. It was not fun. Very sad to see someone becoming so assumed of themselves because someone was putting them down. \r My co-workers were a blast! Every Friday night after teen nights all the staff went out for pizza at a pizza place next door. Everyone hung out. The culture was amazing.", "pros": "group gatherings, tons of interesting opportunities, being a positive role model for youth", "cons": "being done at work at 1230 am on a friday night, needing more direction, more training", "date_created": "December 13, 2014"},
{"id": "198bck223b80gbfc", "rating": 5.0, "text": "I have learned a lot of stuff here. I have enhanced my knowledge in a lot of things.", "pros": null, "cons": null, "date_created": "December 4, 2014"},
{"id": "19750bi2tb80gd5m", "rating": 4.0, "text": "Inbound contact centre.  Handle internal and external customers.  Dealing with difficult customers.  ESL customers.  Compressed schedule.", "pros": null, "cons": null, "date_created": "November 19, 2014"},
{"id": "1974occr8b84gctr", "rating": 3.0, "text": "Great place to work. Busy place, everyone is there to work.\r the culture is great. Job security is great. Money is good, great benefits, the only this is its hard to become permanent with city.", "pros": "free lunches", "cons": "always very busy", "date_created": "November 19, 2014"},
{"id": "196e9hc63b84gamr", "rating": 5.0, "text": "Intense work with decisions that have to made within seconds to periods of being uneventful or idol.\r Shift work is a way of life compounded by working nights and being required to be in a Court of Law in the morning or afternoon then back to night shift with usual high expectations not to be compromised.\r Twenty six year's is difficult to paraphrase in a review how ever decisions were a way of life.\rFrom a citizen asking if they ay park in a certain spot to being first at Homicide scenes and doing emergency entries in high risk situation's.\r As senior man I was constantly asked to do relief Supervisor work which embodied Supervising all Constables in downtown Calgary and being incident commander at major situations.", "pros": "No free lunch. Good weight room", "cons": "Long hours without warnng and working nights then days in court.", "date_created": "November 10, 2014"},
{"id": "195eqsb1sak4gb0q", "rating": 4.0, "text": "Overall, a good company to work for.\r Lots of room for growth, many different departments to work for.", "pros": null, "cons": null, "date_created": "October 29, 2014"},
{"id": "1933n0nieb84gdak", "rating": 5.0, "text": "People are very helpful and people are all very friendly.\rWork wise it is a very good experience and you learn a lot in time.", "pros": null, "cons": null, "date_created": "September 30, 2014"},
{"id": "192tcgbteak8g86m", "rating": 5.0, "text": "Spring Gardens was a great place to work, not only for me but the other technicians.  they enjoyed working there because i treated them with respect. We were equals i would listen to complaints and would try to resolve the problem or at least come to a compromise.  \r     Regarding the management I wasn't a fan. Fleet Services was being run by people who had no cultural background in the Industry.  \r     What I learned from this whole experience is that working for the government takes an incredible amount of patience.  if you need something done it takes a committee to decide if it is cost effective, appropriate for the location and then it is put out to tender.  i like to have things done as soon as reasonably possible so i needed patience to coexist in this theater.", "pros": "Working with like minded people.", "cons": "Politically toxic", "date_created": "September 28, 2014"},
{"id": "1922t6lbnb80gbf3", "rating": 5.0, "text": "It was an easy friendly and highly beneficial place to work a great summer job!", "pros": "salary, hours, environment", "cons": "union fees", "date_created": "September 17, 2014"},
{"id": "1922jk4aeak4gadu", "rating": 5.0, "text": "i worked all day outside. Worked with many different people. learned new things everyday.", "pros": null, "cons": null, "date_created": "September 17, 2014"},
{"id": "191l8hj6db80gduf", "rating": 5.0, "text": "City of Calgary is a place where you can learn and explore.Being a Legal assistant I would call different departments of City to get the documents together.", "pros": null, "cons": null, "date_created": "September 12, 2014"},
{"id": "191dejflgb80g8v6", "rating": 1.0, "text": "I applied this position (Traffic Maintenance Technician) every time I saw it, but I never got an interview. I wonder why it is like this forever and they are always hiring...", "pros": null, "cons": null, "date_created": "September 9, 2014"},
{"id": "19194rt0bak4g9i1", "rating": 5.0, "text": "Overall, a good 32 years with the City of Calgary. I love driving and interacting with the public brought me great satisfaction. Met many fabulous, interesting people from all over the world", "pros": "Interacting with public. Doing what I liked to do (drive)", "cons": "For me there were no cons other than perhaps the odd problem passenger", "date_created": "September 7, 2014"},
{"id": "1913f340gak8garn", "rating": 5.0, "text": "Fantastic job with Fantastic people. Management is very understanding. Get to work with all departments in the City.", "pros": null, "cons": null, "date_created": "September 5, 2014"},
{"id": "190ae7gbgb80gded", "rating": 4.0, "text": "each day brought opportunity to learn new skills, eg website updates, communications process internal and external, a unique opportunity to interact with Citizens, City Council,MLA's, creative services, working with co-workers on projects such as land, buildings. the great opportunity to learn new processes and skills", "pros": "a great place to work providing great challenges to produce great work", "cons": null, "date_created": "August 26, 2014"},
{"id": "18u2l1mg0b80g8it", "rating": 4.0, "text": "I was hired on through a temp agency and it was a unique and amazing first experience in an office environment. I learned about privacy issues and professionalism. Not easy to get in to, a lot of hard work to become employed, but a rich experience and eye opener.", "pros": null, "cons": null, "date_created": "July 29, 2014"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "18tgfni4ab84gdum", "rating": 4.0, "text": "I enjoyed doing different events and mixing up the tasks for events. The hands on work reinforced my love of being busy and seeing a task completed.", "pros": "Work expirience, Hands on work", "cons": "Casual hours only", "date_created": "July 22, 2014"},
{"id": "18t0enf0pb80g966", "rating": 1.0, "text": "I have nothing good to say about working for the City of Calgary.  Benefits and Pension are a joke.  The Union is neutered.", "pros": null, "cons": null, "date_created": "July 16, 2014"},
{"id": "18rcv3748b84gcut", "rating": 4.0, "text": "Lots of opportunities with the city of calgary, \rextensive paid for training so that you are comfortable at your job.", "pros": null, "cons": null, "date_created": "June 26, 2014"},
{"id": "18qvut0q7ak4g82f", "rating": 3.0, "text": "The job very steady, working a consistent shift. My co-workers are very friendly and helpful. The pace is a lot slower than I am used to, there is very much a union mentality, nothing gets done before start time. Hanging around waiting for direction and morning meetings really absorb most of the mornings time. If you are willing to put in 7 years< there maybe a possibility of advancement, but that is if you are not superseded by a worker from another department or plant that has more seniority than you.\r The work is fairly typical and routine, very hard to think out side the box as other co-workers shut you down due to the union scope of work and what they feel that they should do for the pay that they receive. The hourly wage is very good for working in Calgary, although there is a lot of deductions which bring your take home to an exist able level. Unfortunately Overtime is very scarce, your basic wage is really what have to consider normal, any OT is a bonus.  \r On the up side, your deductions go towards a very good health care program. A lot of you weekly money gets deducted for a pension which is match plus more by the city. Short and long term sick, standard 2 weeks holiday after a year.", "pros": "pension and good benifits, good worklife balance", "cons": "No OT, little room for advancement, old school managment and work ideas.", "date_created": "June 21, 2014"},
{"id": "18ont8udsb80gfht", "rating": 5.0, "text": "- I learned to use various software used by The City of Calgary in a short amount of time\r- Very flexible environment\r- Family first and they are able to allow time off when you have a family emergency\r- Great balance of work and life\r- Relaxing atmosphere, stress free", "pros": "1.5 hours lunch, every 3 weeks you get a paid \"RAWW\" day off, very flexible.", "cons": null, "date_created": "May 24, 2014"},
{"id": "18ol6222bb84gdul", "rating": 5.0, "text": "Thoroughly enjoyed working here.  It was a contract position and I temporarily moved to Nanaimo after a 1 year term.", "pros": "Challenge, variety and good learning opportunities.", "cons": "No negative aspects to the job!", "date_created": "May 23, 2014"},
{"id": "18o5ej3svb80g8oe", "rating": 4.0, "text": "Awesome place to work. The colleagues were amazing and always made the work day fun.", "pros": null, "cons": null, "date_created": "May 17, 2014"},
{"id": "18nc676nub84gbqj", "rating": 3.0, "text": "Very entertaining line of work. Bit of a dull work environment though. Nonetheless, had a enjoyable time working there.", "pros": null, "cons": null, "date_created": "May 7, 2014"},
{"id": "18n9j54btb84gf64", "rating": 3.0, "text": "working for the city of Calgary , was so much fun and exciting, it was always positive , meeting new people, and driving different communities every day, new challenges . The management was awesome and co-workers was very nice.", "pros": "good life style", "cons": "split shift", "date_created": "May 6, 2014"},
{"id": "18m8ratomb84gccd", "rating": 4.0, "text": "Good Overall. Salary and Benefits are worthwhile but working shift work has it's sacrifices.", "pros": null, "cons": null, "date_created": "April 23, 2014"},
{"id": "18lm9f7muak8g9fs", "rating": 3.0, "text": "I liked working at The City. It was a great work place.\r* My first experience of working with the government\r* Complex reporting structures etc", "pros": null, "cons": null, "date_created": "April 16, 2014"},
{"id": "18kka86snak8gbjb", "rating": 3.0, "text": "I enjoyed working with my coworkers and their willingness to help each other make the day enjoyable. I didn't like the micromanagement and it can be improved in the future.", "pros": null, "cons": null, "date_created": "April 3, 2014"},
{"id": "18k5ckm88b84gds6", "rating": 4.0, "text": "Answer inquiries over the phone from citizens dealing with high levels of stress.", "pros": null, "cons": null, "date_created": "March 28, 2014"},
{"id": "18imm7hofak4ge56", "rating": 5.0, "text": "everyday you live as a new day ,nice company to work for and one of the largest employer in alberta", "pros": null, "cons": null, "date_created": "March 10, 2014"},
{"id": "18hqguq10b84gcth", "rating": 4.0, "text": "Excellent work options (work from home, compressed work week, flexible work hours)\rOpportunities for continuous learning\rOpportunities for job movement", "pros": null, "cons": null, "date_created": "February 27, 2014"},
{"id": "18hq37jduak4gete", "rating": 2.0, "text": "I work 12 hour rotating shifts... 2 day 2 nights and have a hard time finding a good balance here and with kids the12 hour shifts especially the night shifts are just not possible.", "pros": null, "cons": null, "date_created": "February 27, 2014"},
{"id": "18hj2bihiak4gcka", "rating": 5.0, "text": "Never woke up not wanting to go to work. Participated in TV, radio and print campaigns. See resume for full duties.", "pros": "Loved my job and excelled at it", "cons": "none", "date_created": "February 24, 2014"},
{"id": "18hg8rmfsb84gbnh", "rating": 5.0, "text": "For almost 25 years, the City of Calgary Fire Department provided myself with the opportunity to work a rewarding career and spend the time with my wfe and daughters. A change in career from the Offshore Drilling for eight years to make the committment to them to watch them grow and develop with a good education. \r The day was filled with team work of equipment checks and preparation, discussion of job expectations, roles and responsibilities and training. A major focus was on safety of my personnel and accountability of all at the  thousands of emergency incidents we attended over the years. \r There were always site/building inspections and pre-planning of communities and structures, hydrant testing, hose testing or involvement with our communities, day or night. \r We filled the interm with family discussion, cooking meals and playing sports.\r The family or brothers/sisters that we called each other established a bond with all 1200 firefighters and we had amazing committment from our Chiefs and administration support staff. \r I went from the young lad kicking in doors and fighting fires to being a mentor and providing the leadership to ensure our crews went home safely after every shift. \r I have waited for many years to see my children graduate university and start their paths and myself returning to the work I embraced everyday to support and supply our drilling crews with the tools and training they needed to work efficiently, effectively and safely.", "pros": "Having a great career that educated me, organization that empowered me yet still held me accountable for my actions.", "cons": "None really.", "date_created": "February 23, 2014"},
{"id": "18h5tnkvfb84gdit", "rating": 5.0, "text": "learned a great deal. excellent place to work, data entry of lots of invoices, auditing", "pros": null, "cons": null, "date_created": "February 19, 2014"},
{"id": "18fs4fheh5ncg8kk", "rating": 5.0, "text": "-Start at 6 A.M. file aprox. 200 documents after preparation, many hours of computer work and dealing with our customers all day long.\r-excellent people skills, computer skills\r-co-workers are great people to work with and very helpful\r-finding coverage so I can have breaks and putting in long hours\r-I know my job very well and take pride in doing a good job.  I find many opportunities to execute my talents and knowledge with this company. I call them my work family.", "pros": "Compressed work weeks, provided nice vacation time", "cons": "At times, long hours, large work load", "date_created": "February 3, 2014"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "18ddfgr5gb84gf52", "rating": 5.0, "text": "Very good experience, staff very accommodating, and welcoming to new individuals.", "pros": null, "cons": null, "date_created": "January 3, 2014"},
{"id": "18bd0r509b84gcrg", "rating": 5.0, "text": "I liked this job only it was seasonal, I worked with my own crew to get the job done. Was fun and easy and low stress,..", "pros": null, "cons": null, "date_created": "December 9, 2013"},
{"id": "18aiqc1elb84gfo6", "rating": 4.0, "text": "I enjoy working for the City of Calgary, it is a great employer with a ton of great benefits. A typical day consists of repair of multiple components on transit buses from front to back, top to bottom (excluding body work). My knowledge has certainly grown since starting with the city, my greatly in my understanding and ability to diagnose and repair electrical systems, drive system (axles etc.) not common to North America and management and interaction with fellow employees.The Hardest part of my job is the hours I work (time of day not quantity) and the most enjoyable part is the satisfaction I get from my contribution to the bigger picture of Calgary Transit.", "pros": "good pension, benefits, relaxed work environment", "cons": "slow movement in advancement", "date_created": "November 29, 2013"},
{"id": "18ab41pmcb84g8nr", "rating": 4.0, "text": "Took a refresher course in iRIMS,  and SharePoint.\rJob was easy to settle into as it was similar to what I did when working with the Federal Public Sector.\rLearned that the approval system was more lax in comparison to the Federal Public Sector. \rDifficult part of job:  Having to keep an eye on the clock as it was my responsibility to relieve the reception from the desk for her breaks.  It's easy to lose track of time when focusing on a particular project. \rMost enjoyable part of the job: being busy, allowed the day to pass quickly.  Colleagues had a good attitude providing humor in the workplace.", "pros": "Busy", "cons": "Replacing Reception", "date_created": "November 26, 2013"},
{"id": "189aemjd7b84gbbr", "rating": 5.0, "text": "Worked on a project for the summer but learned a lot and had a very good experience for my first job as a planner.", "pros": "Working with a number of great planners.", "cons": "It was only a summer job.", "date_created": "November 13, 2013"},
{"id": "1892kt2rlb80gbuq", "rating": 4.0, "text": "Good place to work in terms of pay and benefits for permanent workers. Managment is alright. But overall it is an easy-going plce to work", "pros": null, "cons": null, "date_created": "November 10, 2013"},
{"id": "188l7652eb84g9oa", "rating": 4.0, "text": "The City of Calgary is a diverse and inclusive workplace. Working for The City means exceptional benefits, a defined pension plan, work and life balance, learning and development opportunities, and multiple career paths.", "pros": null, "cons": null, "date_created": "November 5, 2013"},
{"id": "18807fkkkb84gdfj", "rating": 5.0, "text": "Great hours, great pay, great co-workers, great management. Overall a GREAT place to work!", "pros": null, "cons": null, "date_created": "October 28, 2013"},
{"id": "187qjicnpak8ga3b", "rating": 5.0, "text": "I am a seasonal employee with the City of Calgary, and it is a great place to work.\rI have had a great first season and look forward to many more and hope to become a permanent employee with the city.", "pros": null, "cons": null, "date_created": "October 26, 2013"},
{"id": "186po041aak4gcpu", "rating": 5.0, "text": "- Scanning, PO's, Statistical Analysis; Mail; Treasury; Cheque-runs; Filling; Procurement; ERP System updates; Livelink\r - Management always made it easy for me while studying in school. They gave me as many opportunities as they could while I was working as an Accounting Business Analyst. \r - Hardest Part of the Job: Able to find permanent role. \r - Most enjoyable: Management were friendly!", "pros": "Easy work environement", "cons": "Hard to find permanent work", "date_created": "October 13, 2013"},
{"id": "1850cblb2ak4gell", "rating": 4.0, "text": "Although a large organization all staff are willing to pull together to support the citizens of Calgary", "pros": null, "cons": null, "date_created": "September 21, 2013"},
{"id": "184nig8uvb84gbkk", "rating": 4.0, "text": "Has been a great experience working with the City of Calgary, it's a great environment for sharing ideas of how we can do what we do better and although it can be get very busy there is a can do attitude and teamwork.  I do love working for the City of Calgary.", "pros": "Job sharing and work/personal balance", "cons": "N/a", "date_created": "September 17, 2013"},
{"id": "184a3hbqhb84gc6b", "rating": 3.0, "text": "Very busy job. Contributed to the good of the department. I made the schedules for garbagemen.", "pros": null, "cons": null, "date_created": "September 12, 2013"},
{"id": "181asb37db84gcgg", "rating": 5.0, "text": "This is one of the better jobs that I have had.  Decent pay with three day weekends every weekend.  People are good for the most part and work is hard at times.  Being in shape will help you with this job.", "pros": null, "cons": null, "date_created": "August 6, 2013"},
{"id": "1807c0j03b84g9il", "rating": 5.0, "text": "Working at a landfill there really isn't a \"typical\" day of work. Our site is the only industrial landfill in the city and is very fast paced. Therefore everyday is different and i can be called to do many roles at any time. Just the tip of the ice berg I screen commercial loads and report any designated materials that need to be recycled/disposed of properly. Transfer drivers hauling clean-fill to the appropriate locations, landscaping, working on the chem-truck collection hazardous materials from the city's fire halls. I have learned so many different skills working with the City of Calgary a few include waste composition studies, recording weekly compost temperatures and how to handle hazardous materials. My co-workers are all great especially because i like to take it upon my self to be the site motivater and keep everyone working together. The hardest part was due to the Alberta 2013 flood it was hard to see citizens bringing in all there belongings to be disposed of. The best part of my job is i get to multi-task , try new and challenging tasks and of course work outdoors in all conditons. ", "pros": "Work outdoors, challenging environment, good people", "cons": "The landfill can smell pretty bad.", "date_created": "July 23, 2013"},
{"id": "180678a85b80g9bt", "rating": 4.0, "text": "Focus was safety and public relations. I operated various types of equipment as required.", "pros": "Geat retirement job.", "cons": "Heavily union influenced.", "date_created": "July 23, 2013"},
{"id": "17vp690jjae0gd61", "rating": 5.0, "text": "Set my priorities for work to be done with little direction after training in policies and procedures.  Fellow employees generally had lots of experience and this was respected by management and co-workers.  Learned about departments and what they actually do.  Worked in small teams to cross train, so we could help and cover for each other as necessary.  Sometimes differences in union agreements could be challenging although employer was working on making all agreements more similar.  The people I worked with were terrific, management always helpful, interaction with outside staff always timely and cooperation was great.", "pros": "4 day, 35 hour work week", "cons": "Travel time to and from work", "date_created": "July 18, 2013"},
{"id": "17s3cuchr5ncgfsi", "rating": 4.0, "text": "Great organization in many ways, great co-workers, however many cases of the wrong individuals getting promoted.", "pros": "benefits", "cons": "management", "date_created": "June 2, 2013"},
{"id": "17robk3qv5n8gcg3", "rating": 5.0, "text": "it is dynamic since you work with the public.  You learn tact and diplomacy. ", "pros": null, "cons": null, "date_created": "May 29, 2013"},
{"id": "17of8445jb84g9ci", "rating": 3.0, "text": "Working in Roads division, Bridge maintenance. The role of my employment with the city was many things, I did roles such as: Graffiti removal, Sand blasting, Pressure washing, Jack Hammering, Concrete mixing, pouring, and finishing, Asphalt repair work, Also a lot of the work done in these positions involved roads closure on busy streets within city limits. Very rewarding in the aspect of learning new skills.", "pros": null, "cons": null, "date_created": "April 18, 2013"},
{"id": "1dtkfp3a5q59n803", "rating": 4.0, "text": "They treat you like a person, not an employee. That’s reflected in the benefits and how management approaches employees, no yelling and screaming about challenges, just collaboration and ideas. The office environment is very fun, and expansive (can only speak for Seattle). It is a very challenging company due to the pace and ingenuity around every corner, which is awesome. If you apply yourself, you’ll go somewhere. Yes, office politics exist, but generally, it’s a meritocracy.”", "pros": null, "cons": null, "date_created": "January 2, 2020"},
{"id": "17n9m8uggb84g91h", "rating": 5.0, "text": "I enojyed all the different programs that I volunteered for. They gave everyone equal oppertunities and didn't discriminate against anyone.", "pros": null, "cons": null, "date_created": "April 3, 2013"},
{"id": "17ij8prvkb80g83i", "rating": 5.0, "text": "With working with the city of Calgary, was a great experience learning about park maintenance and working with a team.Machinery (trimmer)Learning about different flowers, trees, and how to trim or cut different plants.Hardest part was lifting heavy product, in the hot heatMost enjoyable was working in the sun and being outside, and working with your crew.", "pros": "good benefits, fruit days, and special lunch days", "cons": "working in hot heat", "date_created": "February 4, 2013"},
{"id": "17hpft1imb84gdkg", "rating": 3.0, "text": "This is a Secure job with great benefits and pay is decent (thou the intro rate is actually more like 29.50). If you enjoy working with plants and taking pride in your job then look else where. This is basically an outdoor janitor position in which you will be pooped on by the bosses and public. If you can hang in there for a decade or so (of only 6 months a year) then maybe you will become Fulltime (but dont hold your breath). The 4 or 3 day work week offers a good work/life balence but the 6 months off a year is hard to take. Have seen many of my quailifed friends leave for more satisfying positions else where.", "pros": "benefits, work/life balence", "cons": "seasonal, not much actual horticulture, lies, and more lies from management", "date_created": "January 25, 2013"},
{"id": "17e3e9b8n5dogcnc", "rating": 4.0, "text": "This was an excellent job in the fact that I was being employed to do what I loved, and use my passion as an instrument to help others. A typical day for me would include, arriving at one of the many mobile skate parks we had assembled around various communities in the city, and unlocking and positioning obstacles for the days activities. From there, me and another co-worker would teach a couple of the lessons scheduled for the day, each with a group of 10-18 kids per instructor. We would assess the children s skill levels, and base instruction accordingly. From there we would allow the children to have spare time where they could practice their newly learned skills, and converse and engage with them, until the parks closing time.I learned much from this job in regards to responsibility, care taking, and customer service. Speaking with the many children and parents I engaged with on a day to day basis helped me learn much about people, and was character developing for myself. It truly is amazing how much you can learn from people, especially children.The people I worked with were excellent individuals, with as much passion and drive as i had for this sport, which was refreshing. It seems hard to find jobs where people show up each day excited to be there and grow. The management was equally as energetic, and well organised.Sadly the pay was close to minimum wage, which with my debt to school, and living expenses, was sub-adequate.", "pros": "a job that payed me to do what i was passionate about, . was fulfilling in the fact that i could make a positive impact in many children s lives.", "cons": "pay was not adequate enough to support my needs.", "date_created": "December 10, 2012"},
{"id": "17d3smuo04e0g8tm", "rating": 3.0, "text": "Upper Management really needs to be more organized and realistic. If Management doesn't want employees to work late then they should be concise with their requests and expectations.", "pros": "job security, although the union only seems to protect the lazy and useless employees.", "cons": "the management disconnect that seems to occur within every business unit.", "date_created": "November 28, 2012"},
{"id": "17ckqqfh54e0gb15", "rating": 4.0, "text": "4 Stars, good solid company, decent pay, good work shifts. Learned to plan my day. My supervisor was a good man and stresses teamwork. I enjoyed the atmosphere.", "pros": "good work shift", "cons": "beauracracy", "date_created": "November 22, 2012"},
{"id": "17cdul1vb4e0galt", "rating": 4.0, "text": "It is quite typical to struggle when completing the scheduled day's work within the assigned shift. This can be attributed to weather, truck problems, occasional absenteeism, etc... This makes each day somewhat different from the previous one. One is constantly tested on everything that you think you have learned and this continues to augment your problem solving ability on a daily basis. Previous experience gained while working on the trucks in various capacities and subsequent courses help substantially in performing the tasks associated with being a foreman at the City of Calgary. Peer support is excellent while management has been very accommodating with my progression within the \"City\" and the experience has been extremely positive. The hardest part of the job is ironically also one of the most enjoyable parts as well… that being, working with people. Although training for a specific task is rewarding in of itself, the greater reward is garnered when you respect and have the respect of your peers, superiors and associates. In many ways this is an ideal work environment and hypothetically a person could work here until they are 85. However I have reached a point where I am seeking different horizons with different challenges.", "pros": "working and dealing with great people", "cons": "working and dealing with people", "date_created": "November 19, 2012"},
{"id": "17c0rv6q1adsge0i", "rating": 5.0, "text": "the cushiest job ever. wish i was able to go back.the most you work is 4 days a week.the supervisers are there too help", "pros": "everything", "cons": null, "date_created": "November 14, 2012"},
{"id": "17bn87rgu4e0g93m", "rating": 5.0, "text": "the work is very hectic but you get to interact with people and help them during a home disaster. The boss that manages this division is a very well aged and wise person. The people who work here are very comforting to be around and will help you advance in the job when they feel the time is right to do so. The most enjoyable part is spending the money you make here.", "pros": "awesome salary, good work.", "cons": "hectic. sometimes there is opportunity for serious errors to be made.", "date_created": "November 11, 2012"},
{"id": "17ba5u2t94dsg9ed", "rating": 4.0, "text": "I have been employed as a full-time temporary administrative assistant with The City of Calgary. This has provided me with several years' experience working in many different business units allowing me to cross-train in many areas. I have started many new assignments with little or no training thereby having to learn as I go. I have left a very positive impact on every business unit I have worked in. These included Calgary Police, Calgary Fire Department, Human Resources, Development and Building Approvals, to name a few.", "pros": "variety of work.", "cons": "commute.", "date_created": "November 6, 2012"},
{"id": "177v733d54e0g8ah", "rating": 5.0, "text": "I enjoy my positin with the City of Calgary. I enjoy the activity I have with the customers and the challenge this position offers. I have been doing this positon now heading for 16 years. My co-workers are very co-operative and easy to work with. The Management has been very good with helping me when I am behind due to overload of work. They have tried to accomodate with the work hours so I can balance my home life with work life. I have been doing records for a long time and have developed high organizational skills, how to deal with the public, and how to multi-task.", "pros": null, "cons": null, "date_created": "September 25, 2012"},
{"id": "176ongc90ae0gctv", "rating": 5.0, "text": "I worked for City of Calgary in 1991 and would like to work for them again. I loved working there.....had a great boss and very nice co-workers.", "pros": "job security", "cons": "work from downtown...parking problems", "date_created": "September 10, 2012"},
{"id": "176eemg645dogcr8", "rating": 5.0, "text": "I really enjoyed my time working with The City of Calgary. Everyday I would do something different. That's what I liked, no two days were ever the same. I love being busy and working hard. Sometimes the boxes were a little too heavy for me but the boys were great to help. I had a great boss.", "pros": "i didn't have to dress up", "cons": "your feet could get tired after a long day", "date_created": "September 6, 2012"},
{"id": "175ar29u35dsgcu7", "rating": 5.0, "text": "Planned and implemented an awareness program for able-bodied and disabled elementary school children.", "pros": "good employer", "cons": "challenging job", "date_created": "August 23, 2012"},
{"id": "1720m1ne6ae0g8hh", "rating": 4.0, "text": "Favorite position i ever held. Great people. Get to explore the city. Interact with all kinds of citizens. Great pay benefits and hours. Mon to thurs in summer and three day 12 hour shifts in winter. Deakling with trafic day to day was sometimes chllenging", "pros": null, "cons": null, "date_created": "July 13, 2012"},
{"id": "16sif8ng04dsgedc", "rating": 5.0, "text": "My day began at 5 am when i would muster for morning role call. Meet up with my spotting crew, ready the supplies for the day, review the roads to be marked and then we would take the neccessary equipment out to the job site. Close the lanes, close the road, follow behind the paving crew or spot (paint) the road in live traffic.The department i worked for was responsible for the whole city so the freedom to travel from 22x and spruce meadows to beddington and back to our shop on spring gardens was amazing.", "pros": "a real brotherhood of like minded individuals.", "cons": "a lot of different bosses to please.", "date_created": "May 6, 2012"},
{"id": "16s2t0rgn4dsgfmt", "rating": 4.0, "text": "I enjoyed my time at this shop.In my time with this company.IN my time with this company worked in several positions, I started in the re-finish shop and worked my way up the position of working shop fore man.The management and staff were fun, supportive ,encouraging,and skilled in all assets of th9is organization.There were very long days and many a week of six and seven day weeks.I always enjoyed delivering the automobiles. after it was re-paired and seeing mine and my fellow co workers skilled repairs", "pros": "a very strong company", "cons": "the lack of home and family time", "date_created": "April 30, 2012"},
{"id": "16rr3m5goae0gb2s", "rating": 4.0, "text": "Our Leisure Center is the hub of our community in the NE. There are always different community events going on, so part of our job was to stay informed of any OTHER activities that were advertised with our name but were not run directly by the City.", "pros": null, "cons": null, "date_created": "April 27, 2012"},
{"id": "16ou7tgig00007ov", "rating": 5.0, "text": "I only know how to work as a team player and look for a company with this atmosphere.I am experienced in many areas and am proficient in microsoft office.", "pros": "teamwork", "cons": "unhappy environment", "date_created": "March 22, 2012"},
{"id": "16dli20a800000dc", "rating": 4.0, "text": "very nice company to work for once your in. More job positions become available to you internaly.", "pros": "internal jobs available to you", "cons": "limited term jobs, can be laid off even before your end date", "date_created": "November 3, 2011"}
]