[
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "819d44e21d17c246", "rating": 5.0, "text": "What you put into this job is what you will get out of it, which for some people is nothing.  If you do it well and take the time to appreciate what a great opportunity it is, you'll have a good experience making the city and its parks better.", "pros": "", "cons": "", "date_created": "19 January 2020"},
{"id": "baadd8315e92ac93", "rating": 1.0, "text": "The environment was highly political with people looking to advance, even those in positions of authority, bullying those in lower positions by withholding information.  If you speak up, speak your mind or tell truth that is perceived as negative, you are listed as a troublemaker and your career will be very limited and you will not be granted opportunities to advance.  Promotion competitions are fixed with senior leaders choosing favourites and then rigging job competitions so that the favourites are successful  there is little room for positivity or creativity", "pros": "", "cons": "", "date_created": "18 January 2020"},
{"id": "a0a921e36edf4587", "rating": 3.0, "text": "collaborative environment,  lots of meetings. slow to adapt changes.\nI was a contract  project manager. City treats its employer with respect.\nGreat place to work. good benefits , unionized place.", "pros": "", "cons": "", "date_created": "17 January 2020"},
{"id": "446bfaa2d2eaebc7", "rating": 5.0, "text": "Nice and simple jobs. Can vary from customer service representatives to lifeguards to camp counselors. Meet new people and have some cool experiences.", "pros": "", "cons": "", "date_created": "17 January 2020"},
{"id": "98674dbe17ad966f", "rating": 4.0, "text": "Work was challenging and matched my interests and experience. Great co-workers. Was encouraged to reach out to other sections and departments to further the work of the portfolio management group.", "pros": "", "cons": "", "date_created": "16 January 2020"},
{"id": "0c2f396d69092fdb", "rating": 3.0, "text": "Great way to learn ne things and implement it to everyday life. Great place to work if you want to work with various sectors in the business field. I enjoy it", "pros": "", "cons": "", "date_created": "15 January 2020"},
{"id": "b5b95fa9c55a5957", "rating": 4.0, "text": "Great hours, great pay and great people. Only downfall is the amount of seasonal training involved in keeping your position and maintenance of qualifications throughout the year as they expire frequently.", "pros": "", "cons": "", "date_created": "13 January 2020"},
{"id": "956a2a1ed27826fa", "rating": 4.0, "text": "It was a great experience. I would recommend this job to people. I loved working with the kids and the staff was friendly. I just wish they would increase their pay a bit because it is a tasking job.", "pros": "", "cons": "", "date_created": "12 January 2020"},
{"id": "dc1fba227101dd1f", "rating": 3.0, "text": "Good company and benefits. If someone is looking for a job for life, the City of Toronto is a the place to work. You will interact with your coworkers, as well as the public. There are always opportunities to grow with management and it is truly a professionally run environment.", "pros": "", "cons": "", "date_created": "12 January 2020"},
{"id": "c42b3760669153f9", "rating": 3.0, "text": "Working in camps is a fun. If you enjoy program planning and playing games/sports this is a combination of working and playing. Sometimes is a group setting other times as an individual but there is always support staff available to assist.", "pros": "", "cons": "", "date_created": "12 January 2020"},
{"id": "b4483eae6c5910cd", "rating": 5.0, "text": "I was tasked with collecting survey data at Toronto youth centres in order to correct operational deficiencies. In addition, I analyzed the data collected through the surveys and presented the results to Toronto city councillors. I learned how to work in a group setting and learned about the role and responsibilities of our elected officials.", "pros": "", "cons": "", "date_created": "10 January 2020"},
{"id": "feef27fd17893c67", "rating": 3.0, "text": "No guarantees on the shift.management had favoritism. Some conmitted error no investigation is being done. Seniority is not a good idea .should be based on performance.", "pros": "", "cons": "", "date_created": "8 January 2020"},
{"id": "9211fb928ab74b1b", "rating": 5.0, "text": "If someone is looking for a job for life, the City of Toronto is a the place to work. You will interact with your coworkers, as well as the public. There are always opportunities to grow with management and it is truly a professionally run environment.", "pros": "", "cons": "", "date_created": "7 January 2020"},
{"id": "3f4a92b463c5120a", "rating": 5.0, "text": "Pays you fairly. One of the Best employer. If given a chance it would be nice to retire here but hard to get full time opportunity quickly. Senior staffs don’t retire and like to keep seniority.", "pros": "Good pay", "cons": "They pull you out to take you other floor", "date_created": "5 January 2020"},
{"id": "7c3275496cffe5ba", "rating": 4.0, "text": "The environment is relaxed and has a great culture of mutual respect between teams. The pace is slower than preferred however the project deliverable are clearly identified and communicated", "pros": "Friendly trusting team", "cons": "Slow pace", "date_created": "3 January 2020"},
{"id": "c1438cb5692cc8d8", "rating": 3.0, "text": "Over the years there were a lot of bumping going on and being placed in different jobs and different locations you were moved by seniority not by experience was not happy at the end put in for lots of jobs and never got 1interview at the end I quit cause of being hurried by management and union did not help", "pros": "", "cons": "", "date_created": "2 January 2020"},
{"id": "06906d8f86db3ad4", "rating": 5.0, "text": "If you know someone you will get a job. Favoritizim,you know the boss you got a job and fulltime. If they don’t like you stay parttime. Bulliying you puzzed you around. Till you get fired", "pros": "", "cons": "", "date_created": "1 January 2020"},
{"id": "5d6bb8280e89b748", "rating": 3.0, "text": "Before I started working there, I kept on hearing how great of an employer the City is and that it is one of the best employers, but working there, I have to disagree. The salary is great, but definitely unrepresentative of the work you do. Management constantly adds more tasks and workload that is out your job description because there is a serious lack of staff. The mentality there is do more with less. Benefits are not as great as they are made out to be; first time that I ever had to pay anything at the dentist after having work done and a lot of major things are not covered or require doctor referrals. There's a lack of flexibility when it comes to working. Although colleagues are nice and understanding, different departments don't work together creating issues for service delivery. Very little room for advancement; they prefer hiring externally than promoting from within, and very often, new supervisors come in lacking the experience and insight to make appropriate decisions or understand the needs of your position. Most people on contract for years and still not permanent.", "pros": "Salary, great colleagues", "cons": "Overworking, constant adding to job tasks, lack of flexibility, little room for advancement", "date_created": "28 December 2019"},
{"id": "bb556f0cf0bcec52", "rating": 5.0, "text": "I'm a current employee of the city of Toronto my supervisors are amazing to work with the people I work with are amazing everybody's so friendly I love working for the city", "pros": "Friendly people to work with", "cons": "None", "date_created": "27 December 2019"},
{"id": "2fd34cd05b2ad265", "rating": 5.0, "text": "It was a nice place to work. I was able to teach kids which I like etc etc. it was cool. and so on and so on wow 150 is alot this is useless im almost done.", "pros": "", "cons": "", "date_created": "26 December 2019"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "a65c94be9161081d", "rating": 4.0, "text": "I have worked at a variety of pools and my experience has been different every time.  Some pools mostly cater to serious swimmers and athletes, while others are for the general public.", "pros": "", "cons": "", "date_created": "26 December 2019"},
{"id": "44b0277cd59ad0f0", "rating": 4.0, "text": "Poor work environment with staff, too staff cleaks. Excellent work shops and hands on training. Too many protocols, Malvern has a toxic environment my last days were difficult.", "pros": "", "cons": "", "date_created": "23 December 2019"},
{"id": "a126ddb44ee1e617", "rating": 5.0, "text": "Children services is a great place to work especially if you’re looking to advance in your childcare career. Very flexible and fast paced at times but manageable. The only thing is that the benefits and vacations/personal could be better.", "pros": "", "cons": "", "date_created": "20 December 2019"},
{"id": "56b4a246adb76279", "rating": 4.0, "text": "Great job for a high school student looking to make some money. It's super relaxed, and extremely fun. Working with the kids is super fun, even if it can be a little tiring at times.", "pros": "", "cons": "", "date_created": "18 December 2019"},
{"id": "d109704d56dda883", "rating": 5.0, "text": "It was a great place to volunteer i got to meet new people and go places with the kids as well as looking after them it fun overall. Also the staff there was really nice", "pros": "visit places with the kids on trips and play games with the kids", "cons": "", "date_created": "13 December 2019"},
{"id": "12f8402eca20cd4e", "rating": 4.0, "text": "Overall it’s a great place to work at & I recommend it all the time.I have only worked here as a seasonal employee starting in March/2018 - Oct./18 then I was layed off and started work again in early April/2019 - Oct./2019 at which point I was layed off again.The job I do is Water Maintenance Worker 3.The job is great & suited to my abilities relative to working with heavy equipment,tools & machinery.ma", "pros": "Given responsibility to do work assigned on your own", "cons": "Difficult to get in fulltime", "date_created": "10 December 2019"},
{"id": "af45b67f7877392e", "rating": 4.0, "text": "Working with lots of children can be very stressful, even if it's something you enjoy. Relying on your coworkers and working as a team is very important. You'll meet a lot of different people and work with those fro all sorts of backgrounds, so it can be eye-opening. My boss is very busy and sometimes doesn't keep up to date with shift schedules, but he always does what he can to help out an employee.", "pros": "", "cons": "", "date_created": "9 December 2019"},
{"id": "8f1d0d9809dff5cc", "rating": 3.0, "text": "This job had a lot of potential. Management did little to improve environment and culture based on employee requests and suggestions. Provincial government  funding  cuts really damaged the program and made work regressive", "pros": "", "cons": "", "date_created": "9 December 2019"},
{"id": "6e534c1a21ecfd92", "rating": 5.0, "text": "Everything is lovely and well and everyone is nice and your coworkers always look out for u and it’s a friendly environment to work especially working with the youth", "pros": "", "cons": "", "date_created": "7 December 2019"},
{"id": "0723ab3bf7cf2b13", "rating": 4.0, "text": "The City of Toronto is a complex organization that is responsible for delivering services to a population of over 3 million people.  The range of services includes fire, police, transit, transportation, parks and infrastructure, water and sewer.", "pros": "", "cons": "", "date_created": "6 December 2019"},
{"id": "7a77b71d9c7c38f8", "rating": 4.0, "text": "Each day is something new to learn from my colleagues and clients. The knowledge each day wants me to always be on top of toes and seek resources available.", "pros": "", "cons": "", "date_created": "1 December 2019"},
{"id": "453640950d5532b2", "rating": 5.0, "text": "providing daily programming to children aged 6-12 while working alongside multiple other camp counsellors allowed me to develop my skills in leadership, organization, collaboration and many other. The workplace was welcoming and always ensured safety", "pros": "", "cons": "", "date_created": "28 November 2019"},
{"id": "9c4d69849baa34f4", "rating": 3.0, "text": "Mostly repetitive administrative work. Very difficult to move upwards and grow and develop in this company. Lots of training and changes in their system. Overall great learning opportunity.", "pros": "", "cons": "", "date_created": "27 November 2019"},
{"id": "4058f675dff03039", "rating": 4.0, "text": "If you’re in school and need a flexible job to accommodate your school schedule then this is for you. You can also move up in the city as once you’re in it’s easier to get hired internally. Seniority is big with the city as it can even come down to the wire of how much more minutes you work over someone else.", "pros": "", "cons": "", "date_created": "27 November 2019"},
{"id": "19f8371cc2833079", "rating": 5.0, "text": "The children were always excited to see you and there won't be a day that goes by that you won't enjoy working there. It is always fast-paced many children do love running off and you are needed to respond quickly.", "pros": "", "cons": "", "date_created": "26 November 2019"},
{"id": "6e62579949d95596", "rating": 5.0, "text": "Working at City of Toronto is glory lots of benefits,vacation etc.Less stressed with co-workers.Overtime is open to new workers.No sign-in/out just show-up.Your entitled to Government holiday-Remembrance day.... This work is the easiest compare to private a BIG difference.Im so lucky & proud to\nbe one of the employees. This is for my retirement too.Thank you Lord🙏", "pros": "", "cons": "", "date_created": "26 November 2019"},
{"id": "03328171e87c7193", "rating": 3.0, "text": "To work for the city you Must be able to work under pressure\nMust be a self starter and use initiative and will have to have a thick skin to deal with member of the public", "pros": "", "cons": "", "date_created": "21 November 2019"},
{"id": "e7abdf19d3bf42d9", "rating": 5.0, "text": "This job was by far the best job I have ever had. The staff & the work they do is phenomenal. Such an amazing environment to be working in with all these people", "pros": "", "cons": "", "date_created": "18 November 2019"},
{"id": "ddce71374e646ec8", "rating": 3.0, "text": "Management has failed to keep up with the changing conditions and stresses of recreation facilities in a large urban environment.  Too many times staff are asked to work alone in buildings that have already been identified as being in priority neighbourhoods which essentially means that the security threats in those buildings have been identified as high and demand at a minimum a back up staff resource to be available in case of an incident.  \"Risk Management\" is a common answer to concerns raised by staff in these areas as budget considerations trump safety considerations.", "pros": "", "cons": "", "date_created": "16 November 2019"},
{"id": "9197042c763dbf57", "rating": 2.0, "text": "Very oppressive / political. No one cares. Wasting money in IT. too many PMs. reduced work space. noisy and stressful. bosses don't have time to discuss.", "pros": "", "cons": "", "date_created": "16 November 2019"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "224d04e55f1c20d9", "rating": 3.0, "text": "I think the people that you meet are the best thing about this job. I work with kids (running different programs, camps etc.). The salary sucks because different jobs are different pay. And you might only get 1 job a week and programs only work for 2 hours. \nThe ability to advance in this sector is tough because its all about who's worked the most hours. I run 3 programs a week, I had to talk to my boss because financial it wasn't worth it for me to come in 3 days a week for 2 hours, I told them either put them in the same day or find someone else (obviously it was said much nicer), (I also work in a tough neighbourhood so people are hesitant to work their.\nPeople are willing to work with you which is great, my boss and supervisors are considerate and as my my second job I love it. I don't think its worth it full time. Once someone has a program/position its theirs until they quit so job security is there.", "pros": "", "cons": "", "date_created": "12 November 2019"},
{"id": "253bab0cb071591a", "rating": 4.0, "text": "A lot of time is required from both employees and consultants at the City of Toronto. There are always a very number of ongoing initiatives that conflict or have a dependency on one another. They are in the process of implementing a Managed Release Program which will resolve the issues generated by the vast workload and competing initatives", "pros": "", "cons": "", "date_created": "11 November 2019"},
{"id": "2977c3d49add677c", "rating": 4.0, "text": "If you like being involved within your community and enjoy working with the community demographics and youth, this is the place to work. In order to be considered qualified for the job, there are a few pre-requisites such as first aid, high five principles and other pieces of training and certifications. A typical day would be engaging with the youth in the space, setting up the room, and distributing snacks. I enjoy watching Netflix showing and play the PlayStation 4 with the youth.", "pros": "", "cons": "", "date_created": "11 November 2019"},
{"id": "f2e0173d47ec4233", "rating": 5.0, "text": "The best place to work for, good work quality, equal opportunity and good compensation. Work place culture is perfect, the hardest part of the job is that you have to be loyal to your manager or you will be kicked out\nthe most enjoyable is that you will meet with the elected politicians", "pros": "", "cons": "", "date_created": "10 November 2019"},
{"id": "4d37563aabebaa08", "rating": 4.0, "text": "Training for camp staff is surprisingly engaging. Everyone, councillors, coordinators, CRPs, are all active and enthusiastic. It can be fast passed but in a way that promotes productivity.", "pros": "", "cons": "", "date_created": "9 November 2019"},
{"id": "6fe2082afbc0d554", "rating": 4.0, "text": "Stable work environment, with some lack of team work. Hiring staff with very little experience . Lack of flexibility with scheduling leaves poor attitude and lots of staff taking advantage of system with sick days.", "pros": "", "cons": "", "date_created": "5 November 2019"},
{"id": "91be57849342560c", "rating": 5.0, "text": "Loved working for the city or toronto! Everyone was friendly and super supportive. Some supervisors however were not very knowledgeable and did t make great leaders. There is a lack of training so you really have to be able to figure things out for yourself", "pros": "", "cons": "", "date_created": "5 November 2019"},
{"id": "6201f5d342661984", "rating": 4.0, "text": "The City provides support on multiple levels, through management, in all situations.  Employees are engaging and hard-working.  As a summer camp employee, there are multiple socials thrown throughout the summer.", "pros": "", "cons": "", "date_created": "2 November 2019"},
{"id": "58171685593ea8ea", "rating": 4.0, "text": "it was a job. it wasnt hard. alot of guys dont like to work and others work too much. management at some yards dont have the time of day for their workers. supervisors and including the yard manager sit behind a door all day", "pros": "", "cons": "", "date_created": "30 October 2019"},
{"id": "9f722922dda7b410", "rating": 4.0, "text": "Overall, as a university student, this job provides flexible hours and it provides decent pay. Compared to other part time jobs, working with the City's recreation definetley is great.", "pros": "", "cons": "", "date_created": "29 October 2019"},
{"id": "ff101193afd67250", "rating": 5.0, "text": "thank you, i currently enjoy my job. \nit has been a great two years and i plan on staying with the city for a very long time. i feel grateful, i just wish i would be able to work the winter.", "pros": "", "cons": "", "date_created": "28 October 2019"},
{"id": "6de5f4232a228497", "rating": 5.0, "text": "management in aquatics isn't the best but the facilities are beautiful and most co workers are respectful. I would definitely recommend working here to a friend,", "pros": "", "cons": "", "date_created": "26 October 2019"},
{"id": "cee74dcf2232a887", "rating": 3.0, "text": "WWTP/ PLANT TECHNICIAN, we could use a lot of improvements at the facility. Housekeeping is a big problem in the plant AB. I feel there should be some in plant cleaners to help keep the common areas some what clean. As it stands now, the only cleaners (2) that I have seen are the cleaners who clean the change rooms daily our control room and WR are only cleaned once a week. Stair", "pros": "", "cons": "", "date_created": "25 October 2019"},
{"id": "d7f87c8fee901eb7", "rating": 5.0, "text": "Great place to learn about fundamentals of development as well as particular nuances in the relationship between public and private sectors. Great group of people with community oriented goals.", "pros": "", "cons": "", "date_created": "23 October 2019"},
{"id": "0e63ff5ce6c2afd7", "rating": 5.0, "text": "No complaints about the workplace, everyone is friendly\nmanagement is very understanding and typical day at work is full of laughs and getting the job done", "pros": "", "cons": "", "date_created": "22 October 2019"},
{"id": "e6ea72050ba69bda", "rating": 4.0, "text": "Specific for my work location.\nI never knew coming in, in the morning, what my day was going to bring.  I had ideas of what work would be done, but things frequently changed due to breakdowns and problems with equipment.  It made the days exciting.  Management were always supportive and willing to provide any resources required to achieve task and project completion.  Training and courses for career advancement were always available and encouraged. \nAs with any workplace, there are always those who don't realize what they have, but there are many people who strive to do more, to do better and to learn new skills on the job.  I have had the privilege of working with people who had amazing ideas, and great skills and we completed tasks and projects I never imagined I would ever be doing in my career.  Besides the really good pay, the city is a place that allowed me to make my job what I wanted it to be.  Having moved away from the GTA, I am going to miss my coworkers, the work, and working for the city and its people.", "pros": "", "cons": "", "date_created": "20 October 2019"},
{"id": "ef0eee7ac1f844f1", "rating": 5.0, "text": "There is allot to learn from your job at the city of Toronto the pay is great and you have good benefit. The management team can be difficult at times.", "pros": "", "cons": "", "date_created": "17 October 2019"},
{"id": "5f9643eb6959e1d3", "rating": 4.0, "text": "The City of Toronto is a large organization with over 44 Divisions.  The diversity of the people, roles and operations is a positive aspect of working at the City.  It is a great place to work with many opportunities available to employees. There is meaningful work afforded to the employees and there is a sense of accomplishment as a good corporate citizen.", "pros": "", "cons": "", "date_created": "10 October 2019"},
{"id": "76b4f02d31b34e2f", "rating": 4.0, "text": "working with the city of Toronto has been a great experience, the people are great, the work environment was great and so was the overall experience. highly recommend", "pros": "", "cons": "", "date_created": "10 October 2019"},
{"id": "34b1cf2fd7676147", "rating": 5.0, "text": "Retired with 31 years service moved to tillsonburg enjoy the slower pace and less traffic  3 years retired now saying I would like part time job like driving and being on the go", "pros": "", "cons": "", "date_created": "26 September 2019"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "2c3ac570ba7b22fe", "rating": 4.0, "text": "In my role introduced a complete automation solution that helps the business to translate business processes from static to a more dynamic and automated process.", "pros": "", "cons": "", "date_created": "26 September 2019"},
{"id": "863e5edf7023cd2a", "rating": 4.0, "text": "Although it is hard to become full time, working for the City is fun! Staff and management are amazing and there is always room to grow.  I would reccomend this for anyone.", "pros": "", "cons": "", "date_created": "24 September 2019"},
{"id": "04f01689d0500f99", "rating": 4.0, "text": "I've had the chance to move around within the company, Meet wonderful coworkers. I've also been able to receive training for new positions I obtained.", "pros": "", "cons": "", "date_created": "24 September 2019"},
{"id": "72c466a8aa42fc7c", "rating": 4.0, "text": "Never a typical day.  Things that might happen in a day could be Council or legislative meetings, press conferences, film shoots, events inside or outside the building, flag raisings, receptions, tower lightings, etc\nThe hardest part of the job is to balanced who requires service first \nThe best part of the job is meeting and working with new  people and working on new ideas and programs", "pros": "", "cons": "", "date_created": "20 September 2019"},
{"id": "2137e770863d9d02", "rating": 5.0, "text": "Great work place environment. Decent salary and friendly staff. Adaptable team .Would recommend workplace. Learned to interact with many different personalities.", "pros": "", "cons": "", "date_created": "17 September 2019"},
{"id": "a5fc5fe5c2c4132f", "rating": 5.0, "text": "great workplace environment, would highly recommend for those looking to advance on customer service skills and working directly with children in a safe environment.", "pros": "", "cons": "", "date_created": "16 September 2019"},
{"id": "9bc29dc629b2dee3", "rating": 4.0, "text": "All work and no appreciation.  Over worked and feels like you are salve there.  Just keep pushing you with no appreciation.  I love to work in goo environment and at this present time the managers there are not giving us that feeling.", "pros": "", "cons": "", "date_created": "13 September 2019"},
{"id": "646439d6e6353c12", "rating": 5.0, "text": "did not work in the bureaucracy.  worked for an elected official, which is much different.  knew some great people who worked in bureaucracy.  good place.", "pros": "", "cons": "", "date_created": "12 September 2019"},
{"id": "d9e03b5738a64f2d", "rating": 3.0, "text": "- fun to interact with co-workers participants and parents alike\n- sometimes it can be unorganized creating frustrating situations that could have been easily avoided", "pros": "", "cons": "coworkers may not always do the job to they're best ability", "date_created": "11 September 2019"},
{"id": "3af2523afc4a362a", "rating": 5.0, "text": "Working for the City is an amazing job.\nFull of opportinities to grow and go into different fields\nFlexible hours\nPay is great\nTraining always provided", "pros": "Pay is Great", "cons": "Management could be better", "date_created": "6 September 2019"},
{"id": "b3d28147bd79cced", "rating": 3.0, "text": "Needs to open more full time positions and offer more benefits. Needs to stop leaning more corporate and get back to the customer first approach. Should be more community focused.", "pros": "", "cons": "", "date_created": "5 September 2019"},
{"id": "d384863d9b0dc6d9", "rating": 5.0, "text": "It's very good place to work with the staff and the client. The pay is good as I worked from minimum wage to the wage i didn't even  expect. The benefit is the best part.i enjoy working for the city of Toronto  where we live where I work.🙏", "pros": "", "cons": "", "date_created": "30 August 2019"},
{"id": "18cb006c1541fc16", "rating": 4.0, "text": "Days largely consisted of in ward activities, interviewing and speaking with constituents in order to determine avenues to improve quality of life in the community. Flat management structure, generally worked independently.", "pros": "", "cons": "", "date_created": "27 August 2019"},
{"id": "e90e381842090f3c", "rating": 5.0, "text": "as manager of a team of employees the city is well organized and high quality to customer service\ngreat knowledgeable staff with loads of room for advancement \nwell organized and a happy environment", "pros": "", "cons": "", "date_created": "27 August 2019"},
{"id": "32af4be5437da8cb", "rating": 2.0, "text": "If you want to be in an environment where a union will always have your back this is the place to be. If you instead want to be more than just a number you should probably reconsider your choice.", "pros": "great union", "cons": "Over worked", "date_created": "26 August 2019"},
{"id": "9c389c9838bbad7f", "rating": 5.0, "text": "The City of Toronto is the place to be! Do not miss out on any opportunities here. A typical day is easygoing and fun, however, hard work is always completed.", "pros": "", "cons": "", "date_created": "24 August 2019"},
{"id": "db213808195498a3", "rating": 4.0, "text": "i would say it making friends  and making people happy?\ni love how Volunteering make me feel like i am giving back to the community...................", "pros": "free pizza", "cons": "standing out side in the rain", "date_created": "20 August 2019"},
{"id": "271ae7158d984ec1", "rating": 3.0, "text": "Aquatics staff are biased and uneducated...great job and easy money for a summer thing but don't recommend for anyone over 21... CRPs believe they are a lot smarter than they really are", "pros": "", "cons": "", "date_created": "12 August 2019"},
{"id": "d57536e15d13fc84", "rating": 4.0, "text": "The city of toronto parks. forestry and recreation is a great place to work at with the flexible hours and understanding management. Great work environment and fun people to work with.", "pros": "", "cons": "", "date_created": "11 August 2019"},
{"id": "64200f8aca68ba2e", "rating": 1.0, "text": "Extremely micro managed. Supervisors follow you to the bathroom. Management counts your minutes. Coordinators (escalation team) don’t know anymore than regular CSR’s and are completely useless. The years I was there I would feel absolutely stressed out walking into the office.", "pros": "People you work with", "cons": "Management supervisors micromanage.", "date_created": "1 August 2019"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "d19a6f3b4a46ce7d", "rating": 4.0, "text": "Working as a skate programs instructor is an enjoyable occupation. The staff are great and the participants are even better. Management could be a bit more understanding when it comes to certain things and the need to communicate better (at least in North York).", "pros": "excellent staff", "cons": "no cons", "date_created": "23 July 2019"},
{"id": "25f36cdb52de1152", "rating": 5.0, "text": "Meeting so many different cultures in one short day.\nEveryone is treated equally;no one is different.\nEveryone is treated with the up most respect and with confidentiality.", "pros": "Amazing people", "cons": "I won't be able to stay past October and then it ends. :(", "date_created": "15 July 2019"},
{"id": "b0aef64505ed16d0", "rating": 5.0, "text": "It's an amazing opportunity to get your foot into the door, especially since it is a city opportunity", "pros": "Work in various locations", "cons": "no consistency until your full time", "date_created": "14 July 2019"},
{"id": "5ebc5e1d09556da3", "rating": 5.0, "text": "The workplace is definitely an enjoyable work environment where employees would gain varous new skills and opportunities to advance to higher positions.", "pros": "", "cons": "", "date_created": "9 July 2019"},
{"id": "446c593bd9d9d8fb", "rating": 5.0, "text": "i volunteered here so I did not receive pay of course. People are nice and understanding though. I enjoyed my work here and learned a lot on how to be a better person", "pros": "make friends", "cons": "", "date_created": "5 July 2019"},
{"id": "fcdd4a3c1a7db5d6", "rating": 4.0, "text": "Help supervise kids and gather equipment necessary for water activities. Help keep attendance. The most enjoyable part of the job is seeing progress by your students in the water.", "pros": "", "cons": "", "date_created": "1 July 2019"},
{"id": "150fdf77e6e39d57", "rating": 5.0, "text": "I have been with the City of Toronto since last year I must say that the work environment is very nice staff included. We are treated fairly and never looked down as just a cleaner. There are going to be days when you are super busy especially during the winter. It does involve a lot of heavy lifting but for the most part I'm learning everyday on how to do minor repairs. You work and you learn and still get time to spend with your family.", "pros": "Great benefits and good pay and union", "cons": "Not enough shifts", "date_created": "25 June 2019"},
{"id": "9d39ec1c8f57e0da", "rating": 4.0, "text": "Working for the city is very rewarding. It is very rewarding to work as a civil servant and working for the city offers competitive wages and a healthy work life balance", "pros": "", "cons": "", "date_created": "24 June 2019"},
{"id": "81d7f4c1dcb7bc7f", "rating": 5.0, "text": "Responsibilities included handling highly confidential information/reports on office protocols and staffing issues. Responding to emails and phone calls on behalf of management.\nAbility to work in a collaborative team environment.\nCoordinate, prepared staffing expense reports in relation to travel & accommodations, registration for courses and seminars, and disbursement of petty cash to staff for sundry reimbursement expenses.\nHardest part of the job.....to ensure 100% customer service satisfaction at all times.\nMost enjoyable part of the job is \"multi-tasking\" and \"team work\".", "pros": "Ability to communicate with all levels of staff", "cons": "Overtime", "date_created": "23 June 2019"},
{"id": "3360133c07596112", "rating": 5.0, "text": "employees are very friendly, overall great experience. Only worked part time due to school and other activities, scheduling allowed for me to go to work and school without problems.", "pros": "public interactions", "cons": "none", "date_created": "16 June 2019"},
{"id": "ae143310783e60db", "rating": 5.0, "text": "Overall a very good place to work. I had a time working there. I was patrolling inside and outside of the the building, issuing pass to the employees and issuing pass to the contractors.", "pros": "", "cons": "", "date_created": "11 June 2019"},
{"id": "5d48bb1e13cc797b", "rating": 3.0, "text": "unable to comment at the present time, however, one lap in judgment one incident can cost you your job it doesn't matter how long you're with them and hard-working, dedicated and your job performance has been good.", "pros": "pay/benefit", "cons": "does not care about workers, you have no support from management", "date_created": "11 June 2019"},
{"id": "ff250fca45f70cb8", "rating": 2.0, "text": "Stay away from solid waste department, for city work it's under staffed overwork and underpaid. Yes the push you to the ground , lots of injured workers.  1/3 that takes end up quitting within the first week or two, and those who stay are dying to get out", "pros": "", "cons": "", "date_created": "3 June 2019"},
{"id": "b1b5949a27f19a0d", "rating": 4.0, "text": "This website is so stupid.  And they even built intelligence into the website as well.  It's making me type 150 characters of meaningless, useless information.", "pros": "", "cons": "", "date_created": "29 May 2019"},
{"id": "66eba40edff12820", "rating": 5.0, "text": "Working at the City of Toronto is really. I can get a lot done and gain so much knowledge and experience to better myself, and grow to the goal that I need.", "pros": "", "cons": "", "date_created": "28 May 2019"},
{"id": "cfe2e3461967094c", "rating": 3.0, "text": "Typical work day included site visits to multiple development projects. Coordinating with contractor, owner and consultants to ensure smooth transition of project. Inspection of construction to ensure adherence to City standards. Coordinate and chair progress meetings.", "pros": "", "cons": "", "date_created": "23 May 2019"},
{"id": "6328c046a28379da", "rating": 4.0, "text": "This job allows individuals to grow through the company, always offering advancement to anyone no matter their experience or age while also being an environment full of amazing people where you are able to build long-lasting relationships.", "pros": "", "cons": "", "date_created": "23 May 2019"},
{"id": "0e0a104faa31a804", "rating": 4.0, "text": "Working for the City of Toronto was a great experience. You get to learn how to interact with kids, develop leadership skills and learn to meet deadlines.", "pros": "", "cons": "", "date_created": "21 May 2019"},
{"id": "724d765190cfbfac", "rating": 2.0, "text": "No benefits or sick days ... the workstations are kept very untidy the database needs upgrade and overall its a little behind time when it comes to using the CLASS system", "pros": "", "cons": "", "date_created": "13 May 2019"},
{"id": "320bf5b410e31aae", "rating": 4.0, "text": "Worked as a volunteer, but couldn't find work after finishing my time. Counselors were great and the camp was run perfectly fine. Sometimes resources were depleted.", "pros": "", "cons": "", "date_created": "12 May 2019"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "788bd6ae8b9521e0", "rating": 5.0, "text": "Enjoy working with the public executing instruction.  It is wonderful to see the joy the classes bring to the patrons that participate and engage in the exercises instructed.", "pros": "Pleasant work environment.", "cons": "", "date_created": "11 May 2019"},
{"id": "c4c5a89bdd9c18f5", "rating": 4.0, "text": "The culture of \"leave it alone, dont pay attention and hide details\" is getting old. There needs to be more transparency with management. Good place to work otherwise", "pros": "", "cons": "", "date_created": "9 May 2019"},
{"id": "646a947e887d9ed0", "rating": 4.0, "text": "Challenging and varying work roles to keep day to day work interesting in a variety of roles. Numerous opportunities for advancement and lateral job transfers. Great people and fun work environment. Rewarding work serving the public.", "pros": "", "cons": "", "date_created": "6 May 2019"},
{"id": "0c05248ce17b0cc1", "rating": 3.0, "text": "Working for the city is like school. It is ok for its purpose but it's kinda boring. You go in a do your work and then you sign out. If you get stuck with a bad CRP it can really suck.", "pros": "", "cons": "", "date_created": "5 May 2019"},
{"id": "7ff193399057cbed", "rating": 3.0, "text": "Overall working experience was great. Being able to work with age groups from Toddlers to Youth in hands on programs from Ball Hockey to Cooking and just learning from one another.", "pros": "Fun environment while working with participants", "cons": "Having to navigate toxicity among Staff & Management professionally", "date_created": "5 May 2019"},
{"id": "942d77c94986da5f", "rating": 5.0, "text": "City of Toronto staff allow for learning and growth at every opportunity, allowing for your creative input to always be heard. Staff are always very positive and open to new ideas", "pros": "", "cons": "", "date_created": "4 May 2019"},
{"id": "23fcc9fdef54b27e", "rating": 4.0, "text": "They rounded up my hours to 40 instead of giving me 35. Everyone was pretty nice. Sometimes management at the summer camps was annoying, but most of the camp leaders were pretty good people.", "pros": "", "cons": "", "date_created": "2 May 2019"},
{"id": "20ebbb7422c9a773", "rating": 4.0, "text": "A typical day includes skating, supervising the ice, communicating with participants, making sure everyone is following the set rules, customer service, always being aware of your surroundings, following protocol in case of an emergency or incident, knowing where all necessary equipment is kept (ie. AED, emergency phone numbers, First Aid Kit, etc.).", "pros": "", "cons": "", "date_created": "1 May 2019"},
{"id": "6e3feaa5a46bd655", "rating": 5.0, "text": "Working in a great work environment with great staff.  No matter what region, the staff is helpful and friendly.  There is an abundance of training which helps you feel prepared when you work", "pros": "", "cons": "", "date_created": "28 April 2019"},
{"id": "13b2a8c36d149d7e", "rating": 4.0, "text": "The work was pretty straight forward. However it became very evident that not every child was the same. You had to learn how to adapt your teachings to every individual child and then take the time to make sure they understood the process and their own speed.", "pros": "", "cons": "", "date_created": "24 April 2019"},
{"id": "6a569340f87e7e25", "rating": 2.0, "text": "Long working hours. Managers not very knowledgeble allowing consultants to run the place.\nUnionized culture with no incentives to improve performance.", "pros": "Competitive", "cons": "long hours", "date_created": "23 April 2019"},
{"id": "07f454cfa05563b3", "rating": 4.0, "text": "- Developed strong relationship with kids, their guardians, and co-workers.\n- Learned how to work in a face pace setting.\n- Learned how to become proactive.\n- Really enjoyed working and building relationships with the staff and kids in the program.", "pros": "Developing my skills", "cons": "difficult to please all kids in the program", "date_created": "22 April 2019"},
{"id": "18f7c3985a601507", "rating": 5.0, "text": "enjoyed working for the city since 2013, good work environment and good people to work with. Good shift hours and pay rate. Nothing to complain about.", "pros": "", "cons": "", "date_created": "16 April 2019"},
{"id": "ee673222077c3dc2", "rating": 5.0, "text": "I worked at the City of Toronto as a Contractor (1 year, with no extension).\nIt is a great place to work at, with lots of training and learning opportunities.", "pros": "work life balance", "cons": "contract job", "date_created": "15 April 2019"},
{"id": "ef5eb81e61253e91", "rating": 5.0, "text": "great place to work. amazing benefits, vacation time, sick time for your family. room for advancement,they provide equipment. they offer a lot to people", "pros": "great place to work", "cons": "none", "date_created": "15 April 2019"},
{"id": "46f32a1bb4aa8662", "rating": 2.0, "text": "The culture was like all work places that have unqualified people in management. It is a tough place to work, since you are always looking over your shoulder.", "pros": "Good money and benifits", "cons": "Unqualified management, high employee turnover", "date_created": "13 April 2019"},
{"id": "346af918558d4da2", "rating": 5.0, "text": "A product workplace with understanding staff. The job always encourages me to do my best and has been very helpful with achieving and striving to complete my goals.", "pros": "Free Lunches", "cons": "", "date_created": "13 April 2019"},
{"id": "b1a6f9ce5d0e61f6", "rating": 5.0, "text": "Incredible staff, amazing management. Really good wages for students and offers one of the best student/youth jobs out there. Great union as well, and an overall great community.", "pros": "", "cons": "", "date_created": "13 April 2019"},
{"id": "6c41ad0f352ddb42", "rating": 5.0, "text": "Toronto, the capital of the province of Ontario, is a major Canadian city along Lake Ontario’s northwestern shore. It's a dynamic metropolis with a core of soaring skyscrapers, all dwarfed by the iconic, free-standing CN Tower. Toronto also has many green spaces, from the orderly oval of Queen’s Park to 400-acre High Park and its trails, sports facilities and zoo.", "pros": "", "cons": "", "date_created": "7 April 2019"},
{"id": "7762c148a8ebf39a", "rating": 2.0, "text": "The city of Toronto consistently and systematically underpays the lifeguards and wading pool attendants by about $100 each per month and attempting to have this issue resolved was very frustrating.", "pros": "", "cons": "", "date_created": "1 April 2019"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "be1410f5eab2f98d", "rating": 1.0, "text": "PPFA is the worst manage department ! \nIf you are 2 min late you have to send an email to your supervisor to let them know when you will make up the time. \nFavoritism in the department.  \nHourly rate and you are only paid for 7.25 hours per week.\nHorrible management- very sickening place", "pros": "Nice co-workers", "cons": "Horrible management- very sickening place", "date_created": "26 March 2019"},
{"id": "571ba5955ad03012", "rating": 5.0, "text": "The City of Toronto employers know that people have to balance a job and an at home life, so they make schedules extremely flexible. Picking up and dropping shifts is very easy.", "pros": "", "cons": "", "date_created": "20 March 2019"},
{"id": "fe2f1e71471ac93c", "rating": 5.0, "text": "City of toronto provides such an extensive job experience that is enjoyable and secure. my time working with the city was always fun and professional there has never been a dull moment", "pros": "professional and fun", "cons": "nothing", "date_created": "14 March 2019"},
{"id": "46c90baf3a602264", "rating": 4.0, "text": "As a front-line Civil Servant and Advocate, I’ve worked in various departments and in all areas of the City most affected by the need for social-assisted programs. Developing trust, respect and care for families, children, and senior citizens was always top priority", "pros": "Constant learning and developing of skills and personal performance", "cons": "Political and Budget restrictions for program development", "date_created": "14 March 2019"},
{"id": "fb93e43acd3d8d2a", "rating": 2.0, "text": "No particular experience was gained.\nAs minimum wages went up, part time salary stayed the same.\nPart time management was bias\nLots of workplace drama for a part time", "pros": "", "cons": "", "date_created": "12 March 2019"},
{"id": "ace6a5c02fba47c7", "rating": 4.0, "text": "Public service can be a rewarding work choice. \nManagement here is typical government multi layered environment.\nGender and age discrimination is unfortunately an issue with the City of Toronto HR Department.", "pros": "salary", "cons": "Age discrimination", "date_created": "10 March 2019"},
{"id": "1c71051b3ff0b0a0", "rating": 5.0, "text": "I learned about different aspects of the city and got engaged with many different people who were open  and explained what we had to do effectively and properely, The management did a well done job. The most enjoyable part of working on election day was the energy that was around, everyone was cheerful and I will definitely come back every year to work .", "pros": "reward after", "cons": "it was colf", "date_created": "1 March 2019"},
{"id": "6048c712a393a4cf", "rating": 5.0, "text": "great place to work with co workers and environment was peaceful and a learning experience working with and helping the trade union workers and my skills", "pros": "learning all the time", "cons": "none", "date_created": "1 March 2019"},
{"id": "fdf0fd967e87c9f7", "rating": 1.0, "text": "Fleet services within the City of Toronto is so top heavy!\nContracted out all light duty vehicles and its the matter of time the rest is gone.\nHalf the fleet is old worn out junk,and they wonder way it costs so much to repair....The repair shops are old,just like the mechanics!\nDesigned to fail.\ngood luck....", "pros": "", "cons": "", "date_created": "25 February 2019"},
{"id": "8bfb9c23594626f8", "rating": 3.0, "text": "Great place to start your career and get an idea of if you want to go the public sector or private/corporate route. The pace of work is moderate. You will learn some key fundamental work life skills.", "pros": "", "cons": "", "date_created": "19 February 2019"},
{"id": "8518b51266d0ff22", "rating": 3.0, "text": "Working for the City of Toronto for the past 6 years has been an uphill climb. A day in children services is never the same. A typical day consist of preparing daily delivered food items for the children for their lunch. Wash, peel, cut vegetables, fruits and other food items for the daily snacks and lunches. Maintain a clean and sanitary work environment daily. Interact with parents and staff throughout the day as well.\nAs of right now, I don't find anything hard or difficult at the child care center I work at. Each day provides challenges which I can handle appropriately. The most enjoyable part of my day is seeing all the smiling faces of the children I serve, they really make my day go by fast.", "pros": "Freedom to work alone, benefits, hourly wage", "cons": "Short hours, part time work", "date_created": "15 February 2019"},
{"id": "5907d193863908a8", "rating": 3.0, "text": "A good and interesting place to work, depending on which location, great to work with people and youth around your age, lots of opportunity for initiative.", "pros": "", "cons": "", "date_created": "13 February 2019"},
{"id": "84dc728b7a7da1c8", "rating": 5.0, "text": "The city of Toronto is a good company to work for.  Once you are hired, and have a position it is easy to 'own' that position meaning you can work the same shift the following year.  It is easy to get new positions at different locations as you progress your work experience.", "pros": "Flexible hours, easy to find releif staff", "cons": "Sometimes tiring in the summer heat with many kids", "date_created": "12 February 2019"},
{"id": "b432d67a93f4d973", "rating": 5.0, "text": "very great organization to work for\nalways has overtime when you need it\nManagement treats you with respect\nHealth and safety comes first which most places don't go by now of days", "pros": "respectful, Professional, health and safety comes first", "cons": "", "date_created": "7 February 2019"},
{"id": "2213ad42a2e6b407", "rating": 5.0, "text": "- work days were well structured \n- classes were organized very well\n- student lists were always provided\n-they took care of the grounds and maintained everything with proper cleanliness", "pros": "Great hours", "cons": "Hard to get more hours", "date_created": "5 February 2019"},
{"id": "d203147bef3bbc6a", "rating": 5.0, "text": "Great team of people to work with and is was a very fun environment to work in. Very organised and discipline. All workers were very punctual and friendly.", "pros": "", "cons": "", "date_created": "4 February 2019"},
{"id": "e693afb4233cca72", "rating": 4.0, "text": "working with campers and helping them with things. Watching over them while they played, also watched over them on the field trips. Making crafts with them and getting to know them better.", "pros": "getting to know the children and staff", "cons": "long day", "date_created": "31 January 2019"},
{"id": "9df7d2d5e9c5239f", "rating": 4.0, "text": "pace is slower but keeps one busy enough; no advancement but you are secure in your position. Strict policy environment may not be suitable for growth. but people are nice.", "pros": "", "cons": "", "date_created": "31 January 2019"},
{"id": "2b088f1d08c33225", "rating": 4.0, "text": "time management is very important to overall productivity. Manage outward apperence be repectful and assist the general l public in a safe and decent manner.", "pros": "good breakfast of work performance", "cons": "long hours", "date_created": "30 January 2019"},
{"id": "32d0bab78c128f28", "rating": 5.0, "text": "iT WAS GOOD, i liked the way the company was able to treat the workers and make sure everyone knew the job that they had to focus upon theroughoutt their day to day.", "pros": "", "cons": "", "date_created": "30 January 2019"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "1f06d70b0302a202", "rating": 3.0, "text": "The line of problems start from the top and trickle down. It has everything to do with who you work with and most people there are too comfortable and treat their work and coworkers as such. Wouldn't recommend it unless you're trying to move up and make it better.", "pros": "pretty good wage, easy to move up and good job security", "cons": "unbearable work conditions at times due to staff", "date_created": "29 January 2019"},
{"id": "2f8320f78a0e3553", "rating": 5.0, "text": "I worked in various capacities for the city, and enjoyed them all thoroughly. I was well trained, supported, and very fairly paid. The focus is on fun and education, and the facilities are safe and well tended.", "pros": "", "cons": "", "date_created": "28 January 2019"},
{"id": "8a902c2348a7c055", "rating": 5.0, "text": "It was only a one day job for the municipal elections. Very straight forward on what to do and the pay was pretty good. Must bring your own lunch and something to occupy yourself", "pros": "", "cons": "", "date_created": "25 January 2019"},
{"id": "bbeda778105b0769", "rating": 5.0, "text": "wonderful working atmosphere.  I had the opportunity to meet very many families and truly make a difference in their lives. I would highly recommend anyone to work within the city.", "pros": "Lots", "cons": "Nothing", "date_created": "22 January 2019"},
{"id": "6de14cac72eee15b", "rating": 5.0, "text": "the city of Toronto is great because is a place where you can apply for many opportunities. The city of Toronto has so many branches that allows for many opportunities.", "pros": "", "cons": "", "date_created": "19 January 2019"},
{"id": "7f92de6cb5032a78", "rating": 5.0, "text": "a typical day at work, come in and do the daily required duties, and work on your project. Lots of self development training available,\nCo-workers are not always helpful to each other", "pros": "good benifits", "cons": "none", "date_created": "18 January 2019"},
{"id": "aa2d3ee234998edf", "rating": 4.0, "text": "very busy answering phones dealing with some angry angry people, most were nice to talk to. People that yell and scream and swear at someone you don't know is a coward. You made my day awful.", "pros": "good coworkers", "cons": "rotten people public", "date_created": "16 January 2019"},
{"id": "9fb3704635194c8a", "rating": 3.0, "text": "Can only advance if you know someone in a supervisory role. They are young and hire all their friends, leaving the workers no room to advance. They provide poor working conditions. You are in the sun all day long with no shade. They do not provide umbrellas, or rain gear - as you are expected to wait for the rain out.", "pros": "", "cons": "", "date_created": "15 January 2019"},
{"id": "ed4477267829f60d", "rating": 5.0, "text": "Everybody was very fun to work with we all enjoyed doing our jobs even though there were a few things that were not beneficial such as the job described.", "pros": "Friendly environment", "cons": "No benefits", "date_created": "14 January 2019"},
{"id": "e26eea47349f384c", "rating": 5.0, "text": "Very good option to do your volunteer hours for high school. Very good coworkers to work with. Very easy to collect the 40 hours to require for high school.", "pros": "", "cons": "", "date_created": "13 January 2019"},
{"id": "d3fef3d1fcba2d96", "rating": 4.0, "text": "Great place to work. \n- Pay is above minimum wage for most part time positions \n- Fantastic environment, especially for young people\n- Very inclusive\n- Management was very supportive and professional", "pros": "large organization", "cons": "long commutes for most", "date_created": "10 January 2019"},
{"id": "b74e9b27e7f01c61", "rating": 5.0, "text": "I have always loved working for the city. The kids are great and the people whom you get to work with are usually very fun and easy to get along with.", "pros": "fun", "cons": "annoying kids sometimes", "date_created": "9 January 2019"},
{"id": "80c1e370f20c56cb", "rating": 4.0, "text": "Great Organization, the work life balance is good.  Enjoyed working with different department, great administrative support.  Great Benefit, and love the environment, fun atmosphere.", "pros": "", "cons": "", "date_created": "9 January 2019"},
{"id": "977cf957f326d1dc", "rating": 5.0, "text": "Amazing place to work with lots of opportunity to grow.  There were many opportunities to enhance your qualifications. The atmosphere was warm and fun.", "pros": "Pay and Benefits", "cons": "none", "date_created": "8 January 2019"},
{"id": "cb319c1b3abf79d2", "rating": 5.0, "text": "It was a great experience working as Election assistant. It was a great learning with great team lead. The working environment was fantastic and the flexibility was good.", "pros": "", "cons": "", "date_created": "8 January 2019"},
{"id": "e273e4ef06e4dec8", "rating": 5.0, "text": "I worked as a Team Leader for Diversion Program Assistant (DPA) with the City of Toronto. I was responsible for training of new hires, organize and plan daily work schedule to meet deadlines according to the routes, maps and multi-residential audits for identifying contamination in the recycling waste. I was able to establish, update and revise waste management service levels by interacting with Supervisors, external and internal staff on a day to day basis regarding the progress of the audits. I currently possess a valid G-permit for the City of Toronto. As a DPA, I was able to take initiatives and implement new strategies for the projects by analyzing information gathered through research, public consultation and pilot programs.  I have been part of commercial audits for verifying and gathering new City of Toronto customers for Solid Waste Division, Front End contamination audits for recycling, TCHC audits for safe recycling and garbage collection under the guidelines from Toronto fire, and York University curb side audits. My past work experience and current position has given me great interpersonal skills and communication skills including conflict resolution, problem solving, decision making and situational assessment. I adopt well to working beyond normal work days as requested, under varying climate conditions. I can work with minimum supervision and plan and execute tasks with the ability to set priorities.", "pros": "", "cons": "", "date_created": "4 January 2019"},
{"id": "0460bbebc2dc53a7", "rating": 5.0, "text": "My career was very rewarding, I worked with an amazing team in the last several years. \nI was fortunate to be able to be part of both GTA and International investigations.\nA need for more front line officers is paramount.\nThe feedback I am hearing is that overall moral is quite low and the pressure for these members to do more with less is more prominent than ever.", "pros": "Team concept", "cons": "None", "date_created": "4 January 2019"},
{"id": "1b3dafcdabdbd192", "rating": 5.0, "text": "Dealing with public questions about upcoming city election.  Provided answers.  If they required additional information forwarded them to appropriate personnel. Management was excellent.  Great place to work.", "pros": "", "cons": "", "date_created": "3 January 2019"},
{"id": "a9338df4bea6597e", "rating": 3.0, "text": "Do not want to participate in this process. This should be an optional process and should not be mandatory. The culture here is extremely poor and staff do not realize how good they have it in comparison to the private sector.", "pros": "", "cons": "", "date_created": "20 November 2018"},
{"id": "b8467ba4b9d74aaf", "rating": 5.0, "text": "Working in recreation is fun and insightful at the time, but the location I work at does not provide job security as it is an emergency centre and you could lose your hours at any moment due to it being a reception centre or warming centre for the homeless.", "pros": "", "cons": "", "date_created": "17 November 2018"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "7a57fb5733167310", "rating": 4.0, "text": "From the CIO down, the culture is great.  Everyone's focused on doing their best and accomplishing great things.\nThe teamwork and collaboration is inspiring.", "pros": "Great company, great culture.", "cons": "It's politics, so things move slowly.", "date_created": "12 November 2018"},
{"id": "11d62dff551072d7", "rating": 5.0, "text": "I had a great time working for the City of Toronto. It grew me into the interest of working with children but also children in conflict with the law and wanting to know that when we send our children out to these programs and facilities that there getting as much support as they can.", "pros": "", "cons": "", "date_created": "5 November 2018"},
{"id": "a28c742dd2fb491d", "rating": 5.0, "text": "Working for the City of Toronto is definitely a rewarding experience. The kids and staff are all kind. The work environment is amazing. Programs are offered for kids throughout the week and on weekends.", "pros": "", "cons": "", "date_created": "5 November 2018"},
{"id": "36e94c10361910f5", "rating": 5.0, "text": "Fun workplace with positive energy and amazing staff. Provides safety for staff members and proper means of coverage. Well organized and informative while still being fun.", "pros": "", "cons": "", "date_created": "2 November 2018"},
{"id": "4a19dbdafb612c33", "rating": 4.0, "text": "Knowledgeable and efficient staff working towards common goals while improving our City to provide a better experience for our residents and visitors from around the world.", "pros": "", "cons": "", "date_created": "31 October 2018"},
{"id": "d327eef7c24884e3", "rating": 4.0, "text": "A typical day included watching patrons safety from a assigned post that was on a rotating circuit for the lifeguard job. Jobs included; aiding elderly out of water, weak swimming children...etc. management was fairly strict depending on who was my manager so you needed to keep strong work culture.", "pros": "fun, sociable, free use of certain equipment during hours", "cons": "complex hours, having to work outside of my job hours", "date_created": "27 October 2018"},
{"id": "c9eac82f217d840d", "rating": 4.0, "text": "Working as a Lifeguard will always have its ups and downs but with the City of Toronto, you're always surrounded by great people and great work, although sometimes it can be hard to find enough hours for a session (but that's why taking a spare shift is great).", "pros": "", "cons": "", "date_created": "26 October 2018"},
{"id": "0501eaf1fe7b33fc", "rating": 5.0, "text": "The people were fabulous to work with. They were kind, friendly and treated me like family.\nI enjoyed all parts of my job. The management was amazing - very supportive. I learned a lot about EQ and about Document Management at the City", "pros": "Great people", "cons": "", "date_created": "23 October 2018"},
{"id": "b17ae0dcd9008f26", "rating": 3.0, "text": "Answering inquiries for resident in the city of Toronto in regards to property tax and city related issues such as roads, garbage collection and city bylaws.", "pros": "", "cons": "", "date_created": "22 October 2018"},
{"id": "82237a603e399ebd", "rating": 2.0, "text": "They are an equa opportunity employer.  Renumeration is good.  Good work culture.  No bullying.  No cameling.  Don't dump all the work on one employee.  Employee relations.  Friends at work.", "pros": "Union and pention", "cons": "Night shift", "date_created": "22 October 2018"},
{"id": "67b4101c13c27529", "rating": 1.0, "text": "If you like being a Yes man and not following the post orders that every security guard is supposed to follow then this place is perfect for you.  If you stand your ground in what you believe in they will do everything in their power to get rid of you.  \nAlmost everyone that is a security guard there is related to someone in the City of Toronto.  \nIf you like you co workers pretending to be your friend then snitching to the manager or senior officer about you , you're work or you're life then this job is perfect for you.\nIf you want a Manager that used to be a Zamboni driver and has no idea what security is about then this is perfect for you.\nIf you want to be micro managed like a little kid in gr 1 then this job is for you.\nHorrible management.  There is no union to protect you.  The money seems good at first but after a while you see that its all a set up.  You can never move into other city of toronto jobs because its the only department that is non unionized and every job I applied to said \"You do not belong to CUPE local 179 or something like that. Sorry we can not consider you.\nThus you stay an overpaid security guard with all gremlins around you", "pros": "no", "cons": "Management from the TOP Down is Corrupt", "date_created": "21 October 2018"},
{"id": "c7b0b7e97b2ad049", "rating": 4.0, "text": "Working as a part-time worker was okay. The pay for your job is always minimum and you get the money for what you work for. The demand is always high but the working expectations is also high.", "pros": "lots of jobs", "cons": "mimimum pay, no breaks", "date_created": "19 October 2018"},
{"id": "4b3460661d74071d", "rating": 4.0, "text": "The City Of Toronto is what the vision of what diversity would look like. The city of Toronto is full with a verity of different programs, activities and lesson plans, it is the place where you can be apart of the city and learn about the many opportunities made available to the public and any one that will take the time to ask question. \nMy idea job is being a member of the city of Toronto and learning how to make it better for others.\nThank you", "pros": "Feeding employs during training", "cons": "Computer systems, soft coding issues", "date_created": "18 October 2018"},
{"id": "7d010519709addc9", "rating": 4.0, "text": "Management tries their best to schedule but it  isn't doesn't always done properly. Hours are small and if you plan on working a full 40 hours then you will get weird hours and lose on on your social life a bit. But Coworkers are usually very friendly.", "pros": "", "cons": "", "date_created": "12 October 2018"},
{"id": "0ffee57fcb6ba359", "rating": 1.0, "text": "As a part time worker for the past 10 years. I have witnessed the decline in the way staff are treated, the abuse of power from higher ups, favouritism, lack of support, and professionalism is no where to be found. It's almost like high school with the amount of gossiping that goes on.", "pros": "", "cons": "", "date_created": "9 October 2018"},
{"id": "506e2faaa1369ad7", "rating": 5.0, "text": "Being apart of recreation programs is a fun part time job. \nIts a great position while youre in school or on the side of a full time job. \nThe staff are great and easy going.", "pros": "Fun, Active", "cons": "short hours", "date_created": "3 October 2018"},
{"id": "ef8631f8b7d04098", "rating": 5.0, "text": "i like showing up to work everyday because everyday brings new adventures. The staff are great and the public they have there good days and there bad but overall i would recommend anyone who is looking for a job apply with city", "pros": "", "cons": "", "date_created": "29 September 2018"},
{"id": "3c69389c04ec48d6", "rating": 5.0, "text": "Good working conditions with market rate salary and benefits. Medical and Dental benefits are considered to be the highest in Ontario. Vacation benefits are very good.", "pros": "Very interesting and challenging work", "cons": "Internal favouratism is prevalent", "date_created": "15 September 2018"},
{"id": "4c8f2a8e9c6051ba", "rating": 4.0, "text": "Very good part time hours. Fellow co-workers are usually friendly and helpful. Hardest part of the job is dealing with the public, they think you owe them something.", "pros": "", "cons": "", "date_created": "12 September 2018"},
{"id": "71a47cd08524b369", "rating": 5.0, "text": "I have enjoyed working with great people with the City of Toronto and with staff members in the community centre that I'm working at. Management has been great to me with their understanding with communication and the concerns to making the job safer for everyone. the hardest part of the job is if there isn't any communication, not the right tools to use, it would difficult the work done the proper way. The most enjoyable aspect of the work that I like the work, knowing what I am doing the job the right way with the proper supplies, tools.", "pros": "", "cons": "", "date_created": "7 September 2018"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "c51cfff5d97694d7", "rating": 5.0, "text": "I live in North York but I love working in Scarborough because of the staff. The people and kids at my summer camp location keep me coming back! I intend to continue the position and move up eventually.", "pros": "", "cons": "", "date_created": "6 September 2018"},
{"id": "c2ad0a21e2f17e86", "rating": 3.0, "text": "I have worked for the City for a long time but have found it almost impossible to get even an interview for positions that I seem to be qualified for.", "pros": "", "cons": "", "date_created": "1 September 2018"},
{"id": "f827ae37c30b57ea", "rating": 5.0, "text": "Cool place to work and be yourself. This allows for you to enjoy what you do from planning to running games with the youth to help provide them with a safe space within the city of Toronto", "pros": "", "cons": "", "date_created": "26 August 2018"},
{"id": "46ca9a1fa8ae8311", "rating": 5.0, "text": "In the Summer of 2005, I worked as a student trainee in the Vector Borne Diseases Department for the City of Toronto.  I worked with many other students to mitigate the spread of diseases such as West Nile Virus which is spread by a mosquito.", "pros": "Official use of a company vehicle", "cons": "long hours spent in the hot sun.", "date_created": "24 August 2018"},
{"id": "ea7861872fef424e", "rating": 1.0, "text": "I have started as a co-op student, and I would say I have received no training whatsoever. I was getting humiliated and ignored by others since I was not holding a high title. \nNo one had time for me. My classmate had hired in the same department and different division, and he had the same experience.", "pros": "", "cons": "", "date_created": "22 August 2018"},
{"id": "402830c1141fcd53", "rating": 3.0, "text": "It was fine. The cprs are kinda bossy and everyone think their above you. But the staff around are amazing we work as a family and I love hang with them", "pros": "You do nothing", "cons": "Rude cprs", "date_created": "15 August 2018"},
{"id": "06490334f587c3f7", "rating": 4.0, "text": "great place; but varies with location. management could be better in some establishments. Hours of seniority play a big role in how fast one can move up.", "pros": "", "cons": "", "date_created": "15 August 2018"},
{"id": "e03e6c6874baa6e5", "rating": 4.0, "text": "The job provided security, great benefits and work life balance.  The environment was collaborative and the hours were great. Opportunity for advancement after many years of seniority.", "pros": "Benefits", "cons": "Advancement is slow", "date_created": "14 August 2018"},
{"id": "e05d81a476e73298", "rating": 4.0, "text": "Working hours are able to be flexible to fit my commute from west GTA. Good benefits and pension plan. Management isn't always great but i've been lucky to have a few really good ones.", "pros": "", "cons": "", "date_created": "10 August 2018"},
{"id": "46715bda84dd413c", "rating": 3.0, "text": "Good pay and retirement plan\nDiversity place to work for\nThey don't support the staff, any mistake happens, the employee will be the first to go or blame \nNever appreciate what staff do", "pros": "", "cons": "", "date_created": "10 August 2018"},
{"id": "6401abb2755b0b44", "rating": 5.0, "text": "- pay was ridiculously high for a recreational dance teacher\n- CRP is lenient with how the class goes - i.e. you decide how to run your classes\n- tiring work with kids but it is in a safe and nice environment\n- great part time job for a student", "pros": "Good pay, welcoming environment, safe environment", "cons": "Tiring work, management was disorganized", "date_created": "5 August 2018"},
{"id": "993c07f82d368c00", "rating": 4.0, "text": "Great Place to work. Lot's of benefits and great work environment. Lots of different departments and opportunities. Pay is not bad but wish it was more.", "pros": "", "cons": "", "date_created": "2 August 2018"},
{"id": "d188a5bdd2747ac7", "rating": 5.0, "text": "As a recreational leader who worked for many other camps, this was by far the most organized. They have great trips and good facilities. Overall a solid place to be at", "pros": "Good staff culture", "cons": "Tiring", "date_created": "1 August 2018"},
{"id": "f26a28418054eb05", "rating": 5.0, "text": "Great place to work when you are a student. Lots of hours and great pay. You are outside most of the time so fresh air is a plus. Staff is usually pretty good as well", "pros": "pay, hours", "cons": "none", "date_created": "30 July 2018"},
{"id": "0acd4f99a10313dc", "rating": 1.0, "text": "It's a large organization with plenty of dynamics.  Senior management leadership is lacking and the not the right people in many cases.  Most people stay for the pension, not the culture and work environment.  Agree, lots of great people working in the organization.", "pros": "pension", "cons": "culture and leadership", "date_created": "27 July 2018"},
{"id": "81b09d1912b6eeb6", "rating": 4.0, "text": "Cooling Centre attendants are well-paid and receive a wide array of paid training.  The work is interesting and fulfilling and a great introduction to social service work in a drop-in setting.", "pros": "", "cons": "", "date_created": "24 July 2018"},
{"id": "e788e6eecf93eba6", "rating": 1.0, "text": "The city of toronto lifeguards are a joke. The management style is completely off. Theres a huge thing on seniority of hours. Just because you have a lot of hours doesn't mean you're a good worker. Because of the union the workers are lazy and know they can't be fired and get away with so much. The city of Toronto hires incapable people to lifeguard and their trainings are a joke. They let people pass through the screenings because they are short staffed. They are strict about going over hours and then complain when they are short a guard. They talk a big game about taking care of their own but when you need management or the \"employee assistance program\" you have to work around their schedule. I can speak from experience the EAP. Is a Joke and if you are looking for s job where you can count on others this is not the place to be.", "pros": "None", "cons": "Everything", "date_created": "23 July 2018"},
{"id": "6384450c835149cf", "rating": 4.0, "text": "work isn't hard, workers are friendly \nI learn different skills \nworkplace culture is great\nmanagement can be difficult to work with\nthe hardest part of the jobs is to get along with supervisors", "pros": "call backs", "cons": "", "date_created": "20 July 2018"},
{"id": "cab74eb91137eed8", "rating": 3.0, "text": "Eight years of stakeholder management on a business transformation initiative has made me adept at managing expectations, understanding business models and eliciting business requirements to support those models.\nAs the Enterprise Performance Management (EPM) Lead, on a City-wide IT SAP Implementation project, I was responsible for a variety of overlapping initiatives surrounding the development and utilization of performance measures. I successfully introduced a performance measurement framework into the organization’s annual budget cycle; effectively standardized and matured the manner in which key performance measures (KPI) were identified, documented, and reported.\nAs the subject matter expert (SME) managing the project I created the work breakdown structure (WBS) to manage deliverables, gathered the requirements to build and test the solution, and maintained communications with 35 stakeholders. My colleagues acknowledge my ability to connect with various stakeholders while successfully managing the various aspects of the project; both agile and waterfall environments.", "pros": "High expectations", "cons": "High expectations", "date_created": "12 July 2018"},
{"id": "22ee889a70241282", "rating": 2.0, "text": "Some great staff at the City but a very aging senior leadership team that is risk adverse and quick to blame middle managers for their shortcomings. Particularly troubling is the Mayor's Office which controls all messaging going out of the City and even withholds or alters information to protect the Mayor. Head of Strategic Communications has fled the City with her division now under review for failing to adequately support City Divisions by allowing the Mayor's Office to take over all external and internal messaging.", "pros": "Some great staff who are very dedicated", "cons": "Lack of leadership, accountability for directors, Mayor's Office", "date_created": "12 July 2018"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "96c13dde158aded4", "rating": 5.0, "text": "Challenging and varying work roles to keep day to day work interesting in a variety of roles. Numerous opportunities for advancement and lateral job transfers. Great people and fun work environment. Rewarding work serving the public.", "pros": "", "cons": "", "date_created": "10 July 2018"},
{"id": "b1407a7df41264db", "rating": 5.0, "text": "the summer is full of fun in the sun. The staff are all helpful and even through an 8-hour shift might be boring at times it is worth it when they day check comes in after the two weeks", "pros": "super fun staff and paid trainings", "cons": "the heat and patrons", "date_created": "27 June 2018"},
{"id": "00d47e26cd7a20e7", "rating": 4.0, "text": "I've learned so much in 15 years with the city doing a variety of different jobs.\nMost everyday staff are friendly and willing to help.\nBeing upbeat and creative with your program or service.", "pros": "Lots of job opportunities to choose from", "cons": "Management???", "date_created": "22 June 2018"},
{"id": "7f32db9b0439ead3", "rating": 5.0, "text": "Was a very fun workplace for students especially during college or university. I enjoyed teaching all age types and all swimming levels. I also loved lifeguarding in the public pools especially the outdoor ones.", "pros": "", "cons": "", "date_created": "20 June 2018"},
{"id": "885dd30f1390abc6", "rating": 1.0, "text": "If you enjoy being belittled and berated and seeing hard work and dedication go unnoticed - City of Toronto is for you.\nIts unfortunate that such a modern city would have such an exclusive and close minded works department. \nHope to see it change, for the taxpayers sake.", "pros": "", "cons": "", "date_created": "20 June 2018"},
{"id": "a2b91d47a219199b", "rating": 5.0, "text": "It is a fun job. You must be extremely patient and always alert. The safety of the child is in your hands. You must be properly licensed. Also, have a daily planned properly planned out.", "pros": "", "cons": "", "date_created": "19 June 2018"},
{"id": "ea28903811d04fdb", "rating": 1.0, "text": "Worse work experience ever, management deceptive, controlling, lacking basic management skills, the director and the manager played with facts to conceal the truth.  Destroyed my life and my career, push me to suicide, kept going by grace of God.", "pros": "If it was not of the management team, enjoyed my job and did very well in it", "cons": "Toxic team and work environment, not diversity and no room for talent", "date_created": "18 June 2018"},
{"id": "2656deca3e57382d", "rating": 4.0, "text": "Good bosses with amazing staff as well as challenges everyday to better myself and the workplace. Staff were very supportive of the needs of their employees as well as the needs of the campers themselves.", "pros": "", "cons": "", "date_created": "17 June 2018"},
{"id": "2e8776dd8b83b85a", "rating": 4.0, "text": "most enjoyable part of the job is when you see happy participants\na typical day at work consists of signing in to the location, getting caught up with things you've missed. Finally duties assigned", "pros": "", "cons": "", "date_created": "1 June 2018"},
{"id": "b642ad82e533f9e8", "rating": 5.0, "text": "Able to meet amazing and caring teacher\nExtremely effective place that teaches individuals how to properly communicate and teach children\nAble to learn how to become an effective leader", "pros": "", "cons": "", "date_created": "28 May 2018"},
{"id": "747225a4d39255a1", "rating": 5.0, "text": "Working as a skating / hockey instructor was fantastic work. I am an avid hockey player and this was a close as I got to playing professionally (getting paid to play / teach hockey and skating). The hours were easy (often 2 / 3 hours a day) and the pay was good.\nI worked with another city employee to design and implement skating / hockey skill lessons. It was easy due to a background in both hockey and skating and was fun for me. \nThe hardest part of the job was parents trying to help their children interfering with my teaching. While this was not common, when it happened, it was often impossible for the children to block out their parents and listen to my instruction.\nThe most enjoyable aspect of this job was when students would reach the point of being able to stand on their skates or to complete hockey drills they previously thought they would be unable to do.", "pros": "Getting paid to skate / play / teach hockey.", "cons": "Parental interference", "date_created": "28 May 2018"},
{"id": "3e1838e9e5c63f09", "rating": 4.0, "text": "The City of Toronto was a fun place to work. Employees were friendly and professional. This was my first coop while attending the University of Waterloo, which was about 4 years ago from me writing this review. It was a great first job!", "pros": "Stress free environment", "cons": "Slow work", "date_created": "28 May 2018"},
{"id": "79a09ce0af5a6b57", "rating": 4.0, "text": "Answered inquiries from members and the public regarding programs and events .  Explained cost and completed transactions for new or returning members.  Input information into database regarding the number of members who attended specific classes.\nEnjoyable atmosphere, both staff and public were pleasurable to work with.  Very little stress other than when timelines were tight.\nI learned a variety of customer service skills such as communication,, problem solving, decision making and resolution skills.  I became knowledgable about the many programs offered at the City of Toronto Parks and Recreation Division.", "pros": "Free membership", "cons": "", "date_created": "27 May 2018"},
{"id": "a089590aaa9708e1", "rating": 5.0, "text": "My typical day at work used to start with good morning greetings, and then we were good to go and perform our daily tasks. I was able to learn coordination, management and technical skills from the City. Management staff were great and supportive.", "pros": "", "cons": "", "date_created": "22 May 2018"},
{"id": "42c10a92ea944211", "rating": 4.0, "text": "The people you work with and meet at this job are kinda and helpful and you learn good people skills, how to deal with people. The salary and actually super good, I got around $16 an hour and for rink guard around $14- $15 an hour.", "pros": "Work hours and Money", "cons": "Participants", "date_created": "18 May 2018"},
{"id": "064b21436fa2e269", "rating": 5.0, "text": "City of Toronto Ribfest was a very good experience while you’re working you are also learning on new things they tell you what to do . They’re an excellent company , the manager takes care of you by buying you pizza and drinks on the break and over time and they’re nice people .", "pros": "They’re always someone there to help you", "cons": "Nothing at all", "date_created": "16 May 2018"},
{"id": "19415dfde11ede61", "rating": 4.0, "text": "You must be punctual and ready to work.  No slacking on the job.  Many guidelines to follow, policies, rules, and regulations.  Always make sure to go over the guidelines every month because they can changed in a second.", "pros": "FRee gifts", "cons": "Flexibility", "date_created": "7 May 2018"},
{"id": "143f7407f16bf386", "rating": 4.0, "text": "Can branch into any city of Toronto job division once hired. Great staff that will work with you, however, once you're familiar with your environment you'll see the job true colours..", "pros": "", "cons": "", "date_created": "7 May 2018"},
{"id": "6fc3baf8a33f82ed", "rating": 4.0, "text": "Arrive in the morning to greet and let the patrons into the change rooms. Answer phones, light filing and cash handling. The most enjoyable part of this job was having amazing professional relationships with both the patrons and staff.", "pros": "", "cons": "", "date_created": "2 May 2018"},
{"id": "f289bbaf97c4947f", "rating": 5.0, "text": "I really like this job, it seems like a great place to work and it's very close to me. I learned a lot and how to keep the workplace safe and fun for staff and employees", "pros": "great hours", "cons": "no cons", "date_created": "29 April 2018"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "5ee91e74517d8628", "rating": 5.0, "text": "it was a very new and exciting way to come into the work atmosphere. it was very inviting, co-workers were kind and friendly. everyone cared about their job and tried to make each day a fun experience for everyone.", "pros": "", "cons": "", "date_created": "26 April 2018"},
{"id": "f85e6b026effa311", "rating": 5.0, "text": "City of Toronto is a great place to work.\nI like it alot.\nYou will like it alot.\nKeep typing cause they are forcing me to type you more information then I feel is necessary to provide, but thank you Indeed for wasting my time here.", "pros": "", "cons": "", "date_created": "21 April 2018"},
{"id": "c3b813ba6839f1bc", "rating": 5.0, "text": "Working with the City of Toronto has been a great experience.  Benefits were very good.  \nStaff at the City were always willing to assist each other.  \nChanges to legislation were always forthcoming so we were always attending various training to deal with changes.", "pros": "Well paid and benefits", "cons": "Not much room for advancement.", "date_created": "20 April 2018"},
{"id": "688aa36a25b7cb9a", "rating": 5.0, "text": "The most enjoyable part was being able to help those that needed a helping hand. Growing up I spent a lot of time in drop-in programs with the city I often looked up to the staff at the community centres. I am proud to say that I feel I left the same impression.", "pros": "short hours, fun, enjoyable", "cons": "", "date_created": "17 April 2018"},
{"id": "bd786f4e45d7d88f", "rating": 5.0, "text": "Teamwork is the main focus for this position, you will have to work as a team not only during training, but during class time as well. You will need to constantly work together with supervisor and/ or coworkers", "pros": "", "cons": "", "date_created": "17 April 2018"},
{"id": "9672c2ff8d31789e", "rating": 5.0, "text": "Made sure to keep all the products being used organized and ready for use throughout the campaign. Assisted staff and helped guide citizens coming in and out of the venue.", "pros": "", "cons": "", "date_created": "16 April 2018"},
{"id": "ca326a3444dcc8cc", "rating": 5.0, "text": "On a typical day my duty is to work on the telephone dealing with customers who want to use the City facilities and to register in program in which the City offers. Also, to help the customers to enroll their children into activities that will help them in their learning.\nHaving to deal with customers helps me to understand the needs of the parents in having interest in their children's learning development.\nBy communicatiing with parents increases my learning experience in the  area of recreation.\nIn dealing with customers my management skills have improved. I also know how to multitask and address my customers' concerns on the phone by giving them instructions on how to use the computer to register for the different programs.\nThe workplace culture involves a manager, supervisors, and staff, It contains a multicultural environment.\nThe hardest part of the job is to help first time users to find the right programs. Also to deal with customers who are inclined to have a behavioral problem.\nThe most enjoyable part of the job is to meet the needs of my customers. Also, to be able to develop good time management skills.", "pros": "To work in a multicultural setting", "cons": "Unpaid lunch break", "date_created": "7 April 2018"},
{"id": "f0910b047c034a15", "rating": 5.0, "text": "I love how diverse the City of Toronto is, it's so fun and exciting to work with the city. I have worked with the City of Toronto for over 6 years and I have learned a lot of life skills that I will forever cherish.", "pros": "", "cons": "", "date_created": "2 April 2018"},
{"id": "fdf557cba364895c", "rating": 3.0, "text": "Upper management is pretty entrenched and limited by in what it could do, rather stagnant and protocol based. Pretty backwards as well in terms of technology.", "pros": "", "cons": "", "date_created": "28 March 2018"},
{"id": "8692685ff34536a6", "rating": 4.0, "text": "Toronto is a mosaic glass of different ethnicities and culturals.  Learning to be patient and understanding is a necessity to work for City of Toronto.  These are great professional skills to develop and City of Toronto is a great environment to learn.", "pros": "Overtime is extra", "cons": "", "date_created": "23 March 2018"},
{"id": "dbb10ebd6d1433bd", "rating": 5.0, "text": "I have only worked one summer with the city, and it was a great summer. Working as a Wading Pool Attendant meant working a lot, with lots of shifts available as well, which is always nice to be able to work as much as possible. The only con I would have is one of my bosses took her job too seriously. Other than that, excellent.", "pros": "Lots of work available, working outdoors, pretty good pay.", "cons": "Took 11 days after pay period ended to pay", "date_created": "22 March 2018"},
{"id": "18698c0eb00a7aed", "rating": 4.0, "text": "The work environment is generally relaxed and you will get to know your coworkers well. Pay is good for an entry-level job and the hours are usually good.", "pros": "", "cons": "", "date_created": "22 March 2018"},
{"id": "d65dadec6466d24d", "rating": 5.0, "text": "I worked with really great superiors and co-workers. Other than nepotism is really bad there, people i worked for were great. From  my first supervisor, the by-law officers and managers, they were all great.", "pros": "", "cons": "", "date_created": "19 March 2018"},
{"id": "f6f555a1c8b75d27", "rating": 4.0, "text": "If you're looking to make money over the summer while also being able to enjoy the outdoors and not be stuck inside this is definitely the job for you. Some pools may be more hectic than others so it may be more stressful depending on your pool of choice.", "pros": "a lot of hours, fun staff", "cons": "heat waves, flexibility", "date_created": "19 March 2018"},
{"id": "7b6436275daf286f", "rating": 4.0, "text": "I need to be hired in Canada, Toronto as a helper of  any type of work vacancies you have.\nI am very much disciplined to and I managed my self very well.", "pros": "As I said like to work hard to make money, and I want to enjoy soccer in foot ball.", "cons": "I dislike exravagancies, and I hate lazy individuals.", "date_created": "16 March 2018"},
{"id": "f19902347d10106d", "rating": 5.0, "text": "You will have no trouble working here......was based at the complex near metro Toronto convention center...staffs are supportive.\nI worked in Technology", "pros": "", "cons": "", "date_created": "15 March 2018"},
{"id": "c02f6483bd447981", "rating": 5.0, "text": "There are a lot of policies to abide by at this work location. Not all supervisors abide by those policies. There are a lot of community based programs that revolve around the community.", "pros": "", "cons": "", "date_created": "12 March 2018"},
{"id": "ca0f04357675ad58", "rating": 5.0, "text": "The City is a fantastic place to work with many opportunities for skills development, and a great support system for employees. It gives you the opportunity to advance, and rise to meet your best self.", "pros": "", "cons": "", "date_created": "12 March 2018"},
{"id": "c6f8a359d98df2ff", "rating": 5.0, "text": "Union always takes care of it workers. Everyone is treated fairly and there is no discrimination. Everyone is friendly and works together to ensure success in the workplace.", "pros": "", "cons": "", "date_created": "7 March 2018"},
{"id": "5cfc153a5b0b57de", "rating": 4.0, "text": "I worked as the assistant to a City Councillor, and I must say for being a pretty large company (it is the city) there are some pretty good pros, like they really encourage you to go out and explore Toronto, and offer great perks and benefits and try to keep you aware of them. The downsides of my job were that people often came into the office or called to complain about the city, and so if you are not aware and able to keep your emotions in check it becomes pretty tough.", "pros": "", "cons": "", "date_created": "5 March 2018"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "42c4e946ac866b98", "rating": 3.0, "text": "...with little monetary gain. If you work part-time with the recreation stream of City of Toronto your hours are often poor, with hourly rates that aren't competitive. Great culture and atmosphere, but I only work here for fun. My shifts are normally only 3 hours long, and often isn't worth the travel.", "pros": "Culture, People", "cons": "Pay, Hours", "date_created": "2 March 2018"},
{"id": "8f6c045bf760f3c6", "rating": 3.0, "text": "Working for the city was a great experience.  It was my first look into corporate culture.  I was young, excited and eager to work hard.  The work tasks were tedious but well worth the experience.", "pros": "", "cons": "", "date_created": "23 February 2018"},
{"id": "04054515c6d3d409", "rating": 4.0, "text": "I learn something new everyday. Some days are very challenging as a public servant, but some days are rewarding. High volume of work, fast-paced, and constantly competing priorities.", "pros": "", "cons": "", "date_created": "22 February 2018"},
{"id": "85090f0fa9220d73", "rating": 5.0, "text": "Since the City of Toronto is run with the Property tax payers' and other taxpayers' funds, the Management staff attempts to gain higher level of accountability.", "pros": "Enjoyable part is a comprehensive competitive salary and benefit package.", "cons": "To manage the Unionized staff. Additionally, higher management's favoritism practices.", "date_created": "21 February 2018"},
{"id": "418ce1c930d301e3", "rating": 3.0, "text": "There's a distinct hierarchy environment - if you're management or senior management you'll do well. There is not much opportunity for you to grow as there are workplace politics that goes on hence redundant career path....The only thing good about this organization is the benefits and work life balance... depending on your manager, team culture may suck.. if you have a bad manager, your experience will be bad but if you have a good manager, it drives the success of the team and overall project success.", "pros": "", "cons": "", "date_created": "21 February 2018"},
{"id": "dfd4be03a750f6dd", "rating": 4.0, "text": "A nice place to work!\nThe day to day work environment is good. There are many activities within the workplace that balance work and social life within the working environment.", "pros": "", "cons": "", "date_created": "21 February 2018"},
{"id": "02462d24b3bdb830", "rating": 5.0, "text": "Fantastic support staff, always there to help out. You can build a very close relationship with your partner at the wading pool. Not a very difficult job, but rewarding.", "pros": "", "cons": "", "date_created": "14 February 2018"},
{"id": "481fb1caf9c3fe08", "rating": 5.0, "text": "I worked the basketball shifts in the gymnasium, an average day for me starts off with making all the kids sign in just so i know exactly hoe ma y people are in the space just in case something goes wrong. Take out the basketball, monitor the kids while they play to make sure everything is alright. Walk around the gym to make sure everything is running smoothly and interact with some of the kids. The hardest part of the job is making sure all the kids sign in when they come to the gym, the most enjoyable part of the job is seeing kids having fun playing a sport that they love to play in a safe and friendly environment.", "pros": "Get to meet and interact with new people on a daily basis", "cons": "None", "date_created": "14 February 2018"},
{"id": "b3e8f2250cab0d2e", "rating": 4.0, "text": "Great place to work. Had a lot of fun with the co-workers and management team. People looked after one another especially if you worked hard. Hours and wage were the downside.", "pros": "Enjoyable to work", "cons": "Bad wage", "date_created": "14 February 2018"},
{"id": "f727e23ce3263cb5", "rating": 4.0, "text": "-worked 3:30 pm-6:30 pm 5 days a week\n-learnt how to manage time, be patient, team work skills\n-worked with a team of 5\n-Worked with people of different backgrounds and educational fields\n-Rushing after school as a full time student to get to work was hard\n-I enjoyed working with people and leading the kids", "pros": "Excellent pay; meeting new people", "cons": "short hours", "date_created": "10 February 2018"},
{"id": "6fc42c22631aea8e", "rating": 5.0, "text": "This was a one-day event that gave students a chance to learn the process of voting. I was a Tabulator Officer who was in charge of processing voters ballots and then sending them to headquarters.", "pros": "", "cons": "", "date_created": "9 February 2018"},
{"id": "5750d8efb2dd9c1b", "rating": 5.0, "text": "Was a good experience. Secure job with good pay. Long hours but comfortable working environment. Great people and great staff members. Would work there again.", "pros": "Comfortable", "cons": "Long hours", "date_created": "7 February 2018"},
{"id": "6a4b475b617f60ed", "rating": 5.0, "text": "It has a good culture work. The responsibilities and duties of the employee are very clear. There are many opportunities to grow up in your professional career.", "pros": "", "cons": "", "date_created": "2 February 2018"},
{"id": "7f591bbc64da81af", "rating": 4.0, "text": "i am just a high school student. so, my volunteering work is just for the 40 required hours i need t make. although i do enjoy helping my community and working together with other youth", "pros": "", "cons": "", "date_created": "28 January 2018"},
{"id": "9932f8ce6e8f72ac", "rating": 4.0, "text": "Learned a lot - about city budget, organization structure, etc \nVery helpful \nEveryone trying to help you advance\nLack of communication among workers\nA lot of internal tension\nSecure job", "pros": "", "cons": "", "date_created": "26 January 2018"},
{"id": "97c2b0b320d74b60", "rating": 4.0, "text": "Good working environment with decent pay and hours. The work is there if you're willing to take it. Can be difficult to advance as union seniority dictates who gets hired.", "pros": "35 hr work week", "cons": "Difficult to advance", "date_created": "25 January 2018"},
{"id": "1aeed907e31660d0", "rating": 5.0, "text": "Working at the pool gets exhausting sometimes, especially when patrons are screaming at your face for no apparently reason. You do meet some very nice staff here.", "pros": "", "cons": "", "date_created": "23 January 2018"},
{"id": "4d59e3652540dba3", "rating": 4.0, "text": "not sure why they put city of toronto here for me to review. i have never worked for the city but i love living here and i have been here all my life im ready to work hard at my next job!! would like to bartned and serve", "pros": "", "cons": "", "date_created": "22 January 2018"},
{"id": "03472c58dec52040", "rating": 3.0, "text": "A good way to meet new people and learn a lot. The work environment was stable and very well done. Very professional workers that do their job well. Staff is friendly to everyone and ensures that it is an enjoyable work experience.", "pros": "", "cons": "", "date_created": "18 January 2018"},
{"id": "9105e0edb604cda9", "rating": 5.0, "text": "A typical day at work, started at 8:30 a.m. and ended at 4:30 p.m.\nWhat a prosecutor does everyday in and through the courts.\nManagement worked closely with us and helped when it was requested.\nWorkplace culture was responsible, ethical and professional.\nHardest part of the job was to review and argue all files on the docket, with little or no real prep. time.\nMost enjoyable part of the job was learning all of the varied job duties of a prosecutor and working with the courts and the public and the different players found within the courts.", "pros": "Fixed full-time hours, Mon-Fri.", "cons": "Moving between different courts when prosecutor's called in sick or absent.", "date_created": "14 January 2018"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "12cc19fc9068be66", "rating": 5.0, "text": "Working for the city as a student was a great experience. Typically work was Wed-Sun from 2p-10p. Supervisors were great people and lots of leeway was given - we were not constantly being micromanaged. As long as you do your job in solid waste, you will not have any trouble.", "pros": "High wage, easy work, great atmosphere, great coworkers & supervisors", "cons": "Odd hours (Wed-Sun, 2p-10p)", "date_created": "12 January 2018"},
{"id": "f1b6d70596c8f9b6", "rating": 5.0, "text": "Working as a CIT helped me learn the basics of working with a group and supervising other people. It was learning experience throughout the whole program.", "pros": "", "cons": "", "date_created": "10 January 2018"},
{"id": "1c6ab6183ec6ba4c", "rating": 4.0, "text": "Insightful, never a dull moments, changes are constant, daily learning with a vase diversity in culture in the workplace and always meeting new people that cross your path daily.", "pros": "Dealing with different personality each day and learning", "cons": "always learnig", "date_created": "9 January 2018"},
{"id": "8ae81a2632efb09a", "rating": 3.0, "text": "It's a good student job. However the culture you get is dependant on where they place you. Since pools are located all around the city some of them are more laid back some of them are more stressful and you might have to get a bit lucky to get a good experience. However the management at the upper levels may teach you why meritocracy is important.", "pros": "", "cons": "", "date_created": "30 December 2017"},
{"id": "cfbb5d785781b52a", "rating": 4.0, "text": "I enjoyed working with a lot of the people. Management was fair, and so were the rules when working with the children. The work environment was amazing simply because I was doing what I loved to do, even tho it could get stressful at times.", "pros": "", "cons": "", "date_created": "27 December 2017"},
{"id": "37b5dc032daa2dd0", "rating": 4.0, "text": "there are too many areas of work within COT to give a quality review. The pay is always better in the City, and there you will be part of a union, even for part-time workers.", "pros": "", "cons": "", "date_created": "18 December 2017"},
{"id": "eac1c2e28bb13c38", "rating": 2.0, "text": "It was good  experience to work for the city as inspector in many different locations in Toronto City and as estimator also in inside office in wniter time", "pros": "", "cons": "", "date_created": "16 December 2017"},
{"id": "8c75ac10c9ddd9df", "rating": 4.0, "text": "A typical workday involves interacting with various members of the public with who you may develop long-lasting relationships with. Skills learned are customer service, problem-solving and compliance with policies and guidelines.", "pros": "", "cons": "", "date_created": "15 December 2017"},
{"id": "95cf077d33c05425", "rating": 5.0, "text": "I enjoyed the work. I left the city once long time ago. DO NOT EVERY LEAVE you will loose all your seniority hours you have earned. It can be great place work but also not. Just depends on were what unit you apart of.", "pros": "Lots shifts", "cons": "Takes long time to get certain training's, hard to move upwards within the organization", "date_created": "13 December 2017"},
{"id": "3614a5979608fbce", "rating": 4.0, "text": "great outdoor work . Refinishing the boardwalk along the Lake shore. good ppl tp work with. Most enjoyable aspect of the job was being able to help the public with their needs  .", "pros": "", "cons": "", "date_created": "12 December 2017"},
{"id": "1b278410e741acc4", "rating": 4.0, "text": "I have worked for the city for three years now and I love it as a part-time worker because you can choose shifts based on your schedule. Helps make money on the side, however for full time employees it is more difficult.", "pros": "", "cons": "", "date_created": "10 December 2017"},
{"id": "2e9e43f36d3cbe72", "rating": 5.0, "text": "Days are always different.  Different tasks to handle.  Everyone is friendly and approachable.  I have learned to adapt to every situation and person in order to communicate with others and tackle certain tasks.", "pros": "Benefits", "cons": "Shift work", "date_created": "7 December 2017"},
{"id": "3ce0da9f874bbc84", "rating": 3.0, "text": "It is good to work for City of Toronto if have full time positions.  If have part time positions then your pay can easily get cut and/or lose your position.  \nI personally enjoyed working for City of Toronto in Community center for 20 years.  I enjoyed helping people who needed City's help and found many good friends in doing it.\nI will support my City's Community centers but will not work for them since after 20 years of experience they decided to bring down my pay rate to only 30 cents over minimum wage.  Yes, that is true!", "pros": "Get chance to help less fortunate people", "cons": "Not treated fare", "date_created": "4 December 2017"},
{"id": "324312fe6f6f9651", "rating": 4.0, "text": "I really enjoy working with the city of Toronto, it is flexible, pays well and is very attentive to the needs of the employer. I learned different ways to deal with people and children, and strengthened my leadership skills, I have more confidence with talking to people of the public and expressing myself. The most enjoyable part of the job is knowing that you are bringing the community together by being involved in the kids lives outside of the home.", "pros": "", "cons": "", "date_created": "4 December 2017"},
{"id": "93d7b5c293af60ff", "rating": 3.0, "text": "Volunteering for the city of Toronto was a great experience. I got to learn a lot of new things and met many different people. Overall I'd say working their is really fun and worth it.", "pros": "Lunch breaks, ends early in the afternon", "cons": "early start time", "date_created": "2 December 2017"},
{"id": "4602bf9d9fb49ca9", "rating": 4.0, "text": "Working for the City of Toronto can be a grand career advancement, IF you are FULL TIME. \nBeing Full Time gives you all the perks \n-Benefits\n-Vacation\n-Pension \n- Great salary! \nBut, obtaining full time is the hard part. Screening, testing, interviewing is over whelming and confusing... for most full time positions they just transfer and move around the full timers. so your stuck being a part timer which means \n- Working evening and weekends\n- minimum wage \n- no benefits \n- no vacation time", "pros": "", "cons": "", "date_created": "27 November 2017"},
{"id": "964da448f6924d0f", "rating": 1.0, "text": "Very unhappy working here.Preferential treatment shown \n to some. Management never listens to employee concerns. will never apply my skills here again.", "pros": "good hourly rate", "cons": "Very tense environment", "date_created": "26 November 2017"},
{"id": "33cbf68b13cd7933", "rating": 4.0, "text": "A real nice working environment. Management knows how to treat worker with respect. Wasn't a well paying job at the time I was employed. Easy to make new friends and always meeting new people.", "pros": "A great place to work", "cons": "Wage", "date_created": "24 November 2017"},
{"id": "0134c87c31935abc", "rating": 4.0, "text": "Meet a lot of good people with common interest, providing care to elderly and the vulnerable. However, it is not easy to get a full time position in this industry.", "pros": "", "cons": "", "date_created": "13 November 2017"},
{"id": "09bd043a7d0e8b55", "rating": 5.0, "text": "I learnt a lot on how to work with the public with regards to public health inspection. The work environment was quiet friendly and supportive. The place values strong work ethics and professionalism.", "pros": "", "cons": "", "date_created": "13 November 2017"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "c9307d5fc4d0b389", "rating": 3.0, "text": "With the City of Toronto having many various departments and divisions, there are many positions in roles within the company. Based on my experience, the City of Toronto can be a great employer. However, career advancement is very limited.", "pros": "", "cons": "", "date_created": "11 November 2017"},
{"id": "6a6f0eed3f43c4d0", "rating": 4.0, "text": "There is no harsh dress code and can usually just wear comfortable clothing. Dealing with a lot of the public so have to have a smile on your face, but patrons are using happy", "pros": "", "cons": "", "date_created": "4 November 2017"},
{"id": "54bdf46df2574d02", "rating": 3.0, "text": "Depending on the division you were in and the culture it can be good place to work. It all depends on the culture and stress levels in the area you are working in.", "pros": "", "cons": "", "date_created": "23 October 2017"},
{"id": "792d5b20466cd8bd", "rating": 5.0, "text": "My job was amazing i learned a lot i took it upon myself on taking more and more courses too advance in the company management came up the ranks so they actually knew the job and also if we didn't know a certain job they would actually help us solve the problem", "pros": "mangement worked together with the employee's hands on", "cons": "too many shif't's disrupted our personnel life", "date_created": "20 October 2017"},
{"id": "75da953fd8158442", "rating": 3.0, "text": "- The job is more to gain experience about working with the City than having a career. If you are a student in high school or university, it is a great place to work to gain experience in municipal workplace. But pay is very low, very little to no immediate advancement, and there are far and few jobs between peak seasons.", "pros": "", "cons": "", "date_created": "17 October 2017"},
{"id": "5abc4a07be6839dd", "rating": 4.0, "text": "Great work environment teaching campers the basics of arts and crafts. You get assigned to a certain age group each session and there is flexibility in what you can teach and demonstrate.", "pros": "Great coworkers", "cons": "Loong Hours and demanding emotionally", "date_created": "16 October 2017"},
{"id": "0ce3312c53966756", "rating": 5.0, "text": "well organized and looks after staff very well. As staff, you are valued by management and protected by them well. Was a pleasure to work for the city & would do it again in a heart beat.", "pros": "", "cons": "", "date_created": "12 October 2017"},
{"id": "d23ca44b4ed9fdfd", "rating": 5.0, "text": "Ve'ahavta is a solid organization with a tremendous work culture. It is humanitarian in its mission both outside the community and in the work place. \nEmployees are treated with respect at all times. There is a sense of family. \nwith solid governance and infrastructure in place, there is a sense of solidity and security.\nThere is not much opportunity for growth", "pros": "", "cons": "", "date_created": "10 October 2017"},
{"id": "7b999b9c57b27811", "rating": 3.0, "text": "Most enjoyable, learning new processes, working with clients\nI will miss my co-workrs \nLearning opportunities\nGood benefits\nVacation takes at least 1 year to be able to use", "pros": "", "cons": "", "date_created": "5 October 2017"},
{"id": "3c943d1fcbb257ea", "rating": 4.0, "text": "A typical day at work involves me arriving at the pool site and signing in. I then prepare the deck for lessons to begin. The rest of my shifts consists of teaching swimming lessons and life guarding lane swim and recreational swim.", "pros": "", "cons": "", "date_created": "29 September 2017"},
{"id": "6801eb2539756e60", "rating": 5.0, "text": "My bosses were always great fed into my potential and pushed me to new heights .  It took me a while to get into working wit people who didn't share my ideals but at the end of the day it was fun and productive .", "pros": "days went fast", "cons": "long hours but thats any job", "date_created": "27 September 2017"},
{"id": "3eac82aa42180455", "rating": 5.0, "text": "Over my time as a hockey instructor i enjoyed helping the ids learn more about the sport and helped them learn how to play it and help them improve their skills.", "pros": "", "cons": "", "date_created": "27 September 2017"},
{"id": "4bbb7af3534c1f47", "rating": 5.0, "text": "My time at the City of Toronto was very positive. I would definitely recommend working here to any one who is still in school looking for a summer job.", "pros": "", "cons": "", "date_created": "21 September 2017"},
{"id": "acb3d91f6d815a2f", "rating": 4.0, "text": "A great way to get integrated within the city's system. You learn to work well with the public, and your team. It is an upbeat positive setting, and I reccomend working there.", "pros": "", "cons": "", "date_created": "19 September 2017"},
{"id": "2c1fa2c23827db3c", "rating": 5.0, "text": "I was lucky to have been hired to be a Farm Attendant at the Parks and Recreation location of the Riverdale Farm in Toronto.  I was required to use my own initiative to complete the tasks of a running farm, plus interact with the public in an engaging and education manner.", "pros": "", "cons": "", "date_created": "19 September 2017"},
{"id": "9f895559fcb4939e", "rating": 4.0, "text": "I worked many part time jobs with the city. Therefore I worked with many different supervisors. There were some supervisors that made it a very enjoyable experience, but others would constantly criticize you without adding any compliments and these people made woking for the City very difficult", "pros": "", "cons": "", "date_created": "12 September 2017"},
{"id": "058f273e149a0423", "rating": 4.0, "text": "I loved guarding/instruting for the city of Toronto. Tons of amazing staff and people always willing to help out where they can. Every pool has an amazing work environment.", "pros": "Fun", "cons": "Lots of qualifications", "date_created": "11 September 2017"},
{"id": "cc881ff378199fc3", "rating": 5.0, "text": "Great work environment with great learning opportunities. I really enjoy the pace our office works at, although this could be the hardest part of the job it is easily the most enjoyable as well.", "pros": "", "cons": "", "date_created": "11 September 2017"},
{"id": "a47b855708f114e2", "rating": 5.0, "text": "This was a wonderful environment to work in, due to the team members who were sharing internal processes and developing solutions amongst teams. There was also a variety of training involved and fostered development and critical thinking.", "pros": "great teams and fostered community and development", "cons": "", "date_created": "7 September 2017"},
{"id": "9dc041ee34e7b961", "rating": 4.0, "text": "Low stress environment. Worked for short terms. Interesting to learn of city businesses. The job allowed me to learn and also i was paid decently well. I found it satisfying to contribute to my own city, other than paying taxes.", "pros": "", "cons": "", "date_created": "6 September 2017"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "76eba5c70fe6f590", "rating": 5.0, "text": "The city of Toronto provided excellent resources and great employees that provided me with excellent experience that would help prepare me for finding a career in my field once i graduated.", "pros": "", "cons": "", "date_created": "6 September 2017"},
{"id": "d608ac7a33e3338e", "rating": 5.0, "text": "Working for the city of Toronto is a great and highly educational experience. Being with the city has taught me how to be punctual, organized, mufti task and meet deadlines. Workplace culture is great everyone is very open and inclusive. The most enjoyable part of the job is meeting people from all over the city.", "pros": "Positive Enviroment", "cons": "", "date_created": "5 September 2017"},
{"id": "cb372863381e82cf", "rating": 5.0, "text": "Well organized and welcoming. The individuals that work there and the managers make it a pleasant and memorable experience. at times slow, however it does become challenging. Heavily customer service oriented.", "pros": "Team members", "cons": "poor season conditions", "date_created": "4 September 2017"},
{"id": "34876c35c9c587f8", "rating": 5.0, "text": "Well paced environment to work if you are organized... That being said the work life balance is great and you must be innovative to make good progress with the city of toronto.", "pros": "", "cons": "", "date_created": "3 September 2017"},
{"id": "a0cdac20690ac85d", "rating": 5.0, "text": "Great company, I would recommend for anyone who's interested in the city of toronto and loves a company who cares about its employees. Great benefits and company culture is top notch", "pros": "", "cons": "", "date_created": "30 August 2017"},
{"id": "9a6e24bff5d059b6", "rating": 4.0, "text": "Great Corporation that allowed employees the opportunity too achieve their goals. Diverse challenges within your field and related areas of governance. The long commute too the city was justified in the knowledge that you where making the cities streets better.", "pros": "", "cons": "", "date_created": "29 August 2017"},
{"id": "dc00b565f022f7d0", "rating": 4.0, "text": "I worked as an intern with the City of Toronto. It was a fantastic learning experience. I was never treated as lesser based on my role as an intern - in fact, I was given work that was on par with work that I hope to do in the work force. My co-workers were very helpful, friendly, and made me feel included in their team. Overall, my experience as an intern at the City was incredibly valuable - an all around great learning experience.", "pros": "", "cons": "", "date_created": "29 August 2017"},
{"id": "e5c7b918853a440a", "rating": 5.0, "text": "Really fun. People were great to work with , always on time never late , great attitude , great in groups are alone , no preference, taught kids and adults how to skate properly , aswell as teaching them the basics of hockey .", "pros": "", "cons": "", "date_created": "28 August 2017"},
{"id": "1715151c65c8a819", "rating": 5.0, "text": "This is a great  place to complete your placement that. this is where you will learn more about how the HTA works from how it does not work. its a wonderful learning experience.", "pros": "", "cons": "", "date_created": "24 August 2017"},
{"id": "3433c3a29cf1d59b", "rating": 4.0, "text": "I really liked working at the Elms summer camp. They treat you like family and welcome everyone. While working I've made many new friends and memories. This was an experience Ill never forget.", "pros": "Staying active, good staff, lunch breaks, interacting with kids", "cons": "long hours, a lot of wild kids, mean parents", "date_created": "20 August 2017"},
{"id": "7c76013b4073455f", "rating": 3.0, "text": "I have been working at City of Toronto as IT consultant.   Pretty simple job, can be really fun or really boring. \n comfortable job, work life balance\nCons", "pros": "", "cons": "", "date_created": "9 August 2017"},
{"id": "7fa8bad90670c965", "rating": 2.0, "text": "There is so much potential however lack of strong leaders and intense micromanagement prevents this business from moving forward at the rate it should.", "pros": "Salary and Benefits", "cons": "Leadership", "date_created": "7 August 2017"},
{"id": "a23d54048b546e51", "rating": 5.0, "text": "Typical day at City of Toronto is relaxed and the work load is not to heavy but at the same the work load is not to light.The workload is enjoyable to do. No one puts pressure on you.", "pros": "Work can be spread out", "cons": "When theirs no work. You cant do much", "date_created": "2 August 2017"},
{"id": "fdb830563b6e5d57", "rating": 5.0, "text": "You are well protected as an employee and the standards of work are good. It is a respectable job to work with the city. I have a friend that works as a gardener and she thoroughly enjoys her job.", "pros": "", "cons": "", "date_created": "1 August 2017"},
{"id": "52bc068052f050dc", "rating": 3.0, "text": "i have worked for better companies , working for the city was very hard and strenuous . the culture of the city if how to screw people over. it is not a  team oriented atmosphere.", "pros": "", "cons": "", "date_created": "25 July 2017"},
{"id": "16dabe40e1ecabb9", "rating": 5.0, "text": "I love going in to work every day, I love the people I work with. The only drawback is enrollment varies session to session so I never know if my classes are going to run and if I'm going to have 15 hours of work per week this month or 30.", "pros": "fun, engaging", "cons": "variable hours", "date_created": "14 July 2017"},
{"id": "194739e4fdc84fad", "rating": 4.0, "text": "This experience was very helpful to me because I got the chance to work with different groups of children from different cultures, and plan games for them to play.", "pros": "", "cons": "", "date_created": "7 July 2017"},
{"id": "36d347946dc290aa", "rating": 4.0, "text": "Exciting work environment, although not very well managed. Training is boring and repetitive but necessary. The job is simple and rewarding, also at most times very social.", "pros": "", "cons": "", "date_created": "4 July 2017"},
{"id": "ef8577fe3b8b6050", "rating": 4.0, "text": "Consistent and reliable hours with a fun summer work environment.  Good pay for students looking for a fun and easy summer job in the downtown core. A", "pros": "", "cons": "", "date_created": "29 June 2017"},
{"id": "f259b495d9348d77", "rating": 4.0, "text": "Amazing work environment, where everyone is laid back and relaxed. Fun place to work, with great benefits. On occasion there will be some long hours, especially at the end of the year come tax time.", "pros": "Regular appreciating functions", "cons": "Some long hours", "date_created": "27 June 2017"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "360a4118c44b9fe9", "rating": 1.0, "text": "Work full-time hours but only considered \"part-time\" staff so you won't receive benefits or vacation/sick days. Sometimes show up for a shift and programs have been canceled so you lose hours and made the trip for nothing wasted your whole day.", "pros": "", "cons": "", "date_created": "25 June 2017"},
{"id": "27f9841b0fc471da", "rating": 3.0, "text": "Early years was very enjoyable and fun working for the City. With cutbacks in early 1990's and downsizing the stress was affecting productivity and staffs' workload.", "pros": "", "cons": "", "date_created": "15 June 2017"},
{"id": "85d0647509e34548", "rating": 4.0, "text": "communication is key you learn a lot, get to watch hockey all day and talk to people, you learn a lot about skating and how a zamboni works, very fun job", "pros": "", "cons": "", "date_created": "13 June 2017"},
{"id": "de66f569b23a193d", "rating": 4.0, "text": "My typical day of work included prepping for the day and prepping for when the children come. I learned to be more patient working with children, their parents, and my peers and coworkers. It was a challenging job at times, but I learned to work well with others and as a team. The hardest part of the job was to deal with different situations that you might not have prepared for or would have foreseen coming, but nevertheless, there is a great team atmosphere. The greatest part of the job was being able to work with kids and see them enjoy and grow.", "pros": "Great experience", "cons": "Can get long", "date_created": "31 May 2017"},
{"id": "7c2f36c4dbec4f3b", "rating": 4.0, "text": "Good people strong administration decent part time hours. can be very strict at times but relatively good overall with a union to protect and advise you on work related issues.", "pros": "set hours", "cons": "very specific", "date_created": "26 May 2017"},
{"id": "bd4db31c0443e518", "rating": 4.0, "text": "The hardest part of the job was keeping warm in the cold arenas, dealing with the management and trying to get someone to cover your shift. Many of the staff are young, most in their 20's.", "pros": "", "cons": "", "date_created": "24 May 2017"},
{"id": "61f7c2653732459f", "rating": 3.0, "text": "Simple work, simple pay. working directly with clients and seeing them progress through a course is very rewarding. The business side of the job is less than friendly.", "pros": "Easy work", "cons": "Poor work hours", "date_created": "23 May 2017"},
{"id": "0d04a8058d792572", "rating": 3.0, "text": "-everyone listening and following given rules\n-learning new ways to encourage children to wear helmets, a diverse community\n-making sure everyone is safe and that the other workers are doing their jobs properly\n-the most enjoyable part of the job for me is when everyone is just having fun, no arguments, no fighting, just everyone getting along and minding their own business", "pros": "breaks", "cons": "self-centred co-workers", "date_created": "19 May 2017"},
{"id": "ee741b589aa66d96", "rating": 5.0, "text": "advanced my skills with cisco router configuration.  received valuable experience with working in a corporate environment.  downtown work life is very fulfilling.", "pros": "", "cons": "", "date_created": "15 May 2017"},
{"id": "7e7decf4f0809b25", "rating": 5.0, "text": "Cool place to work.  You have freedom to work your schedule around your life which was good for me while I was still in school.  Manager was pretty chill, didnt bother me at all.", "pros": "", "cons": "", "date_created": "9 May 2017"},
{"id": "ba7dc9f013f58a6c", "rating": 5.0, "text": "Typical days as a lifeguard include observing pool patrons, ensuring their safety and promoting 3 ps of lifesaving, staff and management are all reasonable, compassionate, and for the most part will always have your back. The workplace culture is quite professional while performing duties, off time can be slightly more casual. The hardest part of the Job is the various situations that must be dealt with as a guard, whether they are physical or have to do with Public relations.", "pros": "Work in sun outside, good pay", "cons": "", "date_created": "8 May 2017"},
{"id": "d0bfef53998e1025", "rating": 4.0, "text": "Extensive training leads to a professional and respectful work environment. Management is fair and professional. Co-workers have similar skills and help each other out. Creates a small community.", "pros": "", "cons": "", "date_created": "7 May 2017"},
{"id": "19e9151d3126bb9c", "rating": 4.0, "text": "had a great time with great peoplle. very much enjoyed my time there as the people were very friendly, i had known them for a long time and were very understanding of personal things that cam", "pros": "fun", "cons": "hard work", "date_created": "5 May 2017"},
{"id": "8167ff7770d18da0", "rating": 2.0, "text": "As a part-time worker I have no access to benefits and no guarantee in hours of work.  This leads for a precarious, unstable and unsustainable work life.\nThe part-time job's in my Division are very low wage and the opportunity to move up is reserved for Managements favourites.", "pros": "", "cons": "precariousness", "date_created": "26 April 2017"},
{"id": "0cbb3de9981bc27b", "rating": 4.0, "text": "I enjoy working with the City of Toronto as it allows me to gain experience in a variety of different fields such as management level positions or working with young children.", "pros": "", "cons": "", "date_created": "21 April 2017"},
{"id": "842febd779bd3b0e", "rating": 5.0, "text": "Like any company, things aren't perfect, but everyone there work well together, help each other, and are good to work with. My experience has been great while I was on my Co-op training there and getting the right feedback to help me through my career", "pros": "", "cons": "", "date_created": "19 April 2017"},
{"id": "98479d51f136b499", "rating": 4.0, "text": "The job currently is a majority of office and administrative work\nI've learned a lot about Microsoft Office applications in particular with using Visio to create organization charts", "pros": "", "cons": "", "date_created": "19 April 2017"},
{"id": "9e7061cf61c2a674", "rating": 3.0, "text": "i worked as a tabulator, for one day, during the municipal elections of toronto. it was simply to operate the machine that calculated a person's vote, ensuring everything ran smoothly. it was a relaxed day that allowed you to focus on the task at hand", "pros": "", "cons": "", "date_created": "13 April 2017"},
{"id": "f7e7fe6e2849755f", "rating": 5.0, "text": "City of Toronto is a large organization that has a variety of career possibilities to move throughout the organization, be it just within your division or upward to a level of higher responsibility. It is very fast paced environment and there is lots to learn everyday.", "pros": "Salary and Benefits", "cons": "", "date_created": "12 April 2017"},
{"id": "e9cefad2073038db", "rating": 4.0, "text": "Great culture, great pay, great benefits, great job security.  Great place to work.  Great work - home life balance which is really nice.  Overall an enjoyable place to work!!", "pros": "", "cons": "", "date_created": "9 April 2017"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "0ece470dfe6d269b", "rating": 5.0, "text": "De travail et fatigué d'humiliation je beaucoup veux juste un Travailler Merci Endroit merveilleux", "pros": "fatigué", "cons": "Insulte trop", "date_created": "5 April 2017"},
{"id": "b3178d73db3dc7ac", "rating": 5.0, "text": "A lot of opportunities to grow, funplace to work & you meet new people all the time. Diversity and a lot of different people from different cultures you get to know.", "pros": "Running Lunch", "cons": "Could get busy at times", "date_created": "4 April 2017"},
{"id": "02065449b7cf98a5", "rating": 4.0, "text": "Great job for forming connections with community members and media outlets wanting to make a difference.  A very feel good place to work at that, while it required a great deal of effort prior to its annual event, held equal rewards.", "pros": "Professional Outings and Community Involvement", "cons": "Volunteer Job so, no pay for lots and lots of work.", "date_created": "3 April 2017"},
{"id": "4b69a5a2e4735a19", "rating": 5.0, "text": "This was a tight-nit team with many dynamic skills and abilities. Everyone (including myself) was willing to pitch in and assist in any role, whether it be administrative, hands on, or heavy lifting.  The environment is always changing and challenges come up constantly, but the morale made everyone want to help and come together to complete the project.", "pros": "fed on site, great team", "cons": "Long hours (late too)", "date_created": "1 April 2017"},
{"id": "22d5b903546ba74d", "rating": 4.0, "text": "- had to fill and then empty the wading pool, which took a long time\n- the rest of the day there was a lot of just sitting around so it got boring\n- average amount of trainings", "pros": "", "cons": "", "date_created": "29 March 2017"},
{"id": "3f8b15778305ef17", "rating": 5.0, "text": "Loved working there and volunteering for two years. however my third year due to the lack of snow i got no hours of work in. Great staff and an amazing job overall.", "pros": "", "cons": "", "date_created": "29 March 2017"},
{"id": "afb11daa721150fb", "rating": 5.0, "text": "Awesome placd to have worked over the last 35 years..great friendships with  fellow employees..and worked for good bosses over the years..it was a great place to work operating heavy equipment..", "pros": "", "cons": "", "date_created": "28 March 2017"},
{"id": "51eaef0fa2dc60ae", "rating": 5.0, "text": "It was fun to work with the City of Toronto, a lot of great workers and a lot of opportunities to move up. A typical day would be coming in early and teaching for half of the day and then for the second half of the day there would be a lifeguard position until the shift was over.", "pros": "", "cons": "", "date_created": "24 March 2017"},
{"id": "d3e060844934d2e2", "rating": 3.0, "text": "To assist recreation and facility staff with the delivery of recreational programming, the accommodation of permit groups and the provision of client customer service.\nThis job has helped build my communication skills both verbally and written. \nhardest part of the job - hours are not consistent", "pros": "secure hours", "cons": "shift coverage", "date_created": "18 March 2017"},
{"id": "f8cbd0355e47d256", "rating": 5.0, "text": "As a computer tutor my job is to assist clients that come in with any technical issues they may encounter while using the community centre. Employees work as a team to ensure that every client is assisted effectively and efficiently.", "pros": "", "cons": "", "date_created": "15 March 2017"},
{"id": "a20f22741af4d6de", "rating": 5.0, "text": "I enjoyed working for the City of Toronto for 12 years. Good job security with great pay and benefits, good work culture, supportive management but over 12 years I found it wasn't motivating or challenging enough.\nAlso, when they go on strike every few years, you do not get paid and it puts you in dire situation.", "pros": "Great pay and benefits, good work culture, supportive management", "cons": "Monotonous work - not challenging and no pay when on strike", "date_created": "14 March 2017"},
{"id": "73eea28e5d09492e", "rating": 4.0, "text": "Very difficult to get hired, but nearly impossible to get fired once hired. Decent pay compared to other lifeguarding jobs, good for students or adults with the summers off.", "pros": "", "cons": "", "date_created": "13 March 2017"},
{"id": "1a589b402d8cffba", "rating": 5.0, "text": "Would highly recommend working for the City of Toronto. Great professional atmosphere, keeps you very busy. I very much enjoy representing the City of Toronto.", "pros": "", "cons": "", "date_created": "6 March 2017"},
{"id": "d998902d4abf95b9", "rating": 4.0, "text": "A good place with only lateral mobility.  The work culture is open to new ideas and implementation of those ideas required many levels of review before implementation.", "pros": "Good benefits", "cons": "Highly structured", "date_created": "5 March 2017"},
{"id": "d344faed50127aea", "rating": 3.0, "text": "Lack of leadership\nEverything is hidden and swept under the carpet away from the politicians\nYou have to be a Yes person to survive\nThe Transformation Project is used to get rid of existing staff", "pros": "Pension and benefits", "cons": "Toxic office environment", "date_created": "3 March 2017"},
{"id": "64de4cd74385c823", "rating": 4.0, "text": "Working for the City of Toronto Camps was fun. There were always new experiences to be had and new people to meet. The pay is good for a starting job but not for something full time, for my role at the camp. Hardest part of the job was dealing with stubborn and unthankful people but usually the job was great.", "pros": "", "cons": "", "date_created": "1 March 2017"},
{"id": "5e5aa4f49c2aa246", "rating": 5.0, "text": "Colleagues and other supporting staff are friendly accommodating and extreme helpful. A typical work day involved maintaining and operating ski lifts which works on a rotating schedule 1 hour out 30 minutes in. The position was for the 2017 winter season and allows you to build relationships with people and network with other staff who occupy managerial roles and other supporting roles.", "pros": "Rotating shift, flexible hours, friendly staff", "cons": "Subject to cold weather and potential ski lift closures", "date_created": "28 February 2017"},
{"id": "bbf5956a9a93ea83", "rating": 5.0, "text": "City Of Toronto is a great place to work. It's usually very hard to get a job here but when you do you don't regret it! It's a very relaxed environment but can get busy at times. Very accommodating to everyone, but can sometimes be hard to get hours.", "pros": "having fun while working, very relaxed", "cons": "no benefits", "date_created": "27 February 2017"},
{"id": "d2c764d91fd24d82", "rating": 5.0, "text": "Staff are very friendly and everyone wants to work as a team. salary is higher than most other pools I have worked at. Taught half hour instructional programs for 3 hours and lifeguarded for 2 hours.", "pros": "Good salary, great staff", "cons": "difficult location", "date_created": "25 February 2017"},
{"id": "78a880a8650c37db", "rating": 5.0, "text": "I like my job and variety of tasks from client services through the updating databases, research  and creating reports toward physical part of the job - packing boxes, labelling and transferring them to the off site storage. I like a lot being fully responsible for my tasks and being able to make some decisions about how my day and  month will look like, as i could prioritize my tasks and choose projects.", "pros": "Separate private office, stable hours, cross trained for holiday breaks", "cons": "Not much of the daylight on premisses", "date_created": "23 February 2017"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "7ae528de909d7d3e", "rating": 4.0, "text": "Strong support and focus on customer service and modernization \nSome great people - dedicated \nA lot of movement in terms of modernizing services", "pros": "", "cons": "", "date_created": "15 February 2017"},
{"id": "9d9a69474e91c207", "rating": 4.0, "text": "Working part time in high school, the City was very accommodating in terms of me building my own schedule and being able to pick my own hours. As a full time summer job, we were guaranteed a full work week, which is beneficial as many of the employees are students saving for school, so the City really looks out for students. In this job I learned how to communicate within a team and leadership skills.", "pros": "", "cons": "", "date_created": "8 February 2017"},
{"id": "9b0ad9f8c404305c", "rating": 2.0, "text": "I loved teaching. The students were fantastic. But the supervisor and most of the staff were lazy. It was a pain getting supplies and receiving pay. It turned out to be more stressful than fun.", "pros": "", "cons": "", "date_created": "2 February 2017"},
{"id": "5896a4811b4b1cd2", "rating": 5.0, "text": "Amazing job environment \nFun place to make friendships \nNot alot of room to grow due to the seniority process and job screening process\nEnjoyable part is working with the youth and the rewards of seeing kids and their talents", "pros": "", "cons": "", "date_created": "2 February 2017"},
{"id": "d6bb02258f30c646", "rating": 4.0, "text": "Check the work phone for children absences \nprepare daily snacks after snack as the coordinator i let the children know the daily program and follow through with the day", "pros": "", "cons": "", "date_created": "2 February 2017"},
{"id": "54ad95a8cff802e0", "rating": 5.0, "text": "City of Toronto aquatics is an amazing job to have. Easy to switch shifts if you can not make a shift. Friendly work environment with amazing management.", "pros": "Great co-workers", "cons": "Some days are stressful", "date_created": "30 January 2017"},
{"id": "7b7d159ac6a55804", "rating": 5.0, "text": "lots of room to grow \nwill get to where you want if you try\nsupervisors are very helpfull in training and teaching\nlearn lots increase your knowledge \nput in your time and it will pay of at the end", "pros": "", "cons": "", "date_created": "28 January 2017"},
{"id": "20df82ad34ac0958", "rating": 5.0, "text": "Great place to work. Very easy going and supportive. Also very flexible with work schedules. People who work there are nice.", "pros": "", "cons": "", "date_created": "27 January 2017"},
{"id": "8da9929d2dbe44e1", "rating": 4.0, "text": "I would get into the office, check any email requests for Parks equipment. Check Salt loads, File complete request forms and sit in on Safety meetings. \nI learned how the city operates and how to work with the community. \nManagement was always helpful, friendly and understanding limitations. \nWorkplace culture was very business like a bit casual but professional \nHardest part was deadlines as I was not allowed to have overtime so completion through the work day could get concerning. \nGetting to visit different parks and community centres in the City was a highlight. Working for Pan Am games promotion as well.", "pros": "Meeting great people and contacts.", "cons": "Short hours, no benefits or job security", "date_created": "27 January 2017"},
{"id": "0479c4689b273e37", "rating": 5.0, "text": "Challenging but it will enhance knowledge and skills.\nl have Iearned how to manage time, organizational skills, and prioritize. Co-workers are very cooperative and they are always collaborate each other.", "pros": "", "cons": "", "date_created": "18 January 2017"},
{"id": "6dc1681343cc99e3", "rating": 4.0, "text": "Paid well and on time, typical benefits/drawbacks of working for the city/in a union. Frequently rotated while guarding, given a short prep period before an instructing shift.", "pros": "", "cons": "", "date_created": "11 January 2017"},
{"id": "468d9dacd5048fe2", "rating": 4.0, "text": "A typical day at work is pretty interesting and it is a great way to meet different people. It is a good way to increase customer service skills, but it can get repetitive.", "pros": "Meet so many people", "cons": "Doing the same thing every day", "date_created": "11 January 2017"},
{"id": "4cb7de8c15b5c32c", "rating": 4.0, "text": "Worked there 36 years,lots of available overtime and benefits A very good pension after 35 years of service, weather on days or sift work.Lots of available training and advancement if wanted. Also had a strong union to back the employees. Transferring from department was also possible.", "pros": "Benefits and pesion", "cons": "Shift work", "date_created": "10 January 2017"},
{"id": "f626c338531e2bab", "rating": 4.0, "text": "- you learn customer service skills\n- you get to be in a team environment\n- you get to work with amazing staff\n- The hardest part of the job is when you have patrons yelling at you\n-the most fun part is teaching people how to swim", "pros": "friendly staff", "cons": "nothing", "date_created": "5 January 2017"},
{"id": "d6e9c8e5715a3111", "rating": 5.0, "text": "Working for the City of Toronto has always been exciting. Daily you can find yourself dealing with parents, issues participants have, or participating in a plethora of activities. Management has always been approachable and seem to genuinely care about their employees. Fellow associates have always been very sociable, with many team building \"outings\" organized. The most enjoyable part of working with the City of Toronto would definitely be seeing each participant learn and excel in whatever program they register in.", "pros": "", "cons": "", "date_created": "5 January 2017"},
{"id": "de1043760a91edfd", "rating": 5.0, "text": "Making sure the children are well looked after and all programs are being ran smoothly. Planing future programs for the youth.", "pros": "", "cons": "", "date_created": "5 January 2017"},
{"id": "9f7f56bb457c9e8d", "rating": 4.0, "text": "Connected to the youth who were apart of the program & taught them basketball skills that would help them get prepared for big tournaments & games", "pros": "", "cons": "", "date_created": "31 December 2016"},
{"id": "8b574ab75173f68a", "rating": 5.0, "text": "People, salary, environment are fantastic.\nit is a good company if you look at it from the corporate site \naaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa", "pros": "", "cons": "", "date_created": "30 December 2016"},
{"id": "64e9a50e5e6b8351", "rating": 5.0, "text": "Working with the City of Toronto Parks, Forestry, and Recreation was an exceptional experience.  I learned much from this position and am eager to apply the skills acquired from this position into other fields.", "pros": "Accommodating Hours", "cons": "No Cons", "date_created": "26 December 2016"},
{"id": "4f66f8e567d2171b", "rating": 5.0, "text": "This is a bright cherry place. The facility is relatively new and used by many residents in the city. It's kept clean and Management and Staff are always a pleasure.", "pros": "", "cons": "", "date_created": "19 December 2016"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "4491de3294bbe2b5", "rating": 4.0, "text": "ICity ofToronto is a place to work for people who want to have an impact on the lives of people living there.  I worked on many projects: community centers, employment places, civic centers, daycares and senior homes, public health and historical buildings.  I walked under the City in most of the pipes including intakes under the lake, I flew planes taking aerial photos and climbed in trenches inspecting water main construction.", "pros": "working on many interesting projects and to see them used", "cons": "very demanding and busy", "date_created": "11 December 2016"},
{"id": "04bb2cbea81d74be", "rating": 4.0, "text": "The City of Toronto provides a very welcoming environment with excellent benefits and job security. I would recommend working there to others.", "pros": "", "cons": "", "date_created": "10 December 2016"},
{"id": "3ee1ca90619999e2", "rating": 5.0, "text": "Working with the city was a great overall experience. They truly care about their employee's and make it easy to work for them. This job required a lot of program planning, event coordination, patience, and networking skills to succeed in.", "pros": "", "cons": "", "date_created": "8 December 2016"},
{"id": "74fa84a0af73f902", "rating": 4.0, "text": "Very good job for a student's lifestyle. Get to pick shifts once you get hired. There is a union involved with this job but you don't have to actively get involved but you pay dues and it is there to protect you if there is a dispute of some sort.", "pros": "union", "cons": "none", "date_created": "7 December 2016"},
{"id": "0e9891faca9d19cf", "rating": 5.0, "text": "- Good place to work with nice pay and benefit.\n- Friendly co-workers and rewarding environment\n- diverse corporate culture\n- Good work/life balance\n- formal training provided", "pros": "good work/life balance, good pay", "cons": "Hard to retain as a permanent full-time employee", "date_created": "15 November 2016"},
{"id": "b165183ad448acf4", "rating": 5.0, "text": "exellent work . learned a lot about nursing skills. good co workers. responsibilities for many patients. Team working", "pros": "", "cons": "", "date_created": "9 November 2016"},
{"id": "f12ffc4cea1134ad", "rating": 5.0, "text": "Pleasant day at work. learned a lot about nursing job. management excellent. Team working with co workers.Hardest was as a supervisor responsible for 500 patients in the evening. enjoyable pary teamworking.", "pros": "", "cons": "", "date_created": "9 November 2016"},
{"id": "d7ff0fbd7a18e5f5", "rating": 1.0, "text": "Poor work experience. No proper staff issue resolution.\nWork here was rife with political undertones and poor communication skills by management. Work issues could have been better resolved.", "pros": "", "cons": "", "date_created": "6 November 2016"},
{"id": "e1168fb5146c0d9b", "rating": 4.0, "text": "The job is very easy and if you are good at talking with people and de-escalating some situations this job is for you. It is not very engaging and a lot of the time you are just sitting there or skating in circles.", "pros": "", "cons": "", "date_created": "1 November 2016"},
{"id": "f2ca67b7294db6eb", "rating": 3.0, "text": "City of Toronto has great benefits for employees. However there is not much room for transitioning to other departments for non-union staff as union staff keep getting priorities over others and room for growth isn't very good.", "pros": "", "cons": "", "date_created": "30 October 2016"},
{"id": "87548e1c47e23b4e", "rating": 4.0, "text": "Very easy and manageable job, it's a great social environment. The staff and the community is very friendly.\nEasy to get along with parents and kids as long as you know the surrounding.", "pros": "Friendly Staff", "cons": "Some kids aren't easy to work with, but managable!", "date_created": "29 October 2016"},
{"id": "1310347c152353ad", "rating": 5.0, "text": "I worked at web rev team, it was a good place to work, life work balance, \n managers are knowledgeable and supportive. mostly open to new technologies.", "pros": "", "cons": "", "date_created": "17 October 2016"},
{"id": "db61631f62cef8d7", "rating": 5.0, "text": "Movement within the city became a lot easier.  Networking possibilities were broadened.  City of Toronto commits to training their staff and making sure their employees are knowledgeable in policy and procedures.", "pros": "", "cons": "", "date_created": "13 October 2016"},
{"id": "5fb29dfc051acae6", "rating": 4.0, "text": "Cons:   Getting the kids to listen and the there was no structure of the program planning.\nWhen I switched to the position of Adapted and Integration Staff. Less pay. I feel that the A&I staff should be paid as the camp staff because they're putting so much work and effort in managing children with disabilities and behaviour problems. To get less pay than the camp staff is not fair. We put smooch work in watching the participant, and when they or if they act up we are responsible and sometimes it can be draining to deal with the stress. Sometimes we get bitten by them when they act up. I think we deserve to be paid the same as any staff. \nPros: Getting connected with the participant and building a professional relationship with the participant. Trips and seeing the participant getting excited on the trip or activities they're involved in. To see that the participant is having a good time, shows that my work is done successfully. \nHaving the kids at the program enjoying the games and everything when the program had its rules and structure. It went smoothly at the end.", "pros": "Trips", "cons": "Less pay", "date_created": "11 October 2016"},
{"id": "ecc0a21897ff0e32", "rating": 5.0, "text": "I worked with City of Toronto more than a year. It is a nice place to work. It is like working in a family.\nWorking hours are also flexible and team is also very cooperative.", "pros": "", "cons": "", "date_created": "7 October 2016"},
{"id": "32bba9e07d4189ba", "rating": 4.0, "text": "Great salary and benefits, good staff.  Friendly atmosphere.\nMust have a high tolerance for smells, confined space environments, working at heights and in noisy areas.", "pros": "", "cons": "", "date_created": "3 October 2016"},
{"id": "095a6ec7a1683235", "rating": 5.0, "text": "Good environment, good benefits and always opportunities to learn something new. A lot of training involved on job site or courses. Courses available for employess", "pros": "", "cons": "", "date_created": "26 September 2016"},
{"id": "37f0f573e21b0346", "rating": 4.0, "text": "my co-weorkers are friendly, they tend to be on the younger side. Working with the public via a municipality can be challenging. They are often confused about which branch does what.", "pros": "", "cons": "Part time - difficult to move up", "date_created": "20 September 2016"},
{"id": "3b4af96e0fd6c24d", "rating": 5.0, "text": "Overall maintenance of parks throughout my designated area.\nReport any service that may be subject to other divisions ie. Cutting trees\nInteracting with City people", "pros": "", "cons": "", "date_created": "20 September 2016"},
{"id": "dac8d029dae3387b", "rating": 3.0, "text": "I really loved my boss and the opportunities this job presented for me in my future career. thank you City Hall. Work was very busy as I managed 2 assistants and the councillor's daily schedule.", "pros": "", "cons": "", "date_created": "17 September 2016"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "fa636c88699682a9", "rating": 4.0, "text": "Pros\nWorking at the city was my first real office job and entry into a corporate environment. Working in the IT department was very relaxed. There's a fairly progressive vibe, you'll see people walk around to consult with other team members. Most of the full-time staff here are middle-aged (and older) adults who've been working here for decades, so the atmosphere is more like a toned-down, conservative, classic office. That's not to say they couldn't or didn't adapt to modern web technology though, which they were constantly looking at to implement.\nCons\nAs a student, there wasn't much orientation and I didn't know what to expect in terms of company culture. My entry felt sort of impromptu. I also didn't learn much \"on the job\", but I guess that might've been expected with my novice qualifications and probably them not wanting to bring me onto a team that dealt with something important. I did pretty basic html (bootstrap) and javascript pages, as well as some minor QA, cleanup, and documentation. I appreciated the exposure though.", "pros": "", "cons": "", "date_created": "14 September 2016"},
{"id": "2f7816195a2d0d5b", "rating": 5.0, "text": "it was fun and filled with smiles surrounded by many happy kid and volunteer and sommitted staff. it was a safe place very energetic and fun . activities were fun", "pros": "", "cons": "", "date_created": "12 September 2016"},
{"id": "c78391b8032e0c53", "rating": 5.0, "text": "Many shifts are available and is unionized. very good for part time workers especially high school students. very well organized and are always willing to accommodate when needed.", "pros": "", "cons": "", "date_created": "12 September 2016"},
{"id": "25d2e6e78ba4422d", "rating": 4.0, "text": "A very enjoyable working environment. Judgement-free, and provides me with a fun way to spend my summers working with like-minded individuals.", "pros": "", "cons": "", "date_created": "2 September 2016"},
{"id": "72b6aed21740d45f", "rating": 5.0, "text": "I've enjoyed working with the city and interacting with staff and clientele. A typical day at work may consist of filig, interacting with clients, producing cheques,drug cards eye glass vouchers, and attending/forwarding calls to workers. I've learned how to work at a quick pace, and how to stay organized.", "pros": "the pay is great", "cons": "some clients may be agitated", "date_created": "1 September 2016"},
{"id": "a062902086fc703f", "rating": 5.0, "text": "great and fun place to work at. one of the best cities that offers great programs and services for the general public. great environment and great coworkers.", "pros": "", "cons": "", "date_created": "1 September 2016"},
{"id": "dcb7ff9c7db03fc5", "rating": 4.0, "text": "Working for the City of Toronto was one of my best jobs. I've learned a lot about customer service and took part of many staff development training courses. My co-workers were friendly and knowledgeable and I've learned what I know today from them. The hardest part of the job was meeting with unhappy customers but with experience, this became easier. The most enjoyable part of the job was seeing my customers happy.", "pros": "happy customers", "cons": "unhappy customers", "date_created": "16 August 2016"},
{"id": "ff72f585660f4d2a", "rating": 4.0, "text": "I enjoy working for the city of Toronto, I have good job security and I like working with my co workers in aquatics. Although, I don't have many benefits and the hours can be long.", "pros": "good job security", "cons": "long hours, no benefits", "date_created": "13 August 2016"},
{"id": "ddc9927f5ea1752a", "rating": 4.0, "text": "People that work for the city of toronto are great people t work with, they are fun energetic and bring a lot of customer service to the table which is great when interacting with parents and kids", "pros": "", "cons": "", "date_created": "12 August 2016"},
{"id": "b062b23e1ed6ed7e", "rating": 5.0, "text": "Administrative task including the preparation, research and reconciliation of data for control and expedition of documents.\nI also process documents.", "pros": "security", "cons": "slow advancement", "date_created": "11 August 2016"},
{"id": "1536098cd8b8b14f", "rating": 5.0, "text": "It was very fun to do. All we had to do was make sure the people who came were safe and make sure the ice was safe as well. working for then was fun and amazing only problem is that the pay was not the greatest.", "pros": "Hours", "cons": "Short pay", "date_created": "22 July 2016"},
{"id": "4d22dc562971b0a8", "rating": 5.0, "text": "Working in the public service provides the opportunity to serve the public interest  and to make a difference to the citizens of Toronto , to individuals and corporations looking for services, entertainment and business opportunities.", "pros": "Benefits and working conditions are excellent", "cons": "", "date_created": "21 July 2016"},
{"id": "5c9d93ef2af11d1f", "rating": 5.0, "text": "The work environment was comforting\nDeveloped cooperative relationships with co-workers\nEnjoyed the company of the youth", "pros": "", "cons": "", "date_created": "18 July 2016"},
{"id": "b4f3705ac919f52a", "rating": 5.0, "text": "Complete youth's needs assessment and collaborate with staff to determine most important needs. Positive interaction with clients.", "pros": "", "cons": "", "date_created": "13 July 2016"},
{"id": "cb283b9ff29b8bcc", "rating": 5.0, "text": "great place to have worked\ngreat co-workers.\nan over-all friendly environment\nmeet so many people \nhad various jobs in my time there and all were knowledgeable and at times demanding to complete work.\nmanagement people were a joy to work for\nmiss those days. life goes on. new adventures.", "pros": "enjoyment of working in a no stress environment", "cons": "retirement", "date_created": "11 July 2016"},
{"id": "84b35c08020df63d", "rating": 5.0, "text": "I have enjoyed working for the city of Toronto for the past thirteen years as a Customer Service Representative. I have received a great amount of knowledge thats has helped me gain the confidence I have in myself as a front desk receptionist and i am very appreciative of the extensive support and training I have recieved.", "pros": "Great relationships", "cons": "difficult to get permanency", "date_created": "4 July 2016"},
{"id": "ead0d532abf48a2d", "rating": 5.0, "text": "I work summer camp for 2 weeks in july and 1 week in August.\n- I am a pre school camp leader\n- Learned how to be patient with kids\n- Get along with all of my co workers\n- I have fun everyday and everydays different.", "pros": "Trips", "cons": "not enough lunch time", "date_created": "22 June 2016"},
{"id": "9f670f6ee559ecd7", "rating": 4.0, "text": "A great learning experience for students. Preceptors are knowledgable and will go out of their way to help you learn. Support staff can sometimes be challenging to work with. The facility at Kipling Acres is very well managed, residents are happy and everything is up to Ministry of Health and Long Term Care standards.", "pros": "Good pay once employed, job security", "cons": "Paper documentation, no hire after graduation, no internal recommendations", "date_created": "22 June 2016"},
{"id": "6c72b3ce272b328f", "rating": 4.0, "text": "Made everyone feel comfortable that worked there, fair and reasonable with staff members. Everybody working there had a strong work ethic.", "pros": "", "cons": "", "date_created": "20 June 2016"},
{"id": "6de843c9adb732b5", "rating": 5.0, "text": "I love my job with the city, it has been a very good experience and I am looking forward to starting my job again after the summer break", "pros": "", "cons": "", "date_created": "31 May 2016"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "22765492998fc50b", "rating": 3.0, "text": "The benefits of a union pay grade at the municipality is why the positions are so competitive and highly sough after. But work is baseline and boring.", "pros": "", "cons": "", "date_created": "30 May 2016"},
{"id": "37f13456a6e8dec4", "rating": 5.0, "text": "Great environment to work in. Always a positive atmosphere. Room for growth. Great Management. Great job culture. Great job security.", "pros": "", "cons": "", "date_created": "26 May 2016"},
{"id": "f158dbe724aad6d7", "rating": 5.0, "text": "In this work term, I paticipated in the daily work of Optimized Maintenance Unit in Toronto Water. I gained experience in facility management and project scheduling. I also benfited from the internal training system on various courses.", "pros": "", "cons": "", "date_created": "21 May 2016"},
{"id": "0618607c9dbcaa24", "rating": 5.0, "text": "working with the city was great and i am still doing it because i love working with them and it is a fun job to do. A typical day at work would be arriving then setting up all the policy and procedure signs that the City of Toronto has. Then I would have to make sure that the ice is in good condition for the patriants to skate on. The most enjoyable part of the job is being able to skate the entire time and getting to interact with people while we work. My co-workers are all amazing people and i love working with them we all have loads of fun working together.", "pros": "only working weekends", "cons": "more money for such little hours", "date_created": "9 May 2016"},
{"id": "1683bb0b5545131c", "rating": 4.0, "text": "A very welcoming and home feeling like work environment. with friendly and productive co workers. fun enjoying work environment.", "pros": "stay fit by channeling energy into movement", "cons": "no real good benifits to use", "date_created": "8 May 2016"},
{"id": "f70754c192f1d2ad", "rating": 5.0, "text": "Fantastic stability and job security. Challenging job, management turns over frequently. Good pay and benefits. Unionized environment.", "pros": "", "cons": "", "date_created": "5 May 2016"},
{"id": "3651d436618ad493", "rating": 5.0, "text": "Working for the City of Toronto Parks and Recreation has been a great learning experience. Amazing Co-workers and great students. Seasonal shifts make it difficult to maintain throughout the entire year, therefore I am seeking secondary employment.", "pros": "", "cons": "", "date_created": "25 April 2016"},
{"id": "e5c0a7a41b01b9ae", "rating": 4.0, "text": "Fun workplace enviroment for students, short hours, but build your own schedule. Not much room to move up with. Co-workers are usually around your age, learn valuable life skills. Hardest part of the job is having and maintaining positive costumer relationships.", "pros": "", "cons": "", "date_created": "19 April 2016"},
{"id": "d6f01faa953f5ed6", "rating": 2.0, "text": "terrible supervisor, but overall day to day work pretty easy.  Some of the rules made no sense.  People working for the city (generaly higher up positions) were very rude.", "pros": "", "cons": "", "date_created": "18 April 2016"},
{"id": "a8559cc385623891", "rating": 5.0, "text": "Amazing work environment with great opportunities for career advancement. The management is helpful and skilled to assist you in the career progression. Working with the biggest City in Canada allows you to learn skills in a fast paced work environment.", "pros": "", "cons": "", "date_created": "15 April 2016"},
{"id": "8cc4305a911b060b", "rating": 5.0, "text": "As a volunteer with Toronto Parks and Recreation, I helped out with the basketball program. We would bring the kids in and show them skills and put them through drills and exercises and at the end of the session we would play a game with them. I learned a lot about dealing with young children and parents. My co workers were also very fun and energetic as they also made the program very enjoyable for everyone. The hardest part of the job would be getting kids to pay attention and co operate at times but the best part of the job would be seeing them have fun and be happy.", "pros": "", "cons": "", "date_created": "12 April 2016"},
{"id": "6e3438d7a4c05579", "rating": 4.0, "text": "Excellent team members, and a lot of responsibilty offered for this position.  Accuracy and efficiency were key to performing this job effectively.", "pros": "", "cons": "", "date_created": "9 April 2016"},
{"id": "601c5647685d0528", "rating": 5.0, "text": "For the Instructional Skating I had learned how to teach children how to skate. The hardest part was when doing report cards for the children because I always liked the children that I had in my group and it was hard for me to give my report to a parent that their child has not passed the level.", "pros": "", "cons": "", "date_created": "6 April 2016"},
{"id": "ba147f8d5a526416", "rating": 5.0, "text": "I have gained valuable lifetime experiences while obtaining the comprehensive understanding of the technical and communicational skills.\nA friendly and enthusiasm environment with great managers and team members.", "pros": "", "cons": "", "date_created": "1 April 2016"},
{"id": "17fd12a35f7860f9", "rating": 4.0, "text": "Teach children to swim from all age groups. Great way to develop social kids and handle paper work. Supervisors are easy to speak to and help you become a better instructor.", "pros": "", "cons": "", "date_created": "28 March 2016"},
{"id": "a686b654e4e46556", "rating": 4.0, "text": "9-5 job. Must be very energetic and love to swim and interact with children. Organized schedule for parents and staff easy to read to know what is happening every day.", "pros": "", "cons": "", "date_created": "28 March 2016"},
{"id": "2e18b4ae027aeb13", "rating": 5.0, "text": "i worked as a rink guard serving the general public. It was a very fun job as i was able to interact with different people every day. my coworkers were incredibly nice and very helpful.", "pros": "good pay", "cons": "working in the cold", "date_created": "13 March 2016"},
{"id": "ef089116f211a98d", "rating": 5.0, "text": "The most enjoyable day at work is attending work and seeing my participate face.Being able to processed with my program & interacting with children, co workers and care giver on a high warm welcome volume allows me to make room for improvments", "pros": "Co workers and management", "cons": "leaving at the end of my shift", "date_created": "8 March 2016"},
{"id": "815e055b06819f60", "rating": 5.0, "text": "I enjoy my job incredibly! You have flexible hours and the work load is very light. Its easy and every other co-worker is your friend. The tough parts of work are keeping up with your qualifications, but luckily your CRP can help you remember when things expire. Sometimes shifts may start at 5am which are hard to wake up for. The most enjoyable part of working as an instructor is getting complimented by parents and how much you mean to their kids.", "pros": "Amazing atmosphere", "cons": "Early morning shifts", "date_created": "29 February 2016"},
{"id": "0007a75e87ed30ab", "rating": 5.0, "text": "- Positive work environment\n- Opportunities for growth\n- Flexible hours\n- Variety of positions available\n- Opportunities to receive various beneficial trainings and certifications", "pros": "", "cons": "", "date_created": "22 February 2016"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "56d6e086d3aa0de7", "rating": 4.0, "text": "I worked in Parks and Recreation department for 4 seasons then I quit - I could not stand the winey spoiled union (full-time) workers for another season. The pay and benefits are more then most of us will ever see but the workers complain all the time and most are very lazy.  The work is great, management is pretty good - they are all lucky to be working there.", "pros": "Wages & benefits", "cons": "Spoiled unionized workers", "date_created": "20 February 2016"},
{"id": "5f7037a5f34c648a", "rating": 4.0, "text": "I have been working for the city for years now and it has been a great experience. I enjoy the multiple roles that I am apart of.", "pros": "experience", "cons": "senority", "date_created": "10 February 2016"},
{"id": "2dbe2d35f05f62b5", "rating": 4.0, "text": "In a typical day I learned how to manage time very well as I had a strict schedule that I had to stick to.  Co-workers were very friendly, and management gave you room to work on your own.", "pros": "Staff", "cons": "Physically tough (sometimes)", "date_created": "3 February 2016"},
{"id": "9fb1d96fe590d9cb", "rating": 5.0, "text": "typical day - taking calls and assisting customers with their travel plans\nmanagement and co-workers- friendly and helpful\nhardest part of the job - extreme service levels\nmost enjoyable - the feeling of successfully planning someone's holiday", "pros": "free tickets", "cons": "long hours", "date_created": "29 January 2016"},
{"id": "bb40686ecb1c2f6f", "rating": 5.0, "text": "the city of toronto is my second home a family a family of good workers management making each and every day great day every one is one", "pros": "help when needed", "cons": "40 hours 8 hours per day", "date_created": "15 January 2016"},
{"id": "5451ff6ee6aa2b12", "rating": 3.0, "text": "working with the city of Toronto has been a very fast paced environment, with meetings every week with different groups and a lot of dynamic scheduling processes. when working with the city of Toronto you see the dynamics in which they work and how passionate they all are with their job. its a great environment", "pros": "", "cons": "", "date_created": "11 January 2016"},
{"id": "1552e04dba4a44d1", "rating": 4.0, "text": "Great job with great pay and benefits.You do not take your work home with you so its great for balancing a family. It has amazing job security but it is hard for quick growth within the City of Toronto. Management has its good and bad apples like any company.", "pros": "", "cons": "", "date_created": "7 January 2016"},
{"id": "5eaef340e2088725", "rating": 5.0, "text": "Had a temporary 4-months position as a technical trainee. Enjoyed it greatly. Gained an insight into how large environmental projects operate.", "pros": "semi-flexible schedule", "cons": "", "date_created": "4 January 2016"},
{"id": "72b7d12f8f993b2d", "rating": 4.0, "text": "There is so much to say.\nThe management is fair and consistently trying to improve quality and quantity of work\nEach day, you come to work and leave work at work.\nThe people who work there are very nice.\nThe hardest part of my day is pushing my limits and striving to achieve perfection as well as increasing my workload\nThe most enjoyable part of my day is when I achieve my goals I set out for myself on a daily basis based on workload", "pros": "The work is consistant, the people are enjoyable to work with, the environment is clean and safe", "cons": "Been working 5 years and am unable to get Full Time", "date_created": "29 December 2015"},
{"id": "9318caf9b72847cb", "rating": 5.0, "text": "working with the city is a great learning experience. it opened lots of doors for me in various job fields. i recomand this to employees who are looking forward to expanding their knowledge and experience in the recreational field", "pros": "", "cons": "", "date_created": "28 December 2015"},
{"id": "3e46748f2a958f99", "rating": 4.0, "text": "daily safety circle check required.\nteamed with partner most days\ngood work environment\nsafety procedures are very important and are enforced", "pros": "", "cons": "", "date_created": "15 December 2015"},
{"id": "8f24dcacaf30ccc1", "rating": 4.0, "text": "I teach classes in different locations, I have learnt you can never make everyone happy in broad classes... I don't see co-workers, I see different staff all the time.  \nHardest part of the job the long travel time and distance ... no regular hours.\nI do what I love and love what I do especially dealing with the public which brings the customer service to an excellent level.", "pros": "The flex hours", "cons": "No regular hours or fixed income, travel time isn't cover and no benefits as part time instructor", "date_created": "28 November 2015"},
{"id": "5b7498a0a8d276f5", "rating": 5.0, "text": "excellent opportunity to learn, \nsafe work enviroument \nfriendly co-worker and management.\nDecent salary even for entry level position.\nLots of union activities and support", "pros": "", "cons": "", "date_created": "26 November 2015"},
{"id": "bae15e0fbf134e07", "rating": 4.0, "text": "Hardest part of the job would have to be remembering everyone's names. The best thing would have to be seeing the kids get the physical benefits they need.", "pros": "prep time", "cons": "a lot to clean up", "date_created": "23 November 2015"},
{"id": "82d0a12f53d468eb", "rating": 4.0, "text": "Working as a lifeguard and swim instructor provided me insight into the operation of recreational programming in the city. While there is a lot of bureaucracy and politics at the management level, it is a great first job and helped develop my communication, problem-solving, time-management and organizational skills.", "pros": "", "cons": "", "date_created": "19 November 2015"},
{"id": "ce3e2a8376c0d40e", "rating": 5.0, "text": "I love to work with people and being a fitness instructor gives me the opportunity to meet and interact with all different types of wonderful people everyday.\nHowever, after taking a long break from the corporate environment due to taking care of my aging parents I am now ready to engage and put my time and efforts back into the role of Credit & Collections, Accounts Receivable, Cash Application etc.", "pros": "Meeting and interacting with people everyday", "cons": "Won't be able to have breakfast at 10 am in the morning in my pj", "date_created": "3 November 2015"},
{"id": "3f208e4c2ebd7099", "rating": 1.0, "text": "A challenging environment to work in. Evaluations with employees and management should be mandatory on a regular basis.", "pros": "good pay and benefits", "cons": "Not very much personal time", "date_created": "30 October 2015"},
{"id": "f24c1d7ce59a4e48", "rating": 4.0, "text": "The City of Toronto provides a flexible work environment that fits a wide variety of lifestyles. I was able to work for them throughout high school, and seasonally while i was away for university. The job is primarily about making sure the public is satisfied with its service, which at times produces conflict. This job is definitely customer service oriented, so be prepared. Ultimately, the positive experiences with the kids outshine most negative experiences", "pros": "Flexible hours", "cons": "Emotionally Demanding", "date_created": "30 October 2015"},
{"id": "f819226b4698ef8f", "rating": 5.0, "text": "Great atmosphere and very fun place to work.  A great place to learn and grow.  Management and employees are all in it together", "pros": "", "cons": "", "date_created": "21 October 2015"},
{"id": "a3038d2e4cd3bb35", "rating": 5.0, "text": "-worked with great staff\n-got along with everyone \n-great training \n-supervisors were helpful\n-great stepping stone job\n-many people become life guards after\n-great way to make money over the summer", "pros": "", "cons": "", "date_created": "16 October 2015"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "26db23c3ec2d7b4b", "rating": 5.0, "text": "Working for the city of Toronto is an amazing opportunity and a great place to be. Every day is different and you get to work in a supportive environment with great Corporate culture.", "pros": "", "cons": "", "date_created": "16 October 2015"},
{"id": "3dab1cd73acebaea", "rating": 4.0, "text": "Organize and supervise youth programs and events. \nDevelop, plan, facilitate, organize and implement programs. \nYouth development programs, preparing them for the future school/work etc.\nResponsible for creating a fun and safe environment that allows those enrolled in the programs to benefit the most.\nUse interpersonal and leadership skills to motivate, entertain, and challenge those within the programs.\nCollect and process demographic information from community members to determine which programs to offer.\nProgram assessment, research, development\nResponsible for ensuring the facility is well maintained and in a presentable condition.\nOversee facility and patrons.\nConstant interaction with facility staff and patrons.", "pros": "personally rewarding", "cons": "inconsistent hours available, part-time", "date_created": "15 October 2015"},
{"id": "43cb5f9006c7002e", "rating": 5.0, "text": "The workplace offered various opportunities for growth and envolvement. There were times when I felt challenge, but it helped me gains skills and grow within the field of work.", "pros": "", "cons": "", "date_created": "12 October 2015"},
{"id": "fb0b8e51fee011e6", "rating": 4.0, "text": "The culture was great and every one was amazing. Willing to help and excellent team work with a nice safety goal zero target in mind of all the employee beginning from the top management.", "pros": "", "cons": "", "date_created": "6 October 2015"},
{"id": "a4db669ebfc91030", "rating": 5.0, "text": "Work hours is from 6:30am to 2:30pm. The salary is very good. The work environment is very comfortable. I like work with my co-worker.", "pros": "", "cons": "", "date_created": "6 October 2015"},
{"id": "bbf910f93df88d58", "rating": 5.0, "text": "Recently started job with city of toronto. excellent employer, equal opportunity employer with excellent benefits and ongoing training", "pros": "comradery", "cons": "long shifts", "date_created": "5 October 2015"},
{"id": "5cc1b712182d4845", "rating": 5.0, "text": "My focused on the following:\nDeveloped and implemented growth strategies for acquired clients by thoroughly analyzing market dynamics and collaborating with key business decision makers and private/public sector organizations.\n   \nSupported the growth in the areas of ICT, R&D, Clean Tech, Food & Beverage, Development and Design.\nLeveraged global and domestic insights to facilitate successful client meetings, craft strategic business proposals and grow client acquisition rate by 15% vs. previous year.\nLiaised between the City, Regional economic development organizations, provincial & federal government to ensure the City’s approach to economic development was consistent with the development of these sectors and the overriding growth strategy.\nConducted business development in foreign markets which include: India, Germany, Italy, Israel and Latin\nAmerica.\nMaximized Invest Toronto’s corporate objectives by pro-actively engaging with client leads and providing leads with compelling and relevant reports to facilitate and expedite their decision making process.\nManaged and trained a team of five employees on pro-active sales, client follow up and relationship management tools.", "pros": "", "cons": "", "date_created": "2 October 2015"},
{"id": "a4ccf5875c08cf03", "rating": 4.0, "text": "This is a lovely work environment. The staff is friendly, attentive and approachable. \nFiling was a main priority with my position here and it was nice that everyone was on board to make the filing easier.", "pros": "", "cons": "", "date_created": "29 September 2015"},
{"id": "9af21f2e9084aecf", "rating": 5.0, "text": "you can be bumped out of your position if a senior employee wants it after their contract is up, cutting your contract short. They give little heads up.", "pros": "get paid to do nothing", "cons": "you do nothing all day", "date_created": "23 September 2015"},
{"id": "a8a1418ecf0c8f82", "rating": 5.0, "text": "assisted with events and loved every minute, the staff and culture throughout was an amazing experience and couldn't ask for better managers, directors and coworkers", "pros": "Supports Family Life and Work Life", "cons": "Far commute from Brampton", "date_created": "14 September 2015"},
{"id": "ef0f671e436f2f52", "rating": 5.0, "text": "Productive workplace serving Canada's largest city directly serving the residents and businesses.\nDemanding and detailed work in which the results were seen a year or two later.\nSupportive management and co-workers.\nTypical large government bureaucracy and politics but that is expected and the staff cared about their work.", "pros": "", "cons": "", "date_created": "14 September 2015"},
{"id": "4b056d7012ebddec", "rating": 5.0, "text": "Fun workplace with supportive management \nTeam oriented\nChallenging at times\nSwimming is best part\nMulticultural \nVery supportive\nvery easy going", "pros": "", "cons": "", "date_created": "14 September 2015"},
{"id": "8fcaf1212e569825", "rating": 4.0, "text": "Handled intense chaos with the help of colleagues in assisting citizens for the City of Toronto Elections. Ended the day successfully in a productive manner.", "pros": "", "cons": "", "date_created": "7 September 2015"},
{"id": "c0fd41ce02993941", "rating": 4.0, "text": "If you like variety and working with the public and kids... this is the job for you.  You set your own hours and participate in programs you want.  Kids are kids and can be unpredictable.  There aren't any medical or health benefits, but the joy you get from putting a smile on a child's face is irreplaceable.", "pros": "Set your own hours", "cons": "Low pay, no benefits", "date_created": "4 September 2015"},
{"id": "4224a67a5798fa09", "rating": 3.0, "text": "Working for the city of Toronto i have meet alot of the different people from different cultures. i have different ways of customer services", "pros": "", "cons": "", "date_created": "3 September 2015"},
{"id": "11b53d5b2e87a358", "rating": 5.0, "text": "Working with the City of Toronto is great! You are able to do something you love and can use that as a form of exercise. Sometimes it gets very cold but that's okay, simple solution is to go inside, make a quick tea and warm up.  Usually I would get there about 5-10 minutes earlier then I would put all my proper equipment on which includes; CSA approved helmet, skates, whistle, fanny pack full of first aid products and luminescent vest. At first I was nervous because I was young and not confident but then I gained confidence and learned that I was great with talking to people and great with helping them in anyway possible. Unfortunately, in the past year (almost 2) my managers have changed but they were both very nice people to work with. The co-workers are great because everyone is around the same age. Some new young workers come so I get to share my knowledge and experience with them and answer an questions they have and make sure they don't get as nervous as me when I first started.", "pros": "Get to do what you love and skating is a form of exercise!", "cons": "Sometimes gets too cold to stay outside for long hours", "date_created": "1 September 2015"},
{"id": "8288d3938040e78f", "rating": 5.0, "text": "Nice place to work at good people nice environment good working with others and helping young kids friendly people co-workers and enjoyed a lot", "pros": "Free Food", "cons": "Long Shift", "date_created": "31 August 2015"},
{"id": "28d8a619d38c9429", "rating": 5.0, "text": "So far the work life is awesome! I really feel proud to hold a position within the City Of Toronto, Parks and Rec. I look forward to the future with the city!", "pros": "", "cons": "", "date_created": "25 August 2015"},
{"id": "71b538877b5fab9b", "rating": 4.0, "text": "Great opportunity to learn about various computer programs and traffic hardware. The management was supportive and always willing to take time to help junior staff.", "pros": "Open door policy with management", "cons": "Fairly low salary", "date_created": "25 August 2015"},
{"id": "20807e753b23864d", "rating": 5.0, "text": "Great place to work. I get opportunities to learn about different areas of business. Enjoyed working with colleagues and learning from them.", "pros": "", "cons": "", "date_created": "25 August 2015"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "e8d631f7b24c7cca", "rating": 4.0, "text": "lovely staff, co-workers became family\nsolid hours, appropriate pay\ngreat environment, worth the commute\nalways loved coming into work", "pros": "", "cons": "", "date_created": "20 August 2015"},
{"id": "2feedaba02ac3899", "rating": 4.0, "text": "loved the environment . loved who i worked with it.\nwe just need to really priority in the right places. when we think of young people with disabilities we really need to be empowering them, and creating a curriculum that allows them to succeed", "pros": "", "cons": "", "date_created": "19 August 2015"},
{"id": "4f33c16ffdcec8c2", "rating": 5.0, "text": "Assisting seniors and persons with disabilities to continue living in their homes is priority.  My office offers federal/provincial funding for lower-income seniors and persons with disabilities who wish to make health and safety repairs to their homes.\nAnswer phone calls/emails/front desk inquiries.  Assess elgibility of requests from constituents for our program.  Process paperwork for funding approval and issuing of funding..\nMaintain data base on funding and provide reports to theCity of Toronto and  Ministry.\nI work with four Program Officers and assist them with the applications at different stages of the funding process.\nHardest part of my job is letting people know they are NOT eligible for our programs because of income, repair/modification item or their property value is too high.\nHelping a senior/person with disability live in their own homes independently.\n.", "pros": "Benefits", "cons": "too many hours", "date_created": "18 August 2015"},
{"id": "fef4038ff1180642", "rating": 3.0, "text": "I'm just a student working the summer.  The work / life balance is good because when I'm done for the day, I am done.  The hours are great because you are garunteed to work everyday Monday to Friday for the same time period.  Which was good because it left my weekends free and secered my income for the few months I was there.  Dealing with people all day helped me gain alot of communication skills which is super important for any job.", "pros": "1 hr lunch, 2 15 min breaks, free weekends", "cons": "A little repetative", "date_created": "13 August 2015"},
{"id": "37976602a10b75aa", "rating": 5.0, "text": "very stressful work load is too much and not enough staffing, making my resident happy each day is the best part of my day  management at some location does not respect psw or nurses co-workers can at times be very selfish especially if you are a new staff", "pros": "", "cons": "", "date_created": "10 August 2015"},
{"id": "16485a6a31003e16", "rating": 5.0, "text": "Everyone is so nice that I became familiar with my work in a real short time. We worked as a team and everyone did a great job in this collaborative unit.", "pros": "", "cons": "", "date_created": "25 July 2015"},
{"id": "4317f60daf4076d8", "rating": 4.0, "text": "A great place for students to finish their internship.\ncan learn a lot of useful knowledge as a office assistant, such as website design, arrange meeting and filing,etc.", "pros": "flexible working hours", "cons": "", "date_created": "24 July 2015"},
{"id": "c4049c773fbfd968", "rating": 5.0, "text": "engaged in many different projects and provided day-to-day services to project owners by being the point of contact for many different contractors and third party companies.", "pros": "", "cons": "", "date_created": "13 July 2015"},
{"id": "9b843a0578c77d2f", "rating": 3.0, "text": "Job duties were enjoyable.  I liked the adjusters I dealt with on a daily basis.  I enjoyed preparing various reports, and working with numbers to determine where and how most accidents and costs occurred.\nLocation was ideal for me as it was very close to the Beaches where I lived.", "pros": "Good work hours and location", "cons": "Management and several co workers were less than desirable", "date_created": "12 July 2015"},
{"id": "3ae2f8fc84c9e7ce", "rating": 3.0, "text": "The job was rewarding when there were cases that had good out comes. It could be stressful at times due to the high volume of emergencies.\nThe city provided good job security and great benefits.", "pros": "", "cons": "", "date_created": "6 July 2015"},
{"id": "1e33d399a92309af", "rating": 3.0, "text": "many customers,\npayments in large sums,\nbalancing at days end, \nsystems sometimes hard to maneuver\ncoworkers are helpful\nbank dedposits", "pros": "busy offices", "cons": "commute, hard to get a hold of other depts", "date_created": "1 July 2015"},
{"id": "1047ca7105785005", "rating": 4.0, "text": "Only one word to describe this place - AWESOME. Wish to join the city for a better opportunity. Typical day is between 9am to 3pm. All the employees are friendly. And since the office is located in downtown, the experience is even more amazing.", "pros": "Short Hours, Management team is friendly, one of the best employers to work with.", "cons": "Nothing much to learn. Only for networking and socializing.", "date_created": "15 June 2015"},
{"id": "87fbf202c9eb5462", "rating": 5.0, "text": "I cleaned.\nI prepared all types of meals.\nI organized and maintained and carry out sanitary condition.\nThe hardest part of my job was standing on my feet for long hours sometimes.", "pros": "nice enviorment", "cons": "long hours", "date_created": "15 June 2015"},
{"id": "f32af9214b7864af", "rating": 4.0, "text": "The City of Toronto is an organization that values the skills and knowledge of its workforce. The organizations offers a working environment that promotes diversity, personal development and organizational learning.", "pros": "", "cons": "", "date_created": "1 June 2015"},
{"id": "f34790b3535d79e5", "rating": 5.0, "text": "I am assisting transportation engineers to test transit signal priority (TSP) operations and programs in the lab.\nI go to field to implement of new transit signal operation at select intersections. \n I also prepare project management documents such as schedules, flow charts, project tracks (budgeting) and etc.. \nI am assisting in draft and upgrading signal drawing of the transportation projects in microstarion.\nI also organize the intersection inspection reports.", "pros": "", "cons": "", "date_created": "21 May 2015"},
{"id": "fd5b1794580a374c", "rating": 4.0, "text": "As senior integrator to help the conversion from other DBs to Oracle on UNIX: ETL tools and risk analysis, table relationships review/normalization, validation, verification, performance and tuning factors in cluster setting. Good, technologies interesting.", "pros": "", "cons": "", "date_created": "19 May 2015"},
{"id": "8f3f3da4115631a2", "rating": 4.0, "text": "A typical day would include: preparing snacks, play games, equipment management and supervising children.\nI learned how to be patient, and cook.\nMy co-works were fun, enthusiastic and creative.\nThe hardest part of the job is when you have to write and incidence \nreport. This meant that one of the children had gotten hurt. \nThe most enjoyable part of the job is when i get to engage with the children, and just being active.", "pros": "Free snacks and being active.", "cons": "Short hours", "date_created": "17 May 2015"},
{"id": "8808a4f05c4a0d05", "rating": 4.0, "text": "- fun place to work\n- learned a lot about teaching and instruction\n- trainings are valuable\n- lots of professional development offered\n- good job if you want to get into teaching", "pros": "easy job", "cons": "long hours", "date_created": "17 May 2015"},
{"id": "631897d48c1f606c", "rating": 4.0, "text": "Deal with customers phone calls, visits, and concerns about programs and general inquiries. Great place to meet new people and make friends. Co-workers are great!", "pros": "", "cons": "", "date_created": "14 May 2015"},
{"id": "0a07a410baeed2e5", "rating": 4.0, "text": "Maximizing value of the City's own real estate holdings through stewardship and developing divisional collaboration towards the timely execution of strategic objectives.", "pros": "", "cons": "", "date_created": "8 May 2015"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "9f46ccfbb1568ce0", "rating": 4.0, "text": "Working for the city can be pretty simple. People are just meant to follow their assigned tasks and complete them to the best of their abilities. Through working for the city, ive learnt quite a few skills such as organization, time management, team skills, communication skills and efficiency. The hardest part of the job was sometimes having to complete a greater amount of work on my own, when there was no team present. The most enjoyable part of the job is that it teaches individuals essential skills to function on their own and as a member of a team. It was truly some great experience learned.", "pros": "flexible hours, independent, experience working as a team player", "cons": "weather conditions, outdoor work, heavy loads", "date_created": "4 May 2015"},
{"id": "555f61084f2ff99c", "rating": 4.0, "text": "The Culture in every department varies with different personalities. What I learned was it was important to understand the culture in order to adapt and be productive. The most enjoyable part of my job is helping and educating the public about the facility and the skills to prevent injury, promoting safety and improving on their own swimming abilities.", "pros": "Friendly environment", "cons": "Variable scheduling", "date_created": "4 May 2015"},
{"id": "0b7b0fc0173c8946", "rating": 4.0, "text": "long, and usually with one or two other attendants. the bosses were strict but overall the environment was good and it was an easy job", "pros": "", "cons": "", "date_created": "25 April 2015"},
{"id": "87c404116a0e87e2", "rating": 5.0, "text": "I would talk to some of my co-workers and see how they were. Learn that we need to work together as a team to get the job done neatly and efficiently. The boss or in-charge was always polite, yet affirmative to get any job done affectively. The hardest part of the job was watching the pool and observing people swim, which is usually just really boring, and difficult to stay focused on after a while. That's why the best part was the break that we were able to get sometimes in-between watching the pool.", "pros": "Easy to work with co-workers", "cons": "Long Boring Hours of doing nothing.", "date_created": "24 April 2015"},
{"id": "abef8ecfe685532a", "rating": 4.0, "text": "There are many opportunities for growth. The clients make the job an important and surreal one.  The most challenging part of the position is not being able to contribute to clients lives a little bit more than you might like.", "pros": "", "cons": "", "date_created": "23 April 2015"},
{"id": "3b9898062f4dc5e1", "rating": 5.0, "text": "I enjoyed teaching children/youths how to swim and to become a proper leader. I was a person in which not only children but even parents who looked up to, it was a great experience.", "pros": "leadership", "cons": "money", "date_created": "20 April 2015"},
{"id": "5c509474c52f109f", "rating": 5.0, "text": "As a skating Marshal a typical day at work was to get there on time before patrons show up to set up the rink with signs and pylon's. When its time to clean the rink you have to make sure all patrons evacuate the ice. Supervisors are quite friendly and treat all workers equal. The hardest part of the job would have to be clearing kids of the ice.", "pros": "Easy shifts", "cons": "short hours", "date_created": "16 April 2015"},
{"id": "2cc4a839a494d3cf", "rating": 5.0, "text": "Client focus\nLeaned to be a confident and patient trainer\nmanagement was patient and helpful durning my learning process\nco-workers worked as a team \nthe hardest part of the job was keeping up with the filing as we filed for 150 clients per 10 to 12 caseworkers\nthe most enjoyable part of the job was dealing with the client on a one on one bases and being able to come to a resalution that would help them.", "pros": "abundent vacation time", "cons": "stressfull moments", "date_created": "14 April 2015"},
{"id": "d6b08bc3218dfb6a", "rating": 5.0, "text": "it's pretty good to be there and enjoy the workers and the atmosphere. everybody makes you feel welcome and they're fairr and very helpful. very enjoyable.", "pros": "", "cons": "", "date_created": "29 March 2015"},
{"id": "ff1c9bb9436062a9", "rating": 5.0, "text": "The city pays very well and the work is manageable and enjoyable, but there is a lot of in office politics. These politics often revolve around seniority, and seniority will prevent qualified people from moving up accordingly.", "pros": "", "cons": "", "date_created": "27 March 2015"},
{"id": "90b85925a2abbac2", "rating": 3.0, "text": "It is a great relaxed environment but very difficult to move around. You're stuck pretty much in your role. Not a young or vibrant place to work in some Divisions (Finance, Accounting). Other areas are fun (Planning, Transportation).", "pros": "Great benefits, security", "cons": "Can be stifling for ambitious individuals in certain Divisions", "date_created": "27 March 2015"},
{"id": "e6c9381d8970c133", "rating": 5.0, "text": "-make 400-500 calls a day\n-complete customer satisfaction surveys\n-best and worst part was sitting down all day\n-very strict breaks can't be even one minute late", "pros": "", "cons": "", "date_created": "16 March 2015"},
{"id": "316abc8c3fe8d06c", "rating": 5.0, "text": "I have learned how to trust each others, how to build a good relationship with co-workers, and treat everyone the same way you would like to be treated. My co-workers were fun  they always have positive things to say and they were help full. The hardest pert of the job was working in the hot sun and plating vegetable. I enjoy learning the different types of plants and how to make a plant grow.", "pros": "free lunch and two fifteen mins break", "cons": "only could work five days of the week", "date_created": "9 March 2015"},
{"id": "001d4ea46ccc7ee8", "rating": 5.0, "text": "Great experience with public relations and lovely co-workers. The hardest part of the job was dealing with stressful situations, including health emergencies. The most enjoyable part was watching the progression of swim students and seeing their feelings of accomplishment. The management did a good job, and the City of Toronto does a great job in evaluating their employees and furthering their learning experience.", "pros": "Acquired many important skills including interpersonal skills and experience with public relations.", "cons": "Cold mornings in the pool if you don't have a wet suit (pool was outdoors), and the occasional sunburn.", "date_created": "8 March 2015"},
{"id": "77afb6018ee0d278", "rating": 4.0, "text": "Always had great co-workers, mostly teens and young adults, which makes for a good atmosphere. Typical day lasts 10am-5pm, so the hours are good. The most enjoyable part of the job is the people you meet, whether they be co workers or patrons.", "pros": "", "cons": "", "date_created": "8 March 2015"},
{"id": "12c3983fcc6b6b45", "rating": 5.0, "text": "It is a very fulfilling job and I love meeting new clients. A typical day consists of approximately three clients. I set up the Snoezelen Room and allow the clients to play with their guardians supervision.", "pros": "", "cons": "", "date_created": "5 March 2015"},
{"id": "68b7653a4686b13d", "rating": 5.0, "text": "my typical day at work stars with planning what I'm going to teach, lesson plain. I start work at 8:45 but class don't start until 9:00 so that well give me time to change and fix things that need to be fixed. I teach at less 5 or more class a day and than I have guarding. I always have new things I have to teach but I also have to practice and go over the lesson I taught last week and evaluate. at the end of my class I give chuck marks for those who completed the skill and if they have 3 chuck  marks that mean they have completed that skill and we can move on to something else. Around week 7 we have report cards and by week 8 we have to have them done  and show it to out in charges, and hang them out for week 9.", "pros": "", "cons": "", "date_created": "4 March 2015"},
{"id": "410f52b087fd9b9d", "rating": 4.0, "text": "This was an enjoyable, supportive place to work.  I particularly learned a lot from being around so many diverse children.", "pros": "Excellent for students who want to work as shifts are very flexible", "cons": "Very difficult to work full-time unless you are willing to do several jobs", "date_created": "3 March 2015"},
{"id": "c6126761e0201c69", "rating": 5.0, "text": "City City of Toronto is a great employer.  It was a collegial working atmosphere and I enjoyed my work immensely.\nThe hardest part of the job is learning and factoring-in the Municipal process of staff reports to Committees and City Council.  However, once you master that, the salary, benefits and overall workplace atmosphere makes it all worthwhile.  It's a great feeling to actively contribute to your own community.", "pros": "Great compensation and benefits.", "cons": "Little or no perks at all.", "date_created": "3 March 2015"},
{"id": "e07ed2f4ea046131", "rating": 5.0, "text": "A good environment to be working in. Lots of happy faces but must be taken seriously as it is a serious job. Lots of responsibility and training is required.", "pros": "", "cons": "", "date_created": "22 February 2015"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "271446f98724611b", "rating": 4.0, "text": "Fast paced environment, provided customer service and information to voters, checked identification and issue the appropriate ballots. This type of experience gives you an opportunity to excel your skills as productivity, customer service and effectiveness in determined period of time.", "pros": "Good experience", "cons": "none", "date_created": "18 February 2015"},
{"id": "1fe917a9f2645a85", "rating": 4.0, "text": "enjoyed working outdoors and being of assistance to people.\nI enjoyed working with a team and ensuring the safety of the public.", "pros": "working outdoors in summer", "cons": "bad weather, no public in attendance", "date_created": "11 February 2015"},
{"id": "0e2ab9307b37aba7", "rating": 5.0, "text": "- supportive, kind and agreeable co-workers\n- professional but pleasant, not intimidating ambiance", "pros": "", "cons": "", "date_created": "29 January 2015"},
{"id": "a8d441ede858676f", "rating": 5.0, "text": "I work part-time and I appreciate the support from Management to ensure that TKD is encouraged.\nI have always had full classes - keeping it challenging\nOverall, I found unrealistic expectation of instructors and a club environment is much more conducive to learning.", "pros": "Reasonable hours and Fun. Hourly wage is available to the public", "cons": "Tiring", "date_created": "27 January 2015"},
{"id": "6eadba81f481ac79", "rating": 5.0, "text": "This was my preceptorship in my last clinical of nursing.  I learned a great deal about long term care and client centered care.  Working under a great preceptor, she taught me what is was llike to be part of the healthcare team, as well as being a leader to the staff by providing direction.  Everyone did work as a team , that is why the practice of client centered care was very much their main focus at TDA.  Hardest part of the job was mainly the fact that I was only a student and I had my limits with my scope of practice.  The most enjoyable part of the job was knowing how rewarding this profession is based on the care provided and the appreciation from residents.", "pros": "", "cons": "", "date_created": "26 January 2015"},
{"id": "dae72f7e4021e73a", "rating": 5.0, "text": "the most enjoyable part of the job was driving around the city of Toronto, and working with a great group!. answering emergency and non emergency calls to resolve issues for citizens and seeing their happy satisfied smiles was very rewarding.", "pros": "flexible work conditions", "cons": "midnight shift", "date_created": "21 January 2015"},
{"id": "d8d1990b67845101", "rating": 5.0, "text": "I really loved to work there\nmanagement is great\nteam is very nice", "pros": "", "cons": "", "date_created": "14 January 2015"},
{"id": "6818647bf88aa55f", "rating": 5.0, "text": "One of the best places I've worked. The pay was very good and I worked with amazing people.", "pros": "Everything", "cons": "Nothing", "date_created": "13 January 2015"},
{"id": "6564ae404d3c0803", "rating": 5.0, "text": "It was a day that every citizen in Toronto needed to voted on which mayor they chose. I, on the other hand had various duties. There was many multicultural people that did not understand what the MDRO was explaining to them. Therefore, I spoke French and Italian to them to explain what they have to do . The MDRO appreciated my well communication skills and it was helpful that I know three languages. I also helped the hard of hearing people, I learned how to do sign language because I took an after school club learning the alphabet in sign language and on that day it absolutely helped me through the say. When it got very bus around 6pm I held the door open for the people to come in and explained to them to be prepared when they need to vote. When it was closing time I helped clean up kept everything organized I helped count the votes brought down the signs, and locked the doors so nobody came in. There were some people that were complaining but I kept them calm and helped them out and they thanked me at the end when they finished voting.", "pros": "Greeting people and helping out", "cons": "No free lunch or free time was always busy.", "date_created": "28 December 2014"},
{"id": "1d3a3e04ac4b1565", "rating": 4.0, "text": "I love human resources and, in particular, labour relations.  Therefore, the City was a great place to rise to never ending challenges.  This was especially true during amalgamation.  \nThe work atmosphere changes quite often as senior management often have conflicting human resources philosophies from their predecessors and that sometimes required a 180 degree change in thinking on the part of managers. \nThe hardest part of the job was the enormous amounts of time that I was away from my family.  Sometimes living in downtown hotels for months at a time. \nThe most enjoyable part of the job was knowing that we were helping and making a difference for the residents of Toronto, management and operations as well as making the City as good a work place for line staff as possible.", "pros": "Generous benefit package and pension plan", "cons": "Long hours", "date_created": "18 December 2014"},
{"id": "0eee688e1ab6dfc0", "rating": 2.0, "text": "I work split shift and I am in the room with the Registered Early Childcare Educator, assisting with daily duties such as diaper changing, feeding, ect. I learned to be very patient when dealing with staff, parents, and children. I understood the value of maintaining personal and private information of parents and children. The staff at most sites have been great to work with and have taught me a lot. Some, life lessons, and others, on-the-job skills. The hardest part of the job would be to prioritize the workload. There is so much to get done in any given day that you have to delegate what is top priority and working down to what can be saved for last. The most enjoyable part of the job is to be able to have a great report with staff and bonding with the children.", "pros": "Staff parties", "cons": "split shifts and moody personalities", "date_created": "15 December 2014"},
{"id": "0830dc53d11e8706", "rating": 1.0, "text": "Absolutely most stressful job on the earth. Low pay and bad management result in a stressful work environment.\nGood co-workers, they're all dieing with you at work so it's a team thing.", "pros": "Free Lunches if you're slick.", "cons": "", "date_created": "25 November 2014"},
{"id": "5ded17c4ecc2defa", "rating": 5.0, "text": "great work environment election work. lifting, assembly work.", "pros": "", "cons": "", "date_created": "18 November 2014"},
{"id": "f669b67424fb17dd", "rating": 5.0, "text": "Working with the City of Toronto Parks, Forestry & Recreation has allowed me to continue my passion for dance by teaching other students. I was able to work with children and help build their abilities, confidence and character every class. I balanced 11 ballet and jazz classes with children ages 3-12 each week. There was nothing more rewarding than watching my students perform during their annual recital and hearing all the positive feedback from their parents. This job taught me valuable skills in program management, organization, customer relations and communication.", "pros": "", "cons": "", "date_created": "11 November 2014"},
{"id": "cef31251fccaf916", "rating": 4.0, "text": "Easy job, free movies. Very sad the company went under. You got to work both on your own and with other people. You can do your own thing as long as it's appropriate and your work gets done. I miss this job.", "pros": "", "cons": "", "date_created": "10 November 2014"},
{"id": "6d5ab059943712ce", "rating": 4.0, "text": "I really enjoy working with the public and The City of Toronto offers several front line jobs positions that allow this. There is a great mix of repeat clients and new all of whom require assistance that I was happy to give. Other than the drama that you could experience with coworkers and managers in any career or job, this job allows you to meet friendly people and help people. I have saved lives and impacted adults, children, and families in a positive and lasting way. I have been involved in my community.", "pros": "", "cons": "", "date_created": "10 November 2014"},
{"id": "3610b87bf17c31a3", "rating": 4.0, "text": "The City is a great place to begin and the people are really friendly for the most part. It is a great part time gig for students in school full time.", "pros": "", "cons": "", "date_created": "19 October 2014"},
{"id": "2c02e4a74a52155d", "rating": 4.0, "text": "Changes and advancement take time to be seen. Large mega City with many departments.", "pros": "", "cons": "", "date_created": "30 September 2014"},
{"id": "5ef6c7a6621b3c98", "rating": 4.0, "text": "This place really stands out, all of the youth who go here are really happy to have somewhere to go. It was great playing all different types if games and sport activities every week with them.", "pros": "", "cons": "", "date_created": "29 September 2014"},
{"id": "42c959d874208010", "rating": 4.0, "text": "If you love law enforcement without guns, this is the job for you.", "pros": "Excellent pay and benifits", "cons": "deal with angry public while serving tickets", "date_created": "26 September 2014"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "de9b89f28aecaa56", "rating": 5.0, "text": "A typical day at work was rather simple while working as a rink guard. I would come into work make sure the workplace was clean and respectable. Than, I would put on my safety equipment  and get on the ice. Once I was on the ice I would do my rounds ensuring that everyone had the proper equipment on and that they were following city of Toronto mandated instructions. During this job I learned several things, I learned the importance of creative problem solving (while dealing with disgruntled customers ), as well as the importance of being energetic and warm in an effort to promote a safe environment for patrons. One of the best part of the jobs were my co-workers, I got along with every single one of my co-workers including any management I worked with. I was specifically pleased with the management as I had heard so many horror stories and was expecting the worse but in reality I got a very reasonable staff of managers. The hardest part of the job was dealing with patrons who were not happy, some times I felt as if customers had valid arguments but, according to the city of Toronto they were wrong. Thus, I had to side with the City as that was my job and that's what I signed up for. The most enjoyable part of my job was constantly being outside and interacting with the lovely people of my community.", "pros": "Good Coworkers, Good Management, Good benefits.", "cons": "Dealing with disgruntled employees.", "date_created": "22 September 2014"},
{"id": "0e49719ae8191283", "rating": 2.0, "text": "Good place to work, very enthusiastic co-workers, learned a lot working at this place.\nA place to give respect, dignity and care to residents.\nManagement gives no respect to its employees, treats them as garbage, no open door policy, a sense of racism still exists.", "pros": "Good co-workers", "cons": "Inefficient and lack lustre management", "date_created": "20 September 2014"},
{"id": "a09895e7bb6dfd5d", "rating": 4.0, "text": "Working for the city of toronto has been a privillage. The amount of work experience you gain alongside interpersonal and communication skills goes a long way when searching for other means of employment.", "pros": "", "cons": "", "date_created": "19 September 2014"},
{"id": "fed2807fd58bfb25", "rating": 5.0, "text": "Time management is one key aspect of work that I have learned. On a daily basis, strict schedules are followed and it is important to follow these schedules especially when working with vulnerable populations. My coworkers are great team members and everyone has the same mind state when it comes to teamwork. Teamwork is not only working for the team but also with parents and children. The hardest part of this job I would say is feeling as though the needs are not being met for children and when this happens, all opportunities are taken to fulfill this need. The most enjoyable part of this job is being able to interact with various personalities and people from different walks of life. This job allows for me to learn about diverse backgrounds in a non-judgmental and professional manner.", "pros": "Working and playing with children on a daily basis.", "cons": "Feeling as though needs of clients are not being met.", "date_created": "19 September 2014"},
{"id": "f5448338cb541ae1", "rating": 5.0, "text": "All workers help one another to meet deadlines. It is a female dominant workplace and everyone gets along quite well. The most enjoyable part of the job is being able to help out families who are in dire need of daycare. The hardest part is having to withdraw children from subsidized daycare - which can happen for several reasons.", "pros": "", "cons": "", "date_created": "19 September 2014"},
{"id": "f2054d905c84c294", "rating": 5.0, "text": "Young, vibrant, flexible environment. Best part-time or summer job you can have.", "pros": "Decent pay, flexible hours", "cons": "Min. 5 mandatory trainings per year to work", "date_created": "18 September 2014"},
{"id": "832cf7d902770108", "rating": 5.0, "text": "It is something that will provide you with insight into the inner workings of all that is involved in municipal politics.", "pros": "", "cons": "", "date_created": "12 September 2014"},
{"id": "f6ab4ba8a6939e65", "rating": 5.0, "text": "Very good employer, slow moving due to many regulations.\nbudget planning and finance processes", "pros": "", "cons": "", "date_created": "12 September 2014"},
{"id": "30568815eeb58163", "rating": 3.0, "text": "Great organization, great pay and benefits, but the work environment is not very flexible", "pros": "", "cons": "", "date_created": "8 September 2014"},
{"id": "782a9b89f5b2a991", "rating": 3.0, "text": "Cleaning and maintaining the building. Learned a lot about electrical and refrigeration. Most enjoyable part of the job was the extra ice time to skate.", "pros": "Great people", "cons": "Not enough hours", "date_created": "1 September 2014"},
{"id": "2de99829ffdcb1d8", "rating": 3.0, "text": "It is knot easy to get a job in the government they wont let you in it could be some one dream but the other party wont under stand .\nI am a cleaner but I would like them to give me a try to work in a office .I dont think that would happen if it does I would be suprised", "pros": "Office work", "cons": "", "date_created": "30 August 2014"},
{"id": "df425cc331ae396f", "rating": 5.0, "text": "The job required me to use my own judgement in many cases as I was not always supervised. However, there was always someone available to assist me if needed. I was able to work on my own pace as long as I met deadlines. The job consisted of answering phone  and email inquiries. Attention to details was very important to all aspect of the job. \nThe most difficult part of the job was making sure that all calls, regarding discrepencies with City of Toronto buildings, were accurately recorded and dealt with on the same day.", "pros": "Good pay and benefit", "cons": "Contract work", "date_created": "25 August 2014"},
{"id": "361813cda7c9c58e", "rating": 2.0, "text": "working at this company I find very rewarding  work hard with long hours management could be better needs improvement I do think we should be paid more  each day I learn new things and there is the reward when the residents are happy sometimes co workers can be a challenge  when the day is over I look around  I would say thanks for job well done", "pros": "", "cons": "", "date_created": "19 August 2014"},
{"id": "d31b85b64893d771", "rating": 3.0, "text": "There are two tiers of workers in the City of Toronto. Unionized and non-Unionized, it is to strike a balance while working in this organization that posesses the largest challenge. The management staff are very knowledgeable in the process but also play by the rules set out.", "pros": "large organization with a lot of opportunities", "cons": "a lot of red tape that hinders the agile nature of projects", "date_created": "18 August 2014"},
{"id": "7e09b7e2661e9740", "rating": 4.0, "text": "Though the office at our pool is small, the staff I worked with is amazing.  We all get along very well and see each other outside of work.  The best part of the job is when children and youth will ask us about how to become lifeguard.  It is rewarding to know that the children swimming in the pool look up to the lifeguards as inspiration.", "pros": "", "cons": "", "date_created": "13 August 2014"},
{"id": "da4c9322a89b82d3", "rating": 5.0, "text": "- SAP experience\n- MS Excel practice\n- Wonderful employees\n- at times can be very busy", "pros": "", "cons": "", "date_created": "12 August 2014"},
{"id": "19a970f51ef40e33", "rating": 4.0, "text": "Great place to work however unionized environment makes it difficult to be promoted and move up.", "pros": "Great Benefits", "cons": "Difficult for Promotion", "date_created": "11 August 2014"},
{"id": "663ad58ad938ae69", "rating": 5.0, "text": "It is an amazing place to work with great people and management", "pros": "", "cons": "", "date_created": "7 August 2014"},
{"id": "1248af08ab4f883b", "rating": 5.0, "text": "I am proud to be a public worker and appreciate my position. I perform my job to the best of my abilites, while maintaining a safety first approach.", "pros": "", "cons": "", "date_created": "24 July 2014"},
{"id": "972000a18a4aa47e", "rating": 5.0, "text": "I'm thankful for the opportunity to use my organizational, research, creative and communication skills in this position to serve both internal and external clients over the years. Plus, the salary and benfits are both fantastic and generous.", "pros": "Ability to use different skills in my work. Salary and benefits are great, too.", "cons": "Sometimes advancement requirements are too strict", "date_created": "24 July 2014"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "45f29f84e1d9c233", "rating": 4.0, "text": "i work for the city of toronto and its a very fun and rewarding job.", "pros": "relaxed", "cons": "long hours", "date_created": "3 July 2014"},
{"id": "f312e2e6050fbcfb", "rating": 4.0, "text": "In the morning I would start off by having classes teaching kids/adults how to swim. In the afternoon I would lifeguard and watch the pool so that the patrons don't have any accidents or injuries. The hardest part of the job was teaching it took allot of effort into teaching kids because you always have to keep their attention and their focus. The most enjoyable part of the job was to teach the adults because they were fun to work with and teach how to swim.", "pros": "", "cons": "", "date_created": "26 June 2014"},
{"id": "52a41451bc8f614a", "rating": 5.0, "text": "After a review two years ago it is good to see that the City of Toronto Fleet Department has finally hired a high caliber Division Head who is the top in his field.  As the largest City in Canada and with the new strong leadership in Fleet it is surely to become \"the place to work\" in the city of Toronto.  \nIf you want a career in fleet management or if you want to gain excellent experience in a variety of areas you will work hard and you will see changes but it will not be a wasted opportunity. \nThe best part of the job is the benefits and the people", "pros": "New leadership", "cons": "past practices", "date_created": "13 June 2014"},
{"id": "24ac4c352835eeac", "rating": 4.0, "text": "-Excellent work environment\n-Learned a lot from the job experience\n-Always busy and constantly changing \n-Received a promotion and a pay raise each year \n-Very demanding \n-Very easy to get along with co-workers and management \n-Not enough hours", "pros": "", "cons": "", "date_created": "30 May 2014"},
{"id": "da96ff47c52b5bad", "rating": 5.0, "text": "Enter constituents contact information in databases. Organize files and folders in office storage. Deliver pamphlets to local service organizations.", "pros": "less work", "cons": "very quite environment", "date_created": "6 May 2014"},
{"id": "7c5f618e1301c5bf", "rating": 5.0, "text": "It was a very beautiful work setting at the park near the lake was rewarding for me because I enjoyed it. I learned about preserving plant and tree life and about several species found in the park. Management is very well organized and it's a great co-operative team to work with. To notice worms but, uexpectedly. Pulling the weeds because I knew I was helping to preserve wanted natural habitat. Planting plants was awesome and alot of fun!", "pros": "knowing I was helping out to preserve a healthy environment for the City.", "cons": "The distance from home.", "date_created": "1 May 2014"},
{"id": "d260a04ea0bbccb9", "rating": 4.0, "text": "*Dealing with the public\n*Helping people in need\n*Giving a fun and safe environment", "pros": "", "cons": "", "date_created": "29 April 2014"},
{"id": "98d6c10bd6ff35cc", "rating": 5.0, "text": "Under the direction of qualified staff, assists in the supervision of infants, children, and youth\nSupervise and participate in play with children of all ages during outdoor activities such as swimming, baseball, hockey, etc\nAssists in the set up of creative materials for indoor activity. Supervises children participating in games, arts and crafts and music\nUnder the direction of qualified staff engages children in age appropriate activities to build literacy, resiliency, social skills and communication\nAssists children in routine procedures such as eating lunch and snacks, putting on winter clothing, etc\nAssists on field trip excursions, which may include the use of public transportation\nPerforms emergency or unplanned supervised duties which must be considered within the job function\nAssists in checking of toys and equipment used in activities to ensure safe functioning\nAssists in documenting attendance of children, completing forms, reports, and communication logs as necessary\nProvides input in activities planned and assists with promoting participation\nAssists with safety and well being of children by adhering to Occupational Health and Safety Act, Day Nurseries Act, Child and Family Services Act\nAssist children in integrating into the hostel environment\nAttend staff meetings as required", "pros": "", "cons": "", "date_created": "30 March 2014"},
{"id": "afb254364dbefd55", "rating": 5.0, "text": "Working for the City of Toronto was always a positive working experience.", "pros": "", "cons": "", "date_created": "24 March 2014"},
{"id": "214940736b341689", "rating": 5.0, "text": "- Management is rather lax\n- Occasionally, extra work is given as Supervisors do not complete all their assigned work\n- Unless you are F/T, employment is scattered based on program peak seasons \n- P/T staff mainly work evenings\n- Relaxed environment", "pros": "", "cons": "", "date_created": "20 March 2014"},
{"id": "1b97b7309130d522", "rating": 5.0, "text": "Everyone was very professional and very courteous. The management and staff their were all very helpful and friendly, which made for a great work environment. This job showed me the inner working of the court system within Toronto.", "pros": "", "cons": "", "date_created": "19 March 2014"},
{"id": "13450d264712f0d5", "rating": 4.0, "text": "Unfortunately Rob Ford made cutbacks within the city.  I was one of them.", "pros": "Management, Team, work", "cons": "union", "date_created": "13 March 2014"},
{"id": "0f1b10fd79f1fa6e", "rating": 3.0, "text": "Benefits and training are great but you are working for government so there are often changes in policies as governments change their policies,", "pros": "", "cons": "", "date_created": "26 February 2014"},
{"id": "45e8f838df066c1f", "rating": 4.0, "text": "Exciting work, lots of opportunities to make a difference.", "pros": "Excellent people", "cons": "Long, long hours", "date_created": "23 February 2014"},
{"id": "c6dfe69315ab102e", "rating": 4.0, "text": "Responsible for  west work area - half of the water distribution for the City of Toronto. Managing mechanical and electrical staff coordinating daily work orders.\nContracting services to maintain facilities. \nWorking for the city gave me the opportunity to coordinate activities and processes, understanding water regulations and technologies.\nOpportunity to work in private sector a well as the public sector.", "pros": "Managed work area with various levels and technical staff.", "cons": "Change is slow compared to private sector.", "date_created": "19 February 2014"},
{"id": "ecc945897aec60d2", "rating": 3.0, "text": "I still work full-time at Toronto Solid waste Management. It Wed to Saturday night shift. I want to apply for part-time job. I am father and want to give more support to my little boy plus I'm step-father with 2 step child's.", "pros": "Bring my own lunch", "cons": "10 hour per day", "date_created": "18 February 2014"},
{"id": "92dce5c670a7d2fb", "rating": 4.0, "text": "I ran programs for parents and young children. The parents were involved so I had the opportunity to connect with them and give them support and pass on valuable parent/child resources.", "pros": "Close to home. Enjoyable, fulfilling work.", "cons": "too few hours", "date_created": "13 February 2014"},
{"id": "055c5ce68679d827", "rating": 4.0, "text": "Typical day at work consists of hard work and fun, Co-workers are hard working people who are also friendly and laid back. Hardest part of the job is meeting deadlines and matching work ethics to deadlines on the job. Most enjoyable part of the job is socializing with other colleagues when appropriate and knowing when to have fun in general.", "pros": "Being able to work in a comfortable environment with funny, laid back, and hard working people.", "cons": "minimum wage", "date_created": "11 February 2014"},
{"id": "e98eb818522fe76c", "rating": 4.0, "text": "I check my truck  and do my circle check, after that I start on my map, we switch with my partner at least half an hour each time, our supervisor is good he trust we can finish the map so he doesnt bother us. The hard part is when sometimes furniture is wet and is really heavy so both of us have to lift at the same time and sometimes that takes alot of time from work. The most enjoyable part of my job is not only do I only work 4 days but if you push yourself in the day, you finish quicker and that means get home sooner.", "pros": "4 days a week I work", "cons": "longs hours sometimes", "date_created": "4 February 2014"},
{"id": "e1754af43783f004", "rating": 3.0, "text": "it would start with a circle check of truck , arguing with supervisors in regards to what area to work in , help others in there areas when I was finished my area ,", "pros": "good wages for the job", "cons": "long days at various times", "date_created": "3 February 2014"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "536ac2cef488f160", "rating": 4.0, "text": "Every day was different and interesting. Working under the Rob Ford administration provided many insights into the whole process of municipal priority and budget setting.  The City has a very rigorous budget process and managed to reduce most departmental budgets by 10%.", "pros": "", "cons": "", "date_created": "26 January 2014"},
{"id": "538243023b674b42", "rating": 5.0, "text": "-Provided information about community services and resources available for youth\n-Developed and implemented a variety of recreational programs and camps for youth e.g. basketball, soccer, and floor hockey\n-Supervised and positively interacted with children\n-Oversee the homework program and provide individual tutoring\n-Prepared complete and accurate daily records and report", "pros": "Always fun", "cons": "", "date_created": "23 January 2014"},
{"id": "92d912069755cdc2", "rating": 2.0, "text": "program itself is good, could be great if management knew how to promote, do needs assessments, extend the program length, treat all their employers with respect and give positive feedback to everyone instead of making employees feel like they have nothing else going for them \nmy summer camp supervisors are great, and program runs better with longer hours and proper supervision, and everyone is on the same page and supervisors are respectful", "pros": "we have a union", "cons": "hours got to be longer", "date_created": "19 January 2014"},
{"id": "bc21715871005db8", "rating": 5.0, "text": "Great Staff and really enjoyed my time here. \nPerfect Type of employment to balance with school.", "pros": "Great People", "cons": "None", "date_created": "18 January 2014"},
{"id": "06dbe0ca4b3187b7", "rating": 4.0, "text": "Good workplace for ongoing development of horticultural skills.", "pros": "", "cons": "", "date_created": "15 January 2014"},
{"id": "8d00e5d872d6d812", "rating": 3.0, "text": "A typical day at work as a wading pool attendant was fun but extremely tiring. I had to be up before everyone to make sure that the pool was open for the kids for them to swim. The summer I did work for the city of Toronto, it was extremely hot. But the children made it all worth it, we played games in the water such as basketball, tag, marco polo. The parents really appreciated the fact that I showed interest in playing with their children and making sure that they had themselves a good time. Working for the city of Toronto, i learned how to open pools, I also learned a lot of rules about the pool that I never knew before. My Co-workers and supervisor were really nice, we used to plan games together and then ask the kids which games they wanted to play. The hardest part about the job was being out in the sun everyday with no shade for more than 5 hours. The most enjoyable part about the job was just being able to put a smile on some of these kids' faces, especially the kids that were the only children in their families that only came with their parents. We definitely made sure they had fun.", "pros": "", "cons": "", "date_created": "13 January 2014"},
{"id": "518b5587bdcbed21", "rating": 5.0, "text": "Everyone was so kind at the Municipal Licensing and Standards Division while I was with them.", "pros": "Great People to work with", "cons": "Wished the job was full-time", "date_created": "7 January 2014"},
{"id": "18b4568e3ee2b9c5", "rating": 4.0, "text": "Nice working environment. Learn new things every other day. Typical local government style management. Unions", "pros": "Stabilitym Benefits", "cons": "Slow Growth", "date_created": "24 December 2013"},
{"id": "804ab53fc604941d", "rating": 5.0, "text": "I really enjoyed my time working for the City of Toronto. I worked with some really good people who always motivated me.", "pros": "Working with great people, working with children, implementing health and wellness activities the way I would like to", "cons": "A lot of trainings and meetings.", "date_created": "18 December 2013"},
{"id": "c0d711528f6e1924", "rating": 5.0, "text": "Through my years of working at the City of Toronto I would say it was a great experience.  You learn a lot quickly and it is very cultured.  I didn't stick to one 'title' but was moved around a lot and macro-managed a lot of different projects, which I loved.  The environment was great and so were the hours.", "pros": "great hours; culture", "cons": "seniority based", "date_created": "30 November 2013"},
{"id": "403d96add05a804c", "rating": 5.0, "text": "I was able to not only better the lives of patrons through teaching them a life saving skill, but my position allowed me to better their life emotionally as well, even if only for the time they spent with me. The compliments and reviews I received made me know that I was leaving a lasting and positive effect on all patrons I came in contact with.", "pros": "Job Security", "cons": "People can take advantage of the Job security.", "date_created": "25 November 2013"},
{"id": "f4f433992a5529d0", "rating": 4.0, "text": "A typical day at work is assessing residents with responsive behaviour. I have to model and suggest techniques for staff members. I do overviews and documentations for each client. I've learned and implented a variety of methods on how to handle clients with different types of behaviours. I work hand in hand with my management team. The most enjoyable part of my job is being able to enhance the quality of life for my clients.", "pros": "", "cons": "", "date_created": "8 November 2013"},
{"id": "e13e15db81079fff", "rating": 4.0, "text": "Help small business owners distinguish different business structures and research information for them as requested\nHelp set up booth and be there to provide answers in trade shows\nThis job helps one to develop communication and client service skills, it also requires leadership skills because one has to make the call when helping clients\nThe co-workers are friendly and willing to help\nThe most enjoyable part of the job is to help client develop their career", "pros": "", "cons": "", "date_created": "7 November 2013"},
{"id": "4152b310c0542ba9", "rating": 5.0, "text": "Providing access to information and Citizenship for residents of the City of Toronto. Very interesting work doing research, advocacy for the public.  Enjoyed both  written and individual communication with both the public and elected officials.", "pros": "N/a", "cons": "N/a", "date_created": "20 October 2013"},
{"id": "5c6bdc4fe84856d6", "rating": 5.0, "text": "After working there for 9 years I have encountered good staff and excellent managers. Working for the City of Toronto is something I would recommend to anyone.", "pros": "Job security", "cons": "Lack of promotional opportunity", "date_created": "6 October 2013"},
{"id": "6e49333b0016bc85", "rating": 5.0, "text": "Loved working with the City of Toronto, extremely inclusive and helpful to all of its staff.", "pros": "", "cons": "Long hours", "date_created": "23 September 2013"},
{"id": "4aaf7cbc27a7664d", "rating": 3.0, "text": "I am responsible for researching, writing, analyzing and editing documents issued by the Mayor, Members of Council and Divisions. \nI produce politically and culturally sensitive documents of a diverse nature with clarity and precision while maintaining several databases and reports daily. This position has allowed me to utilize my written, analytical, communicative and interpersonal skills to the highest degree while working in a highly confidential setting", "pros": "", "cons": "", "date_created": "23 September 2013"},
{"id": "752d4663ae1e96b4", "rating": 5.0, "text": "Love to be extremely Busy , and I enjoy the people I work with and my team is very passionate and hard working and makes my day go faster and easy , even though its high stress job with lot of risk factors and dealing with lot of people with minds and thoughts , but just staying calm and focussed makes it stress free day .", "pros": "free state of art Gym", "cons": "Long Hours", "date_created": "18 September 2013"},
{"id": "54f6a830d6da2cf9", "rating": 5.0, "text": "A typical day at work consisted of interacting with many patrons and assuring their safety at the pool. I have learned to communicate effectively with different types of people as we get a lot of people coming into the pool each and everyday. I also learned to work well with little kids as I had to teach them. The management was great as I was never confused as to who I reported to. I enjoy spending time with my co-workers as we were all similar in age (students) and we would have a lot to talk about during break times. The hardest part of the job is when a patron gives you a hard time because you have to always keep your calm even when you know they are wrong.", "pros": "great pay for a student (above minimum wage)", "cons": "", "date_created": "16 September 2013"},
{"id": "b6d7883a9e02e9b6", "rating": 4.0, "text": "Taught piano, kids were fine, a lot of lazy coworkers, everyone doing it for the money or as a stepping stone to something else they'd like to do.", "pros": "", "cons": "", "date_created": "10 September 2013"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "cb0ca85d40738462", "rating": 3.0, "text": "Its a nice place to work on. I want to move on and get an 8 hour full time Job with Benefits", "pros": "", "cons": "", "date_created": "9 September 2013"},
{"id": "3b5747f21e76d442", "rating": 5.0, "text": "Working for the municipality of the mega city presents a large opportunity to discover different avenues in which one can prosper. Toronto offers the most variety of programs to suit anyone's needs. Being a part of such a large group of dedicated workers felt great.", "pros": "Work in the City", "cons": "Job Security", "date_created": "26 August 2013"},
{"id": "49522d8ef0f6d661", "rating": 5.0, "text": "Working for the city of toronto is great because it is well respected.\nthe most enjoyable part of the job is seeing the progress and smiles of each student.", "pros": "Easy going and fun", "cons": "not enough hours", "date_created": "20 July 2013"},
{"id": "906f40032fd61ac3", "rating": 4.0, "text": "Would provide children with a 2 week program to educate them further in dance, We would provide trips, and shows at the end of the year. This required managing a schedule, and budget planning.", "pros": "working with kids, co-workers", "cons": "", "date_created": "15 July 2013"},
{"id": "c589f05d09c4823d", "rating": 5.0, "text": "I worked in focus on youth which is a summer job . i learnt how to be a team player and how to take care of kids . I knew my co-works so i had fun with them . The  hardest part of the job the is some of the kids dont really listen to us .", "pros": "team work", "cons": "long hours", "date_created": "10 July 2013"},
{"id": "fafc1c2ee3fe1c9b", "rating": 4.0, "text": "A typical day consists of maintaining a safe environment for patrons and ensuring the safety of children. ", "pros": "", "cons": "", "date_created": "14 June 2013"},
{"id": "7227488573b317bf", "rating": 5.0, "text": "I developed skills in policy paper research, briefing notes and working in a fast paced municipal government workspace.", "pros": "", "cons": "", "date_created": "29 May 2013"},
{"id": "38db699045a4f6e3", "rating": 4.0, "text": "i learned to work hard and you will be rewarded. Some of the management didn't allow you to instill your vision and lack understanding of what direction to go in. the clients were great and it was an honor to serve them.", "pros": "great pay", "cons": "some poor management", "date_created": "22 May 2013"},
{"id": "36992b749cc59b2d", "rating": 3.0, "text": "Supervised youth in gym, there was not much to learn with this job, management was good, my  co-workers was good people to work with, the hardest part of the job was dealing with some of the kids that don't listen, but on the good hand and enjoyable part of the day was the good children.   ", "pros": "", "cons": "short hours", "date_created": "21 May 2013"},
{"id": "2a28e40ccb51bf00", "rating": 5.0, "text": "Being a lifeguard means being in the water all the time teaching children to swim. \nYou -must- keep all yours quals up to date (pay for them yourselves), your co workers are generally aged 16-22 with supervisors being 22-28, so its a young environment. ", "pros": "being in a near water", "cons": "Chlorine", "date_created": "20 May 2013"},
{"id": "39c3abae910315ee", "rating": 4.0, "text": "Accuracy and efficiency both are equally important at work.", "pros": "", "cons": "", "date_created": "9 May 2013"},
{"id": "6fbd0dbc97cfcc53", "rating": 3.0, "text": "A typical day at work entailed greeting all visitors and directing them to various personnel\nReceiving and screening telephone calls and transferring to the right department as well as taking messages and relaying to the relevant staff member\nEnjoyed working as part of a team to organize internal fundraising events\nEffectively performed general administrative functions", "pros": "", "cons": "", "date_created": "20 April 2013"},
{"id": "15f8a026846381f9", "rating": 5.0, "text": "A typical day at work consists of gathing information for applications that have been submitted for construction, renovation etc. The job requires that a fair bit of research is do prior to issuing job to an examiner for review. Management is very cooperative and is knowledgabe of construction in the district. Co-workers are professional and quite lovely to work with. The most enjoyable part of the job is keep busy as well as continued learning.", "pros": "learning", "cons": "client unreasonable demands for review to be completed", "date_created": "5 April 2013"},
{"id": "613ce2f1b99a2e12", "rating": 4.0, "text": "Face to face customer service each day dealing with public and clients alike.\nMeeting weekly deadlines and continuously under pressure with two week cycle. I've learned business on both sides of the counter and have great skills to deal with tempers, concerns either real or not.\nCo-workers can make the day enjoyable, I get along with my co-workers as they can help in my success.\nThe most enjoyable part of my week is when someone offers me a sincere thank you, that I made a difference and that my professional advice and mannerism made their decision clearer.", "pros": "benefits", "cons": "work isn't as fulfilling as i would like.", "date_created": "3 April 2013"},
{"id": "91b7cb039b4b5568", "rating": 4.0, "text": "I love to keep learning and work with high performance teams in order to provide the best bilingual customer service. I really appreciate being responsible to undertake various duties and responsibilities: prioritization, sharing of work, communication of status and how and timeline to complete, and sharing experience with fellow workers.", "pros": "lots of training offered", "cons": "very formalized breaks and lunch....not always timely with providing best customer service, etc.", "date_created": "25 March 2013"},
{"id": "83a62e18a1d6bea3", "rating": 4.0, "text": "This is a difficult field. Lot's of sepsperate, unhappy clients", "pros": "", "cons": "", "date_created": "15 March 2013"},
{"id": "ac41f6c7973872d5", "rating": 3.0, "text": "A good place to work. A fair bit of independence; not much advancement opportunity", "pros": "", "cons": "", "date_created": "15 March 2013"},
{"id": "565d55de629a2980", "rating": 4.0, "text": "Last years typical day was working two jobs. First starting at 6 a.m. landscaping. This would require a lot of digging, moving dirt and planting/replanting. After this i would go to my second job, lifeguarding. This would consist of dealing with patrons problems, ensuring all around safety for everyone and ensuring rules are followed. There doesn't have to always be a hard day, but the heat can sometimes be difficult with lack of water. The most enjoyable would be the cool swim at the end.", "pros": "good staff", "cons": "", "date_created": "10 March 2013"},
{"id": "52f50ec5d5f5ed38", "rating": 5.0, "text": "Working with city as support c. Learn about inventory, supply, materials order according requirment.", "pros": "", "cons": "", "date_created": "2 March 2013"},
{"id": "2368160055011e41", "rating": 4.0, "text": "I enjoy working for the City of Toronto. They are able to provide me with working hours that are suitable for my schedule. Strong accommodation from my employer, highly PR oriented staff and approachable team.", "pros": "", "cons": "", "date_created": "23 February 2013"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "c900a89e0a34e86c", "rating": 4.0, "text": "Typical day you welcome parents and children in the early morning begining at 7:00am. Care for children teaching life skills throughout the day as required. Management is very strict with ground rules. However, they can be fun and outgoing. Your co-workers are fun to work with. They have the ability to work under stress with a smile on their faces despite having a difficult day. The hardest part is saying goodbye to children who are graduating to another level or leaving the centre permanently. Also seeing a child taken away by child protective services. The most enjoyable part is seeing the children grow up right before your eyes from infants to teenagers, and sometimes young adults returning with their own bundle of joy for you to care for them.", "pros": "room to learn and grow in the filed.", "cons": "can be very frustrating enviroment. expectations are very high.", "date_created": "16 February 2013"},
{"id": "38be1c0ab5af0969", "rating": 4.0, "text": "It is a diverse work environment where employees are treated with dignity and respect. A typical day at work can be unpredictable you are never able to premeditate what might take place. Management is great , always there for support. Co-workers are team players always working together. The most enjoyable part of this job is rewarding feeling at the end of the day , knowing you are a positive influence in the children's lives.", "pros": "great support", "cons": "not enough schedule hours", "date_created": "14 February 2013"},
{"id": "d7c881851970bc1f", "rating": 5.0, "text": "Many varying opportunities to grow and develop different financial as well as non-financial skills.\nMany opportunities to develop leadership skills such as understanding and developing communication nuances of staff with multicultural backgrounds.", "pros": "opportunities to appreciate the formal internal control structures of a large organization", "cons": "formalities has inherent restrictions and bureaucracy which slows the pace of achievements", "date_created": "9 February 2013"},
{"id": "96673492dc1e7b2b", "rating": 5.0, "text": "Reports to the Labour Relations Manager and contributes to the goals and objectives of the City of Toronto\n• Assists the Labour Relations Consultants with ongoing administrative including supporting with the gathering of information to prepare grievance files, arbitration cases for appropriate proceedings and the interpretation of CUPE Local 416 and 79 Collective Agreements\n• Prepares statistical reports using the Grievance Tracking System (GTS) of types and frequency of actions taken concerning grievances, arbitration, mediation, and related labour relations activities to identify problem areas\n• Researches and conducts relevant data to support City of Toronto’s Progress Report on Equity, Diversity and Human Rights (EDHR) Achievements", "pros": "great labour relations department with supportive mentors", "cons": "", "date_created": "24 January 2013"},
{"id": "5931f5d32b1efa8b", "rating": 5.0, "text": "I work part time as a fitness instructor with people from different cultures and age groups. I can strongly say, I have good communication/people skills, as well as patience and dedication. I enjoy helping people reach their fitness goals and will help them as much as I possibly can in order for them to be satisfied.", "pros": "meeting different people, getting to work with them closely", "cons": "wish to have more hours, looking for a more stable, full time job", "date_created": "24 January 2013"},
{"id": "7bd58e02442635d2", "rating": 3.0, "text": "A typical day involves working with the general public, staff, contract workers and politicians on various projects and activities. The hardest part of the job is dealing with union grievances and scheduling due to continued budget cut backs and reduced budgets.\nThe most enjoyable part of the job is working with capital project staff, community organizations and members of the public to keep them healthy and active with what ever activities they are involved with.\nIn addition, assisting the various community cultural organizations and associations in acquiring space and/or information on accessing city services and facilities.", "pros": "the various number of people you meet and have the opportunity to work with.", "cons": "not enough hours in a day to help those who need it.", "date_created": "23 January 2013"},
{"id": "33b50d8a2c85f639", "rating": 5.0, "text": "Typical day at work included heading out to construction site - ensure contractor's work is up to specifications, take measurements and write cost sheets for payment.\nManagement and co-workers were very helpful in teaching me the ropes of this profession and helping me learn what to look for in various construction activities and how to ensure work is according to City of Toronto specifications.\nHardest part of job was to make on-site decisions which would often require work costing more than what was planned for.", "pros": "great work atmosphere and ability to work independently.", "cons": "", "date_created": "21 January 2013"},
{"id": "6ca2b2e08d18c87d", "rating": 5.0, "text": "I enjoy the City of Toronto because the day allows for a variety. I have learned that putting customers first (in this case families first) is absolutely essential to ensuring they have what they need.\nThe management team is always there to help and answer any questions and provide other opportunities for growth.\nMy co-workers are friendly and are team players so that makes it easy to get along.\nThe hardest part is dealing with residents who have such severe dementia for instance they're unable to effectively stay what they desire and I'm unfortunately unable to help like I wish.\nThe most enjoyable is making the residents who wish to share their life story, smile and feel loved.", "pros": "", "cons": "", "date_created": "4 December 2012"},
{"id": "40da73fb08b5112c", "rating": 4.0, "text": "Working at the City of Toronto with Adapted and Integration has been great. I love working with the community and making a difference. Everyday going in to work is something different and challenging working with special needs youth. My co-workers are a blast to work with a very supportive. Although it can be quite challenging to go into work expecting the unexpected it is quite enjoyable and I like program planning and execution.", "pros": "flexible hours, meeting new people, variation", "cons": "not enough hours", "date_created": "27 November 2012"},
{"id": "e19e8952f7a0bd11", "rating": 5.0, "text": "As Information and Technology Supervisor, my duties included developing applications for different Departments.\nI was also the Microsoft Server Administrator and was in charge of writing a monthly summary of Microsoft and Oracle licenses used by the Departments for the IT Director and Manager.", "pros": "great learning experience", "cons": "long hours", "date_created": "2 November 2012"},
{"id": "c48d6861d48fc0e4", "rating": 5.0, "text": "Very well organized. Every officer knew his/her duties.\nI was in charge of approving the Security Occurrence Reports and I developed a Security Report writing program which was used by the City of Toronto Security Services for a number of years in the late 90s.", "pros": "", "cons": "", "date_created": "2 November 2012"},
{"id": "649940df63615fe6", "rating": 5.0, "text": "In my opinion the City of Toronto is the best place to work. The workplace are a friendly environment that you never feel tired.", "pros": "there is nothing free, but every one is friendly.", "cons": "35 hours per week plus 10 hours overtime work", "date_created": "11 October 2012"},
{"id": "2845c4b306e0dac5", "rating": 5.0, "text": "I contact clients, setup appointments to meet with client(s), explain the procedure of obtaining a Record Suspension", "pros": "", "cons": "", "date_created": "10 October 2012"},
{"id": "46ee8977a4ac90c4", "rating": 5.0, "text": "I was an intern so I would do what they asked me to do. I would do stuff like:\n-write media releases\n-monitor the media for hours\n-I got to be apart of Nuit Blanche", "pros": "they made sure i was treated well as an intern", "cons": "", "date_created": "10 October 2012"},
{"id": "6996a7a16b4c0afc", "rating": 4.0, "text": "You learn how to deal with different people in all situations. Improving more in customer satisfaction aspects.", "pros": "meeting a lot of passengers from all over the world visiting toronto islands", "cons": "dealing with intoxicated passengers", "date_created": "30 September 2012"},
{"id": "2c8d86104606da1e", "rating": 4.0, "text": "Long hours working with both people and animals. Unionized environment.", "pros": "working with animals", "cons": "long hours", "date_created": "11 September 2012"},
{"id": "ae43b0be21982c68", "rating": 4.0, "text": "A typical day, included guarding the ice rink, ensuring that no one was putting anyone else at risk of injury, and socializing with those willing to speak with us. My co-workers were all very well prepared for the job they were given, and they all delivered the expectations of our employers. The hardest part of the job was remaining calm when people chose not to listen to what you were saying.. The most enjoyable part of the job was being on the ice all the time, as hockey is one of my favourite hobbies.", "pros": "", "cons": "", "date_created": "30 August 2012"},
{"id": "e0e3b0abeb897d44", "rating": 4.0, "text": "As a taekwon-do instructor i do get the opportunity to work with kids and adults ,and it is a great feeling to be a positive part of the kids lives, i have seen my students growing for years to the point where they start talking about college and university knowing that they are street smart and can defend them selves is very rewarding.", "pros": "ability to work with the community and be a positive part of their lives", "cons": "not every child gets the same support from their guardian", "date_created": "28 August 2012"},
{"id": "bb9adaa84f27504e", "rating": 5.0, "text": "fun , diverse, practical, energetic, long, co workers are friendly, the youth are very manageable", "pros": "easy practical", "cons": "tiring", "date_created": "17 August 2012"},
{"id": "cc9d6062a1161e00", "rating": 5.0, "text": "This has been a great working experience, dealing directly with enterprise clients and helping them market and manage their online portfolios via City of Toronto. I've learned how to juggle a number of clients at once as well as trouble shoot, build and edit content required on a case by case basis.", "pros": "flexibility with hrs, laid back culture", "cons": "the work is not technically progressive, as most government jobs however, i have kept myself learning more technologies including developing my own content management system.", "date_created": "9 August 2012"},
{"id": "13309d0364ee6353", "rating": 4.0, "text": "The City of Toronto has a lot of potential to be a great employer, but top level management is so poor that nothing gets done and changes take years to implement. Their web systems are behind the times and the IT department is hesitant to make changes because of the lengthy paperwork and approval process involved. Consequently, employees are left justifying old methodology and outdated systems to the public. Also, many positions are granted not to the best candidate but to a candidate with more seniority.", "pros": "benefits, pension, sick time, holiday", "cons": "management, paperwork, seniority", "date_created": "13 September 2016"},
{"id": "4f4a561788327f15", "rating": 2.0, "text": "The City of Toronto is expanding with residents arriving from all over the World. The City needs to gear to these changes. At this time, the City is a hard place to work as economic times are bad.\nPleasant place if career goal to work as a municipal employee.", "pros": "excellent benefits", "cons": "union and management environment", "date_created": "8 August 2012"},
{"id": "ae00ec91faa8eb2e", "rating": 4.0, "text": "How to communicate and assist the public with anything they need.", "pros": "", "cons": "", "date_created": "30 July 2012"},
{"id": "7c2e8cef420a00db", "rating": 3.0, "text": "A typical day is very busy with alot of phone calls and reception relief work.\nYou learn alot of course by communication with the clients and staff.\nCo-workers try to be helpful. The hardest part I find is dealing with the amount of work.\nThe enjoyable part is getting things organized so that the next day may not be as hard.", "pros": "best benefits in the city.", "cons": "because of the union/non-union staff sometimes your not sure who to listen to.", "date_created": "24 July 2012"},
{"id": "2ed0b7b9702bff5b", "rating": 4.0, "text": "I wrote press releases, community listings, PSAs, speeches and other communication tools; I dealt with journalists, created posters, brochures, photo organizational charts, newsletter entries; I planned events for the City of Toronto such as art and plaque unveilings, community centre openings, Remembrance Day ceremonies, park openings, charity drives, etc.", "pros": "located in the city's core, amid lots of action and events.", "cons": "open format work place without walls was very loud and distracting.", "date_created": "22 July 2012"},
{"id": "9e3c4c6866bc0a12", "rating": 5.0, "text": "Typical day starts with opening the pool and taking chemical readings. From there on i will be in charge of my staff to properly set up the deck and assign guarding and teaching responsibilities. Throughout the shift i am responsible for making sure all patrons are safe and in case of emergency quickly respond to the situation and provide first aid treatment if necessary. I really enjoy the environment and people i am working with. It is a fun and exciting job to come to.", "pros": "great benefits, good pay", "cons": "low hours", "date_created": "11 July 2012"},
{"id": "7aa6eccdd0c9ac26", "rating": 4.0, "text": "Relaxed Enviornment - Slow Pace work. City is great place for some one looking for work life balance and great job security.", "pros": "", "cons": "", "date_created": "29 June 2012"},
{"id": "ab41cf08cac0127d", "rating": 3.0, "text": "Although co-workers are fun and enjoyable, management is a total mess. Scheduling information, trainings and updates are rarely scheduled in advanced and usually rushed. Supplies are not always there and you will always have to make do with what is available. Supervisors are very biased and favour some employees over others for redundant reasons.", "pros": "great pay", "cons": "horrible management", "date_created": "26 June 2012"},
{"id": "2689f01cfd2dc27a", "rating": 5.0, "text": "Was overall very good and productive\nand the hardest time was to work in winter outside", "pros": "good benefits", "cons": "7 hours a day", "date_created": "13 June 2012"},
{"id": "d133e1fada2d7873", "rating": 5.0, "text": "Excellent place to work - loved the job. Short term contract position.\nLoved the work, people I met. Excellent supervisor. Loved the employer.", "pros": "opportunity to work for this employer", "cons": "short term contract completed, would have like to work there longer or full time", "date_created": "15 May 2012"},
{"id": "32ff8938df83c038", "rating": 5.0, "text": "great work environment. Interesting, diverse work day. Wonderful people to work with, dedicated professionals.", "pros": "", "cons": "", "date_created": "6 April 2012"}
]